[
	"DOMi: DOM Inspector - DOM Inspector (DOMi) is one of the web developer tools included in Mozilla Application Suite and Mozilla Firefox. The main function of the DOM Inspector is to inspect the Document Object Model tree of HTML and XML-based documents.",
	"Donateware - Donateware (or donationware) is freely distribution software. But the user must donate to a charitable cause in order to \"register\" the software. Sometimes the author of the program stipulates which charity the user must donate to, sometimes they just suggest one, and sometimes the author leaves the choice up to the user. Normally the user does not need to contact the author with any information in order to \"register\" their program - it is implicit with the donation (registering does not \"unlock\" any extra features).",
	"DOOM - DOOM is a 1993 computer game by id Software that is among the landmark titles in the first-person shooter genre. It is widely recognized for its pioneering use of immersive 3D graphics, networked multiplayer gaming, and the support for players to create custom expansions (WADs). Distributed as shareware, Doom was downloaded by an estimated 10 million people within two years, popularizing the mode of gameplay and spawning a gaming subculture; as a sign of its impact on the industry, games from the mid-1990s boom of first-person shooters are often known simply as \"Doom clones\". Its graphic and interactive violence has also made Doom the subject of much controversy reaching outside the gaming world.",
	"Doom WAD - Doom WADs (Where's All the Data?) are mods for the computer game Doom or its sequel Doom II. Immediately after its release in 1993, Doom attracted a sizeable following of players who created their own WAD files packages containing levels, graphics and other game data and played a vital part in spawning the mod-making culture which is now commonplace for first-person shooters. Literally thousands of WADs, ranging from single custom levels to full original games, have been created for Doom; most of these can be downloaded for free over the Internet. Several WADs have also been released commercially, and for some people the WAD-making hobby became a gateway to a professional career as a level designer.",
	"DOS: Disk Operating System - Disk Operating System (DOS) commonly refers to the family of closely related operating systems which dominated the IBM PC compatible market between 1981 and 2000: PC-DOS, MS-DOS, FreeDOS, DR-DOS, Novell-DOS, OpenDOS, PTS-DOS, ROM-DOS and several others. Of these, MS-DOS from Microsoft was the most widely used. These operating systems ran on IBM PC type hardware using the Intel x86 CPUs or their compatible cousins from other makers. Such a system must handle physical disk I/O, the mapping of file names to disk addresses and protection of files from unauthorised access (in a multi-user system). DOS should present a uniform interface to different storage device such as floppy disks, hard disks and magnetic tape drives. It may also provide some kind of locking to prevent unintentional simultaneous access by two processes to the same file (or record).",
	"DotGNU - DotGNU is a GNU-sponsored project for devising web services, software componentry and the like. It is compatible with Microsoft .NET and similar to the Mono project from Novell.The DotGNU developers say that while they realize that the Microsoft .NET platform is a powerful concept, its commercialization by a single company may be threatening the free software movement. There are nonetheless a lot of open source projects being made in C#.",
	"DotNetNuke - DotNetNuke is a free, open source, extensible content management system ideal for creating and maintaining professional websites. Originally based on the iBuySpy code demo released by Microsoft, the system is now in its 3rd edition. You customize the look and feel of your site by creating one or more Skins that require little more than HTML knowledge to create. Like many other Content Management Systems, the power of DotNetNuke lies not so much in its built-in features but its easy extensibility.",
	"Doxygen - Doxygen is a Documentation generator for C++, C, Java, IDL (Corba and Microsoft flavors) and to some extent Objective-C, PHP, C# and D. Being highly portable, it runs on most Unix systems as well as on Windows and Mac OS X. Most of the Doxygen code was written by Dimitri van Heesch.",
	"Drawing Program - Drawing program allows a user to draw freehand and create complex graphics. It may include features such as special fonts, clip art, or painting facilities that allow a user to simulate on the computer the drawing characteristics of specific real-world implements such as charcoal, watercolours, or pastels. For example, Corel Draw and Adobe Illustrator are drawing programs.",
	"DRDA: Distributed Relational Database Architecture - Distributed Relational Database Architecture is an IBM proprietary architecture for relational database.",
	"Dreamweaver - Dreamweaver is an HTML editor developed by Macromedia, now part of Adobe Systems. It was originally designed for professional web designers and offers an editing system that combines both the productivity of WYSIWYG design with the control of HTML code editing mode. This combination was quite unique in late 1990s and helped Dreamweaver to a widespread adoption. It is currently available for Mac and Windows and holds about 80% of the professional HTML editor market.",
	"Dribbleware - Dribbleware refers to the software which is prematurely released with frequent update, fixes, and patches after release. With the intense market pressure to release software products as soon as possible, and with the increased ease of updating software via Internet downloads, dribbleware is becoming the norm rather than the exception.",
	"Driver Wrapper - A driver wrapper is software that functions as an adapter between an operating system and a driver, such as a device driver, that was not designed for that operating system. It can enable the operating system to use technologies for which no native implementation exists.",
	"Drupal - Drupal is a content management framework, content management system and blogging engine which was originally written by Dries Buytaert as a bulletin board system. Drupal has become much more, thanks to its flexible architecture, and is the software used to power Debian Planet, Terminus1525, Wikinerds Portal, Spread Firefox, and KernelTrap, among others. Drupal is written in PHP using strict coding standards.",
	"DSI: Delivered Source Instruction - Delivered source instruction (DSI) refers to one line of new source code developed for software. DSI is used to estimate software cost. Typically expressed in thousands of lines of code (e.g., 5,000 DSI or 5KDSI). DSI is the primary input to many tools for estimating software cost. The term \"delivered\" is generally meant to exclude non-delivered support software such as test drivers. However, if these are developed with the same care as delivered software, with their own reviews, test plans, documentation, etc., then they should be counted. The \"source instructions\" include all program instructions created by project personnel and processed into machine code by some combination of preprocessors, compilers, and assemblers. It excludes comments and unmodified utility software. It includes job control language, format statements, and data declarations.",
	"DSL: Domain-Specific Language - Domain-specific language(DSL), also known as domain-specific programming language, is a programming language designed to be useful for a specific set of tasks. Examples of DSLs include spreadsheet macros, YACC for parsing and compilers, Csound, a language used to create audio files, and GraphViz, a language used to define directed graphs, and create a visual representation of that graph. DSLs have also been called by various names: Little languages, Macros, Application languages, Very high level languages, etc.",
	"DSSI: Disposable Soft Synth Interface - Disposable Soft Synth Interface (DSSI) is a virtual instrument (software synthesizer) plugin architecture for use by music sequencer applications. It was designed for applications running under Linux, although there is nothing specific to Linux in the interface itself. It is sometimes described as \"LADSPA for instruments\". LADSPA is the more general plugin architecture for filters, reverbs and other sound processing software tools, whereas DSSI is specifically for instruments. DSSI, however, uses LADSPA as an event transport mechanism and as such extends LADSPA.",
	"DW: Data Warehouse - Data warehouse (DW) is a computer database that collects, integrates and stores an organization's data with the aim of producing accurate and timely management information and supporting data analysis. A DW typically has the following characters: 1) SUBJECT oriented, meaning that the data in the database is organised so that all the data elements relating to the same real-world event or object are linked together; 2) Time variant, meaning that the changes to the data in the database are tracked and recorded so that reports can be produced showing changes over time; 3) Non-volatile, meaning that data in the database is never over-written or deleted, but retained for future reporting; and, 4) Integrated, meaning that the database contains data from most or all of an organisation's operational applications, and that this data is made consistent.",
	"EBNF: Extended Backus Naur form - Extended BackusNaur form (EBNF) is an extension and simplification of the original Backus–Naur form (BNF) metasyntax notation. Originally developed by Niklaus Wirth, the most commonly used variants of EBNF are currently defined by standards, most notably ISO-14977.",
	"ECM: Enterprise Content Management - Enterprise Content Management (ECM) is any of the strategies and technologies employed in the information technology industry for managing the capture, storage, security, revision control, retrieval, distribution, preservation and destruction of documents and content. ECM especially concerns content imported into or generated from within an organization in the course of its operation, and includes the control of access to this content from outside of the organization's processes.",
	"Editor - Editor in computing refers to an application program that enables you to create and edit some types of files. There are many different types of editors, such as: text editor, an application to edit plain text; hex editor, an application to edit binary data; HTML editor, an application to edit webpages; XML editor, an application to edit XML data; digital audio editor, an application to edit audio data; raster graphics editor; vector graphics editor; level editor, an application to edit levels of computer games; etc.",
	"EFence: Electric Fence - Electric Fence (eFence) is a memory debugger written by Bruce Perens. It consists of a library which a programmer can link into his or her code to override the standard library memory management functions. eFence triggers a program crash when the memory error occurs, so a debugger can be used to inspect the code that caused the error.",
	"EFSM: Extended Finite State Machine Model - Extended Finite State Machine Model (EFSM) is an enhanced model based on the traditional finite state machine (FSM), which is a model of behavior composed of states, transitions and actions. In a conventional FSM, the transition is associated with a set of input Boolean conditions & a set of output Boolean functions. In an EFSM model, the transition can be expressed by an if statement. If trigger conditions are all satisfied, the transition is fired, bringing the machine from the current state to the next state and performing the specified data operations. The models are used widely in modeling reactive systems, linguistics, computer science, philosophy, biology, mathematics, and logic.",
	"EGCS: Experimental/Enhanced GNU Compiler System - Experimental/Enhanced GNU Compiler System(EGCS) was a compiler system which forked from the GNU Compiler System (GCC) in 1997 and was re-merged in April 1999. By 1991, GCC 1.x had reached a point of stability, but architectural limitations prevented many desired improvements, so the Free Software Foundation started to work on GCC 2.x.",
	"EIAS: Electric Image Animation System - The Electric Image Animation System (EIAS) is a 3D computer graphics package published by EI Technology Group. It currently runs on the Mac OS X, Windows, and Solaris platforms. EIAS's primary competitors in the integrated 3D package space are Autodesk with Maya and 3D Studio Max, Avid with Softimage|XSI, Maxon with Cinema 4D, and Newtek with LightWave 3D.",
	"Emacs - Emacs is a class of text editors, possessing an extensive set of features, that are popular with computer programmers and other technically proficient computer users. Many versions of Emacs have appeared since 1975 when the original version was introduced, but nowadays there are two that are commonly used: GNU Emacs, started by Richard Stallman in 1984 and still maintained by him, and XEmacs, a fork of GNU Emacs which was started in 1991 and has remained mostly compatible. Both use a powerful extension language, Emacs Lisp, that allows them to handle tasks ranging from writing and compiling computer programs to browsing the web.",
	"Emacs LISP - Emacs LISP is a dialect of the Lisp programming language used by the GNU Emacs and XEmacs text editors (which will be collectively referred to as Emacs in this article.) It is used for implementing most of the editing functionality built into Emacs, the remainder being written in C. Users of Emacs commonly write Emacs Lisp code to customize and extend Emacs.",
	"Emulation - Emulation refers to the capabilities of a program or device to imitate another program or device. Emulation attempts to model, to various degrees, the state of the device being emulated. Emulation tricks other systems into believing that the device is really some other emulated device. A example of emulation is to mimic the experience of running arcade games or console games on personal computers. In a networked environment, a computer acts as if it is another kind of computer or terminal. For example, a PC user opens a remote terminal session to a Unix, so it may run a program that emulates an Unix terminal.",
	"Emulation Mode - Emulation Mode is an operational state of a computer when it is running a foreign program under emulation. For example, a PC user opens a remote terminal session to a Unix, and it may run a program that emulates an Unix terminal.",
	"Emulator - Emulator is a software or hardware device with emulation program to imitate another program or device. A software emulator allows computer programs to run on a platform (computer architecture and/or operating system) other than the one for which they were originally written. A hardware emulator is an emulator which takes the form of a hardware device. Examples include printer emulators inside the ROM of the printer, and FPGA-based emulators.",
	"Enterprise Software - Enterprise Software is a type of software that solves an enterprise wide problem (rather than a departmental problem) and usually enterprise software is written using Enterprise Software Architecture. Due to the cost of building what is often proprietary software only large organizations attempt to build software that models the entire business enterprise and is the core system of governing the enterprise and the core of business communications within the enterprise. Enterprise software is often categorized by the business function that it automates - such as accounting software, human resource management or sales force automation software. It also varies by industry verticals due to common business processes within a specific industry. There are enterprise systems devised for health care, for example, or for manufacturing enterprises.",
	"Enterprise Software Architecture - Enterprise Software Architecture, also known as Enterprise Architecture, is the practice of applying a comprehensive and rigorous method for describing a current and/or future structure and behaviour for an organization's processes, information systems, personnel and organizational sub-units, so that they align with the organization's core goals and strategic direction. Although often associated strictly with information technology, it relates more broadly to the practice of business optimization in that it addresses business architecture, performance management and process architecture as well.",
	"Entropy - Entropy, a concept in physics, is a measrue of disorder or randomness of a system. In data compression, it is a measure of the amount of non-redundant and non-compressible data in an object (the amount that is not similar). In encryption, it is the amount of disorder or randomness that is added. In software, it is the disorder and jumble of its logic, which occurs after the program has been modified over and over.",
	"ESC/Java: Extended Static Checker for Java - Extended Static Checker for Java (ESC/Java) is a Compaq (now part of HP) programming tool that attempts to find common run-time errors in Java programs by static analysis of the program text. Users can control the amount and kinds of checking by annotating their programs with specially formatted comments or pragmas.",
	"Etnus TotalView - Etnus TotalView is a debugger for Unix-like and Mac OS X systems and supports C/C++ and Fortran. It allows process control down to the single thread, the ability to look at data for a single thread or all threads at the same time, and the ability to synchronize threads through breakpoints. TotalView integrates memory leak detection and other heap memory debugging features. Data analysis features help find anomalies and problems in the target program's data, and the combination of visualization and evaluation points let the user watch data change as the program executes.",
	"Evaluation Strategy - An evaluation strategy (or reduction strategy) for a programming language is a set of (usually deterministic) rules for defining the evaluation of expressions under β-reduction. Emphasis is typically placed on functions or operators — an evaluation strategy defines when and in what order the arguments to a function are evaluated, when they are substituted into the function, and what form that substitution takes. A language may combine several evaluation strategies; for example, C++ combines call-by-value with call-by-reference. Most languages that are predominantly strict use some form of non-strict evaluation for boolean expressions and if-statements.",
	"Exec Shield - Exec Shield is a security patch for the Linux kernel that adds an NX bit to x86 CPUs. It was developed by Ingo Molnar of Red Hat, and is used as a part of Fedora Core 1, 2 and 3. Exec Shield attempts to flag data memory as non-executable and program memory as non-writeable. This suppresses many security exploits, such as those stemming from buffer overflows and other techniques relying on overwriting data and inserting code into those structures. Exec Shield also supplies some address space layout randomization for the mmap() and heap base.",
	"Extended ASCII - Extended ASCII, also known as high ASCII, is a set of codes using 8 bits for each character, instead of 7 bits as the basic ASCII set. The basic ASCII set provides it a total of 128 unique symbols. The extended ASCII character set gives it an additional 128 characters. The extra characters represent characters from foreign languages and special symbols for drawing pictures.",
	"EXtensible Markup Language (XML) - Extensible Markup Language (XML), a subset of SGML, defines a syntax that lets you create markup languages to specify information structures. Information structures define the type of information, for example, subscriber name or address, not how the information looks (bold, italic, and so on). External processes can manipulate these information structures and publish them in a variety of formats. Text markup language designed to enable the use of SGML on the World Wide Web. XML allows you to define your own customized markup language. XML tags are not predefined. You must define your own tags. XML uses a Document Type Definition (DTD) or an XML Schema to describe the data. XML is not a replacement for HTML. Actually, XML and HTML are complimentary to each other.",
	"External Command - In DOS and OS/2, external command is a function performed by a separate utility program that accompanies the operating system. Contrast with internal command.",
	"Extreme Programming - Extreme Programming (XP) is a software engineering methodology developed by Kent Beck, the most prominent of several agile software development methodologies. It prescribes a set of day-to-day practices for developers and managers; the practices are meant to embody and encourage particular values. Extreme Programming is effectively used with small teams of developers who need to develop software quickly in an environment of rapidly-changing requirements.",
	"EZ Publish - EZ publish is a popular enterprise open source (under the GNU GPL license) content management system (CMS) and development framework, developed, distributed, and supported by eZ systems with input and help from an active user and developer community. While the development has not forked, there also exists a modified version called \"edition pieserver\".",
	"FAB: FORTRAN Assembly Program - FORTRAN Assembly Program (FAP) was a macro FORTRAN assembler for the IBM 709, 7090, and 7094 computers of the 1950s and 60s.",
	"FASM: Flat Assembler - Flat Assembler(FASM) is a free, multiple-pass, Intel-style assembler supporting the IA-32 and x86-64 architectures. FASM is written in assembly language, comes with full source. The project was started in 1999 by Tomasz Grysztar.  It is noted for its fast speed, size optimizations, portability, powerful macro capabilities, and online forum community. However, it uses (almost) no command-line options. Binaries/sources are available for Linux, Windows (w/ IDE), DOS, OpenBSD etc., MenuetOS, OctaOS, and Dex4u. FASM contains bindings to the Windows GUI and OpenGL. All versions of FASM can directly output any of the following: flat binary, ELF or COFF (classic or MS) objects, or executables in either MZ, ELF or PE format. An unofficial port targeting the ARM architecture (FASMARM) exists.",
	"FAST: Federation Against Software Theft - Federation Against Software Theft(FAST) is a non-profit organisation, formed in 1984 by the software industry with the aim of eradicating software theft in the UK. In addition to prosecuting organisations and individuals for software theft, FAST set up a campaign of public education and awareness to ensure that users of commercial software understand the effects of software theft. FAST gives a member organisation, which has signed a Code of Ethics and is committed to the carrying out of a regular software audit, a period of grace before bringing action if there is evidence of irregularities by the member organisation.",
	"FastCAD - FastCAD is a 2D and 3D Computer Aided Design (CAD) program for Windows, which uses FCW as the file extension. It includes 3d modeling and rendering, symbol definition editing, and advanced capabilities for working with multiple drawings and overlays. FastCAD is written in assembler and will run well on basic hardware.",
	"FAT: File Allocation Table - File Allocation Table (FAT) is file system developed by Microsoft for MS-DOS and is the primary file system for consumer versions of Microsoft Windows up to Windows Me. The FAT file system is an ideal format for floppy disks and solid-state memory cards, and a convenient way of sharing data between disparate operating systems installed on the same computer (a dual boot environment). FAT is replaced by New Technology File System (NTFS) since the release of Windows NT.",
	"Fat Binary - A fat binary, also known as multiarchitecture binary, is a computer program that is native to multiple instruction set architectures (ISA) and thus can be run on multiple processor types. The usual method of implementation is to include a version of the machine code for each ISA, resulting in a file n times larger than a normal one-architecture binary.",
	"Fetch-and-add CPU instruction - Fetch-and-add CPU instruction is a special instruction that automatically modifies the contents of a memory location. It is used to implement Mutual exclusion and concurrent algorithms in multiprocessor systems.",
	"Fibonacci Number Program - Fibonacci number program is a popular program in many beginning computer science courses, introducing the concept of recursion by calculating and printing the Fibonacci numbers. In general, however, a recursive algorithm to compute Fibonacci numbers is extremely inefficient when compared to other algorithms, such as iterative or matrix equation algorithms.",
	"Fibonacci Numbers - In mathematics, the Fibonacci numbers is a sequence of numbers defined recursively by the Fibonacci rule: after two starting values, each number is the sum of the two numbers before it. For example, the first Fibonacci numbers for n = 0, 1, 2, 3, are - 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946",
	"Fifth-Generation Programming Language - Fifth-generation programming language (5GL) is a programming language based around solving problems using constraints given to the program, rather than using an algorithm written by a programmer. Most constraint-based and logic programming languages and some declarative languages are fifth-generation languages. Fifth-generation languages are used mainly in artificial intelligence research. Prolog, OPS5, and Mercury are the best known fifth-generation languages.",
	"FileMaker Pro - FileMaker Pro is a desktop-based relational database management system from FileMaker Inc., similar to Microsoft Access. FileMaker was one of a handful of database applications released on the Apple Macintosh in the 1980s.",
	"Filename Extension - Filename extension is a portion of a filename, following the point after the individual file name. Filename extenson indicates the type of data stored in the file. Many operating systems use filename extensions, e.g. Unix,MS-DOS. Examples include \"c\" for C source code, \"doc\" for Miscrosft word, \"ps\" for PostScript, \"txt\" for text fle, etc.",
	"Fiora - Fiora was a Computer role-playing game originally inspired by various bots floating around IRC's EsperNet servers. It took many elements from Tactics Ogre, and derived its turn system from different aspects of James \"Iyouboushi's\" Kaiou bot and Craig's Future bot.",
	"FireFox - Firefox, also known as Mozilla Firefox, is a free, open source, cross-platform, graphical web browser developed by the Mozilla Corporation and hundreds of volunteers. Firefox includes an integrated pop-up blocker, tabbed browsing, live bookmarks, support for open standards, and an extension mechanism for adding functionality. Although other browsers have some of these features, Firefox became the first such browser to include them all and achieve wide adoption.",
	"Firmware - Firmware is software that is embedded in a hardware device. It is often provided on flash ROMs or as a binary image file that can be uploaded onto existing hardware by a user. The firmware typically implements a portion of the network protocols, security mechanisms and administrative capabilities of the hardware device.",
	"First Generation Programming Language - First-generation programming language(1GL) is a machine-level programming language, which was written in 1s and 0s. There is no compiler or translator required and it can be understood and used by a CPU directly. The code using 1GL can run very fast and efficiently since it is directly executed by the CPU. However, machine language is somewhat more difficult to learn than higher generational programming languages, and it is far more difficult to edit if errors occur. Furthermore code portability is significantly reduced in the 1GL based code. First-generation programming language is mainly used now on very ancient computers. Machine level programming still finds a use in several areas of modern programming with the help of native-code compilers which creates machine language, usually from a higher-level language.",
	"FLAC: Free Lossless Audio Codec - Free Lossless Audio Codec (FLAC) is a popular free audio compression codec that is lossless. Unlike lossy codecs such as MP3 and AAC, it does not remove any information from the audio stream and is suitable both for everyday playback and for archiving audio collections. \"Free\" means that the specification of the stream format can be implemented by anyone without prior permission, and that neither the FLAC format nor any of the implemented encoding/decoding methods is covered by any patent. The sources for libFLAC and libFLAC++ are available under Xiph.org's BSD license and the sources for flac, metaflac, and the plugins are available under the GPL.",
	"Flex Lexical Analyser Generator - The Flex lexical analyser generator (Flex) is a free software alternative to Lex. Flex is a tool for generating scanners: programs which recognized lexical patterns in text. Flex reads the given input files, or its standard input if no file names are given, for a description of a scanner to generate. ",
	"FMV: Full Motion Video - Full motion video (FMV) is a popular term for pre-recorded TV-quality movie or animation in a video game. FMV is simply a playback of something that was previously recorded. With modern computer hardware, games are rendered at much higher resolutions than typical FMVs, resulting in FMVs being easily spottable as \"lower quality\" than the game itself. In this case, while a pre-rendered FMV may use more advanced effects than possible in-game, it is considered lower quality due to being seen at a lower resolution.",
	"FOP: Formatting Objects Processor - Formatting Objects Processor(FOP) is an XSL-FO processor written in Java, which provides the feature to convert XSL-FO files to PDF or direct-printable-files. FOP was originally developed by James Tauber who donated it to the Apache Software Foundation in 1999. It is part of the Apache XML project.",
	"FORTRAN - FORTRAN is the oldest high-level programming language, designed by John Backus for IBM in the late 1950s. FORTRAN is a general-purpose, procedural, imperative programming language that is especially suited to numeric computation and scientific computing. It is still in use today, particularly for scientific applications that require extensive mathematical computations. The two most common versions of FORTRAN are FORTRAN IV and FORTRAN 77. A new ISO and ANSI standard for FORTRAN, called FORTRAN-90, was developed in the early 90s.",
	"Forward Compatible - Forward compatible, also known as upward compatible, refers to software that runs not only on the computer for which it was designed, but also on newer and more powerful models. Forward compatibility is important because it means you can move to a newer, larger, and more sophisticated computer without converting your data. An example of upward/forward compatibility is the specification that a web browser ignore HTML tags not recognised. Ignoring data or application instructions not recognized is the typical behavior of forward compatible systems.",
	"Fourier Transform - The Fourier Transform, named after Joseph Fourier, is an integral transform that re-expresses a function in terms of sinusoidal basis functions, i.e. as a sum or integral of sinusoidal functions multiplied by some coefficients (\"amplitudes\"). Fourier Transform technique is used to evaluate the importance of various frequency cycles in a time series pattern.",
	"Fourth-Generation Language - A fourth-generation programming language (4GL) is a programming language closer to human languages than typical high-level programming languages. Such languages arose after the introduction of modern, block-structured third-generation programming languages, which improved the process of software development. Most 4GLs are used to access databases. For example, a typical 4GL command is FIND ALL RECORDS WHERE COMPANY IS \"JAVVIN\".",
	"FPA: Function Point Analysis - Function point analysis (FPA) is a method used to gauge the size and complexity of computer software, employing a function point as a unit of measure. Function points are a unit measure for software size, much like an hour is to measure time.",
	"Free Software - Free software, according to the definition of the Free Software Foundation (FSF), refers to the software that everyone is free to copy, redistribute and modify. That implies that it must be available as source code. It does not imply that it is free of charge, so anyone can sell free software so long as they don't impose any new restrictions on its redistribution or use.",
	"Free Software License - Free software license refers to a license which grants permissions to the recipient to remove any ownership issues which would otherwise prevent the software from being free software. With free software license, recipients of the software is granted the freedom to modify and redistribute the software by the copyright holder.",
	"FreeBASIC - FreeBASIC is an open source (under GPL) 32-bit, BASIC programming language compiler. It is designed to be syntax compatible with QuickBASIC, while expanding on the language and capabilities. It compiles for DOS, Microsoft Windows and Linux, and is being ported to other platforms.",
	"FreeBSD - FreeBSD is a Unix-like free operating system descended from AT&T UNIX via the Berkeley Software Distribution (BSD) branch through the 386BSD and 4.4BSD operating systems. It runs on processors compatible with the Intel x86 family, as well as on many other processors such as AMD64 and PowerPC processors. It also runs on the PC-98 architecture. Support for the ARM and MIPS architectures is currently in development.",
	"FreeDoom - FreeDoom is a Doom WAD file intended to be used instead of the copyrighted file from the original Doom and Doom II. The idea is that since the source to Doom is released as open source you can combine the free game engine with the free WAD to create an entirely free game. This also makes it possible to use all user-made WADs that require the original (and copyrighted) WAD by replacing it.",
	"FreeSBIE - FreeSBIE is a LiveCD (LiveDistro) type of operating system that is able to load directly from a bootable CD without any installation process and without any hard disk. It is based on the FreeBSD operating system.",
	"FreeTDS - FreeTDS is a free open source programming library, that implements the Tabular Data Stream protocol. It can be used in place of Sybase's db-lib or ct-lib libraries. It also includes an ODBC library. It allows many open source applications such as Perl and PHP (or your own C or C++ program) to connect to Sybase ASE or Microsoft SQL Server.",
	"FrontPage - FrontPage is Microsoft HTML editor to be used to create large complex Web sites. FrontPage is a WYSIWYG (what-you-see-is-what-you-get) editor, meaning that you can create the Web page exactly as you want it to look on the screen, and the program adds the HTML source code necessary to make sure that the page looks right in a Web browser.",
	"FSF: Free Software Foundation - Free Software Foundation(FSF) is an organisation devoted to the creation and dissemination of free software, i.e. software that is free from licensing fees or restrictions on use. The Foundation's main work is supporting the GNU project with a basic belief that information is community property and all software source should be shared.",
	"FSM: Finite State Machine - A finite state machine (FSM) or finite automaton is a model of behavior composed of states, transitions and actions. A state stores information about the past, i.e. it reflects the input changes from the system start to the present moment. A transition indicates a state change and is described by a condition that would need to be fulfilled to enable the transition. An action is a description of an activity that is to be performed at a given moment. In addition to their use in modeling reactive systems, finite state automata are significant in many different areas, including linguistics, computer science, philosophy, biology, mathematics, and logic.",
	"FSML: Financial Services Markup Language - Financial Services Markup Language(FSML), a data description language based on the metalanguage Standard Generalized Markup Language (SGML), was developed to create financial documents for delivery over the Internet, including eCheck and their associated documentation. FSML is a set of markup symbols or codes that allows its users to define the individual items that compose a document, assemble items into larger document parts that take on a contextual meaning, and enable the screening of a document for digital signatures, endorsement, additions, or deletions.",
	"FTP Client - FTP client is a software installed on a workstation which uses the FTP protocol to connect to an FTP server to transfer files. Basic FTP clients are part of operating systems, including Windows, DOS, Linux and Unix. However, many enhanced clients are available typically as shareware/freeware for Windows and as free software for Unix-like systems. Many web browsers have built-in FTP clients as well. Commercial FTP clients also exist with high performance or advanced features.",
	"Functional Programming - Functional programming is a programming paradigm that conceives computation as the evaluation of mathematical functions and avoids state and mutable data. Functional programming emphasizes the application of functions, in contrast to imperative programming, which emphasizes changes in state and the execution of sequential commands. Functional programming is defined more by a set of common concerns and themes than any list of distinctions from other paradigms. Often considered important are higher-order and first-class functions, closures, and recursion. Other common features of functional programming languages are continuations, Hindley-Milner type inference systems, non-strict evaluation (including, but not limited to, \"laziness\"), and monads.",
	"Functional Programming Language - Functional programming languages, based on the functional programming paradigm, is a type of programming languages that consist of a set of (possibly recursive) function definitions and an expression whose value is output as the program's result. Functional programing languages are one kind of declarative language. They are based on the typed lambda calculus with constants. There are no side-effects to expression evaluation so an expression. Furthermore, an expression can always be replaced by its value without changing the overall result (referential transparency). Functional programming languages have largely been emphasized in academia rather than in commercial software development. Notable exceptions are Erlang (highly-concurrent telecom applications), J and K (financial analysis), and domain-specific programming languages like XSLT. Important influences on functional programming have been the lambda calculus, the APL programming language, the Lisp programming language, and more recently the Haskell programming language.",
	"GA: Global Arrays - The Global Arrays (GA) is a public domain toolkit that provides an efficient and portable shared-memory programming interface for distributed-memory computers. Unlike other shared-memory environments, the GA model exposes to the programmer the non-uniform memory access (NUMA) characteristics of the high performance computers and acknowledges that access to a remote portion of the shared data is slower than to the local portion. The locality information for the shared data is available, and a direct access to the local portions of shared data is provided. Global Arrays have been designed to complement rather than substitute for the message-passing programming model. The programmer is free to use both the shared-memory and message-passing paradigms in the same program, and to take advantage of existing message-passing software libraries. Global Arrays are compatible with the Message Passing Interface (MPI).",
	"GAMS: General Algebraic Modeling System - The General Algebraic Modeling System (GAMS) is a high-level modeling system for mathematical programming problems. The program itself consists of a language compiler and a group of integrated solvers. Thus, GAMS is not a solver itself.",
	"Gas: GNU Assembler - GNU assembler (Gas) is the default GNU Compiler Collection (GCC) back-end and is used to compile Linux and other operating systems such as the GNU operating system. It is a part of the GNU Binutils package. It runs and assembles on and for a number of different architectures. Gas uses the AT&T assembler syntax, instead of the Intel syntax used in many other assemblers.",
	"GCA - In computing, GCA is a freeware compression utility created in 2000 by Shin-ichi Tsuruta. GCA is a compressed archive format. It has higher compression capabilities than ZIP, especially with binary files. The next generation of GCA is 'DGCA'.",
	"GCC: GNU Compiler Collection - The GNU Compiler Collection (GCC) is a set of programming language compilers produced by the GNU Project. It is free software distributed by the Free Software Foundation (FSF) under the GNU GPL and GNU LGPL, and is a key component of the GNU toolchain. It is the standard compiler for the free software Unix-like operating systems, and several proprietary operating systems, notably Apple Mac OS X. Originally named the GNU C Compiler, because it only handled the C programming language, GCC was later extended to compile C++, Objective-C, Java, Fortran, and Ada among others.",
	"GCJ: GNU Compiler for Java - The GNU Compiler for Java (GCJ) is a compiler for the Java programming language that is part of the GNU Compiler Collection (GCC). It can compile Java source code to either Java Virtual Machine bytecode, or directly to machine code for any of a number of CPU architectures. It can also compile class files containing bytecode or entire Java archives (JARs) containing such class files into machine code. Almost all of the runtime library used by GCJ come from the GNU Classpath project.",
	"GDB: GNU Debugger - GNU Debugger (GDB) is the standard debugger for the GNU software system. It is a portable debugger that runs on many Unix-like systems and works for many programming languages, including C, C++, and FORTRAN. Originally written by Richard Stallman in 1988, GDB is free software released under the GNU General Public License. GDB offers extensive facilities for tracing and altering the execution of computer programs.",
	"GDL: GNU Data Language - GNU Data Language(GDL) is a free IDL (Interactive Data Language) compatible incremental compiler. It runs existing IDL programs from the Research Systems Inc.",
	"GDM:  GNOME Display Manager - GNOME Display Manager(GDM) provides an alternate display manager for the X Window System. The X Window System by default uses the X display manager (XDM). However, resolving XDM configuration issues typically involves using the command line. GDM allows users to customize or troubleshoot settings without having to resort to a command line. Users can pick their session type on a per-login basis. GDM also features easy customisation with themes.",
	"Geeklog - Geeklog is Open-Source software that works as a Weblog, CMS or Web Portal. Geeklog is written in PHP and uses MySQL as a backend database. Geeklog allows you to create your own virtual community portal complete with user administration, story posting, customised look, comments, polls, calendar, web links, content syndication, and more.",
	"Generic Software - Generic Software, contrast with \"custom software\", refers to the ready-made software, traditionally shrink-wrapped but downloadable in today's market. ",
	"GeoGebra - GeoGebra is a free dynamic mathematics software that joins [[geometry[[, [[algebra[[ and [[calculus[[. It is developed for education in secondary schools by Markus Hohenwarter at the University of Salzburg.",
	"Geronimo Application Server - The Geronimo Application Server is an open source application server developed by the Apache Software Foundation, and it is under the Apache licence. The Geronimo application server has already met the Sun J2EE 1.4 Technology Compatibility Kit (TCK) since version 1.0 M4.",
	"gFTP - gFTP is a free/open source multithreaded FTP client. It is most used on Unix-like systems, but it can be used on Microsoft Windows and Mac OS X. It includes both a GUI (which utilizes the GTK+) and a command-line interface. gFTP is released under the terms of the GPL and has been translated into 41 languages.",
	"GHC: Glasgow Haskell Compiler - Glasgow Haskell Compiler (GHC), also known as Glorious Haskell Compiler, is an open source native code compiler for the functional programming language Haskell which was developed at the University of Glasgow.",
	"Ghost: General Hardware-Oriented Software Transfer - General Hardware-Oriented Software Transfer (Ghost) is a disk cloning program, originally produced by Binary Research, but purchased by Symantec in 1998. The Ghost program launched the market for disk-cloning software.",
	"GIFT: GNU Image Finding Tool - GNU Image Finding Tool (GIFT) is a Content Based Image Retrieval System (CBIRS). The GIFT is based on Viper, the result of a research effort at the Vision Group at the computer science center of the University of Geneva. The GIFT is an open framework for content-based image retrieval. It is designed to accommodate new ways of querying the framework. The protocol for client-server communication, MRML, is XML based and fully documented. This aims to promote code reuse among researchers and application developers.",
	"GIMP: GNU Image Manipulation Program - GNU Image Manipulation Program (GIMP) is a bitmap graphics editor, a program for creating and processing raster graphics. It also has some support for vector graphics. The project was started in 1995 by Spencer Kimball and Peter Mattis and is now maintained by a group of volunteers; it is licensed under the GNU General Public License.",
	"glibc: GNU C Library - The GNU C Library (glibc) is GNU's C standard library, a free software package available under the GNU Lesser General Public License. Glibc is used in systems which run many different kernels and different hardware architectures. Its most common use is in Linux systems on x86 hardware, but officially supported hardware includes: x86, Motorola 680x0, DEC Alpha, PowerPC, ARM, ETRAX CRIS, MIPS, s390, and SPARC. "
]
