[
	"Machine Code - Machine code, also known as machine language, is a system of instructions and data directly understandable by computer central processing unit. Every CPU model has its own machine code, or instruction set, although there is considerable overlap between some. If CPU A understands the full language of CPU B it is said that CPU A is compatible with B. CPU B may not be compatible with CPU A, as A may know a few codes that B does not.",
	"Machine Code Instruction - Machine code instruction are the \"words\" of a machine or a computer. Instructions are patterns of bits with different patterns corresponding to different commands to the machine. Every CPU model has its own machine code, or instruction set, although there is considerable overlap between some.",
	"Machine Language - Machine language, also known as machine code, is the lowest-level language (except for computers that utilize programmable microcode) directly understandable by a computer central processing unit (CPU). While easily understood by computers, machine languages are very hard to understand for humans because they consist entirely of numbers. Programmers, therefore, use either a high-level programming language or an assembly language. An assembly language contains the same instructions as a machine language, but the instructions and variables have names instead of being just numbers.",
	"Macro - A macro in computer science is an abstraction, that defines how a certain input pattern is replaced by an output pattern according to a defined set of rules. There are three broad categories of macros, and each takes a different kind of input pattern to produce a different kind of output pattern: Programming macros, Application Macros and Keyboard macros.",
	"Macro Language - A macro language is a programming language in which all or most computation is done by expanding macros. Macro languages are not widely used for general-purpose programming, but are common in text processing applications, for example, C preprocessor and Internet Macros (iOpus).",
	"Macro-instruction - Macro-instruction is an instruction that defines a macro. In assembly language, MACRO and ENDM are examples that define the beginning and end of a macro. In C, the #DEFINE statement is used.",
	"Macromedia Flash - Macromedia Flash, or simply Flash, refers to both a multimedia authoring program and the Flash Player, written and distributed by Macromedia (now part of Adobe Systems). Flash utilizes vector and raster graphics, a native scripting language called ActionScript and bidirectional streaming of video and audio.",
	"MacsBug: Motorola Advanced Computer Systems Debugger - Motorola Advanced Computer Systems Debugger (MacsBug) is a low-level debugger for the Motorola 68000 family of processors specifically designed for the Apple Macintosh.",
	"Magnolia CMS - Magnolia CMS is a free, open source, J2EE deployable content management system (CMS), that is developed by obinary and a growing community of international contributors. It uses the standard API for java content repositories (JCR) to access its content. It is currently available in many languages including Russian, Chinese, English, French, German and Spanish. Magnolia CMS uses the JSR-170 standard API to access its content. It has an easy to use web-browser interface, a clear API and a useful custom tag library for easy templating in JSP and Servlets.",
	"MakeRefMovie - MakeRefMovie is a free, downloadable software from Apple Computers that creates RefMovies (files that point to the location of a video file) for QuickTime streaming video. Versions of the application are also available for Windows systems. Reference Movies can also be created from the command-line with the free tool XMLtoRefMovie.",
	"Mambo CMS - Mambo CMS, formerly named Mambo Open Source(MOS), is an open source content management system (CMS) for creating and managing websites through a simple web interface. Mambo also includes more advanced features such as page-caching to improve performance on busy sites, advanced templating techniques, and a fairly robust API. It can also automate many tasks such as web indexing for static pages. Mambo can provide RSS feeds, printable versions of pages, news flashes, blogs, forums, polls, calendars, website searching, language internationalization, and other possibilities.",
	"MASM: Microsoft Macro Assembler - The Microsoft Macro Assembler (MASM) is an assembler for the x86 family of microprocessors, originally produced Microsoft MS-DOS operating system. It supported a wide variety of macro facilities and structured programming idioms, including high-level constructions for looping, procedure calls and alternation (therefore, MASM is an example of a high-level assembler). Later versions added the capability of producing programs for the Windows operating systems that were released to follow on from MS-DOS. MASM is one of the few Microsoft development tools for which there was no separate 16-bit and 32-bit versions.",
	"MCAD: Microsoft Certified Application Developer - The Microsoft Certified Application Developer (MCAD) certification is the entry-level programming certification. The curriculum covers many topics related to the Microsoft .NET development platform. MCAD certification is for professionals who use Microsoft technologies to develop and maintain department-level applications, components, Web or desktop clients, or back-end data services.",
	"MCDBA:  Microsoft Certified Database Administrator - The Microsoft Certified Database Administrator (MCDBA) credential is for database administrators, who implement and administer Microsoft SQL Server databases. The certification is appropriate for individuals who derive physical database designs, develop logical data models, create physical databases, create data services by using Transact-SQL, manage and maintain databases, configure and manage security, monitor and optimize databases, and install and configure SQL Server. This certification requires passing three core exams, and one elective exam.",
	"MCDST: Microsoft Certified Desktop Support Technician - Microsoft Certified Desktop Support Technician (MCDST) is a lower-level credential that demonstrates a technician can competently support end users and troubleshoot desktop environments running on Microsoft Windows. MCDST candidates are required to pass two core exams. Elective exams are not required. Complete course lasts 50 hours.",
	"MCP: Microsoft Certified Professional - Microsoft Certified Professional (MCP) refers to both an individual Microsoft certification and a broader professional certification program. To be an MCP, candidates must complete any one exam within the program. The MCP program offers multiple certifications, based on different areas of technical expertise. To attain these certifications, a candidate must pass a series of exams within the program. Popular certifications are MCP, Microsoft Certified System Engineer (MCSE) and Microsoft Certified Database Administrator (MCDBA).",
	"MCSA: Microsoft Certified Systems Administrator - Microsoft Certified Systems Administrator (MCSA) certification certifies a user's knowledge in system administration of Microsoft Windows operating systems and is generally simpler than, but not a subset of, the MCSE. The Windows Server 2003 MCSA is achieved upon passing 2 networking system exams, a client operating system exam (generally Microsoft Windows XP), and an elective exam. The Windows Server 2000 MCSA title is granted after taking 3 core exams and one elective. Although the MCSA isn't a subset of the MCSE, it is possible to gain an MCSA on the way to an MCSE without doing any exams that are extraneous to the MCSE on Windows 2000.",
	"MCSD: Microsoft Certified Solution Developer - Microsoft Certified Solution Developer (MCSD) certification is the highest level programming certification offered by Microsoft. To fulfill the requirements of the certification, a total of five exams (four core exams, one elective exam) must be passed. Some of the core exams are also requirements for the MCAD. Microsoft has declared that this certification will be focused towards the needs of developers using .NET Framework 1.0 and 1.1 versions. Developers using .NET Framework 2.0 and Microsoft Visual Studio 2005 are expected to consider obtaining Microsoft Certified Technology Specialist (MCTS) and Microsoft Certified Professional Developer (MCPD) certifications.",
	"MCSE: Microsoft Certified Systems Engineer - Microsoft Certified Systems Engineer (MCSE) qualifies an individual of being able to analyze the business requirements for business solutions and design and implement the infrastructure required. As of 2006, the MCSE is available for two different products, Windows 2000 and Windows Server 2003, each requiring a different set of exams. For the MCSE 2003, candidates must pass six Core exams design exams (Four networking exams, one client operating system and one design exam) and one elective exam, for a total of seven exams. For the MCSE 2000, a candidate needs to pass five Core Exams (Four operating system exams, one design exam) and two electives.",
	"MCT: Microsoft Certified Trainer - Microsoft Certified Trainer (MCT) certification is for individuals who intend to train users wanting to obtain any of the other certifications.",
	"MDX: Multidimensional Expressions - Multi-dimensional Expressions (MDX) is a query language for OLAP databases, which much like SQL is a query language for relational databases. It is also a calculation language, with syntax similar to spreadsheet formulas. MDX was first introduced as part of the OLEDB for OLAP specification in 1997 from Microsoft. The specification was quickly followed by the commercial release of Microsoft OLAP Services 7.0 in 1998, and later by Microsoft Analysis Services. While it was not an open standard, but rather a Microsoft-owned specification, it was adopted by a wide range of OLAP vendors.",
	"Media Cleaner Pro - Media Cleaner Pro is a piece of software used to convert and optimize video and audio files for the Internet, DVD, CD-ROM, PowerPoint presentations, and other digital imagery.",
	"Memory Management - Memory management is a technique used by the Mac OS to optimize the use of memory. The original problem for the designers of the Macintosh was how to make optimum use of the 128 kB of RAM that the machine was equipped with. Since at that time the machine could only run one application program at a time, and there was no permanent secondary storage, the designers implemented a simple scheme which worked well with those particular constraints. However, that design choice did not scale well with the development of the machine, creating various difficulties for both programmers and users. This technique is one of the key areas addressed by the change to Mac OS X.",
	"Memwatch - Memwatch is a free programming tool for memory leak detection in C. It is highly portable ANSI C code which will run on just about any hardware that has a C compiler. While it is primarily intended to detect and diagnose memory leaks, it can also be used to analyze a programs memory usage and provides logging facilities.",
	"Metadata - Metadata is data that describe other data. Metadata refers to information about data itself -- perhaps the origin, size, formatting or other characteristics of a data item. Metadata is of special interest in various fields of computer science, e. g. information retrieval and the semantic web. In the database field, metadata is essential to understanding and interpreting the contents of a data warehouse. Meta tags, a type of metadata, are optional elements defined in the header portion of an HTML or PHP file for web pages.",
	"MicroBSD - MicroBSD is a fork of the UNIX-like BSD operating system descendant OpenBSD 3.0, begun in July 2002. The project's objective to produce a fully secure, complete system, but with a small footprint. The first phase of its development was aborted, but it has been resumed by a new group of developers.",
	"Microcode - Microcode, also known as microprogram, refers to the instruction set of a CPU as a sequence of microcode instructions (microinstructions), each of which typically consists of a number of bit fields and the address of the next microinstruction to execute. Microcode is the translation layer between machine instructions and the elementary operations of a computer. Microcode is stored in ROM and allows the addition of new machine instructions without requiring that they be designed into electronic circuits when new instructions are needed. Several microinstructions will usually be required to fetch, decode and execute each machine code instruction. The elements composing the microprogram/microcode exist on a lower conceptual level than the more familiar assembler instructions. Each element is differentiated by the \"micro\" prefix to avoid confusion: microprogram, microcode, microinstruction, microassembler, etc.",
	"Microinstruction: Micro code Instruction - Microcode Instructions (microinstructions) are very basic low-level instructions in a computer CPU, which are used to manipulate bit streams and byte ordering. Microinstructions can control data flow and instruction-execution sequencing in a processor at a more fundamental level than machine instructions. Typically, a series of microinstructions is necessary to perform an individual machine instruction.",
	"Microkernel - A microkernel is a minimal computer operating system kernel providing only basic operating system services (system calls), while other services are provided by user-space programs called servers. Commonly, microkernels provide services such as address space management, thread management, and inter-process communication, but not networking or display for example.",
	"Micro-programming - Micro-programming, also known as micro-coding, refers to the development of micro-programs or micro-codes, which are the instruction set of a CPU as a sequence of micro-code instructions (micro-instructions). Micro-programming allows CPU design engineers to write a micro-program to implement a machine instruction set. Even in the late stage of design process, micro-code could easily be changed. This greatly facilitated CPU design and led to more complex instruction sets. Architectures using micro-programming included the IBM System/360 and DEC VAX, the instruction sets of which were implemented by complex microprograms. The approach of using increasingly complex micro-code-implemented instruction sets was later called CISC.",
	"Microsoft .Net - Microsoft .Net is an umbrella term that applies to a collection of products and technologies from Microsoft. All have in common a dependence on the Microsoft .NET Framework, a component of the Windows operating system.",
	"Microsoft .Net Framework - The Microsoft .NET Framework is a software component which can be added to the Microsoft Windows operating system. It provides a large body of pre-coded solutions to common program requirements, and manages the execution of programs written specifically for the framework. The .NET Framework is a key Microsoft offering, and is intended to be used by most new applications created for the Windows platform.",
	"Microsoft Access - Microsoft Access is a relational database management system from Microsoft, packaged with Microsoft Office Professional which combines the Jet relational database engine with a graphical interface. The development environment provides productivity-enhancing features for both advanced developers and beginning users. It can use data stored in Access/Jet, SQL Server, Oracle, or any ODBC-compliant data container.",
	"Microsoft SQL Server - Microsoft SQL Server is a relational database management system produced by Microsoft. It supports a super-set of Structured Query Language SQL, the most common database language. It is commonly used by businesses for small to medium sized databases, and in the past 5 years large enterprise databases, and competes with other relational database products for this market segment.",
	"Microsoft Systems Management Server - Microsoft Systems Management Server (SMS) is a Microsoft systems management software product for managing large groups of Windows-based computer systems. It provides remote control, patch management, software distribution, and hardware/software inventory.",
	"Microsoft Visual Studio Debugger - The Microsoft Visual Studio Debugger is a debugger tool that ships along with all versions of Visual Studio .NET. This debugger owes much of its feel and functionality to CodeView, a standalone, text-based debugger that shipped with Microsoft Visual C++ version 5.0 and earlier.",
	"Microsoft Windows - Microsoft Windows is a family of operating systems for personal computers, developed and distributed by Microsoft. Windows provides a graphical user interface (GUI), virtual memory management, multitasking, and support for many peripheral devices. Windows can run on several type of platforms such as servers, embedded devices and, most typically, on personal computers.",
	"MicroStation - MicroStation is the platform architectural and engineering software package developed by Bentley Systems, to generate 2D/3D vector graphic objects and elements. Its native format is the DGN (DesiGN file) format, though it can also read and write a variety of standard CAD formats including AutoCAD's DWG and DXF as well as produce media output in such forms as rendered images (JPEG and BMP), animations (AVI), 3D web pages in Virtual Reality Modeling Language, and Adobe PDF.",
	"Middleware - Middleware is a type of computer software that connects software components or applications. It is used most often to support complex, distributed applications. It includes web servers, application servers, content management systems, and similar tools that support application development and delivery. Middleware is especially integral to modern information based on XML, SOAP, Web services, and service-oriented architecture.",
	"MinGW Developer Studio - MinGW Developer Studio is a freeware IDE (integrated development environment) for programming with C and its derivative, C++. MinGW Developer Studio is bundled with the open source GCC compiler, MinGW and the wxWidgets GUI library, offering a complete solution for both console and GUI programming with C/C++. The interfaces and functionalities are almost identical to Visual C++ 6.0, with added features such as code folding.",
	"MinGW: Minimalist GNU for Windows - Minimalist GNU for Windows (MinGW or Mingw32) is a software port of the GNU toolchain to the Win32 platform. It was originally a fork of Cygwin. Unlike Cygwin it does not require a compatibility layer DLL nor does its license require that applications developed with it are released under the GPL.",
	"Minix - MINIX is an open source, Unix-like operating system based on a microkernel architecture. Andrew S. Tanenbaum wrote the operating system to be used for educational purposes. Early Linux kernel development was done on a MINIX host system, which led to Linux inheriting various features from MINIX, such as the MINIX disk filesystem format.",
	"MIS: Management Information systems - Management Information systems(MIS), also known as information technology management, generally refers to the application of information technology to business problems. In academic field, the study of information systems is usually a commerce and business administration discipline, and frequently involves software engineering, but also distinguishes itself by concentrating on the integration of computer systems with the aims of the organization. The area of study should not be confused with computer science which is more theoretical in nature and deals mainly with software creation, and not with computer engineering, which focuses more on the design of computer hardware. Very often, companies have a MIS department to take care of daily management and administration of the company's information infrastructure.",
	"MISRA C - MISRA C is a set of coding guidelines for the programming language C and later for C++ with extensions. The C guidelines are intended to be applied during the development of software used in safety-critical applications. Although written for use by the automotive industry, the problems addressed by the guidelines also occur in software produced for other industries and some development groups in these industries (e.g., medical device manufacturers) have adopted the MISRA C guidelines.",
	"MISRA: Motor Industry Software Reliability Association - Motor Industry Software Reliability Association (MISRA), is a collaboration between vehicle manufacturers, component suppliers and engineering consultants which seek to promote best practice in developing safety-related electronic systems in road vehicles. MISRA has developed a set of coding guidelines, called MISRA C, for the programming language C and then for C++.",
	"MIT License: Massachusetts Institute of Technology License - Massachusetts Institute of Technology (MIT) License, originated at the MIT, is a type of licence for the use of certain types of computer software. It allows reuse for open source and proprietary software. Many groups use the MIT license for their own software, such as expat, MetaKit, and the X Window System.",
	"Module - In computer software programming, a module is a software entity that groups a set of (typically cohesive) subprograms/routines and data structures. Modules are units that can be compiled separately, which makes them reusable and allows multiple programmers to work on different modules simultaneously. Modules also promote modularity and encapsulation (i.e. information hiding), both of which can make complex programs easier to understand. Programs are composed of one or more independently developed modules that are not combined until the program is linked.",
	"Monad - Monad, Latin for unit, is a technique from category theory which has been adopted as a way of dealing with state in functional programming languages, which make use of monads to structure programs which include operations that must be executed in a specific order. The primary uses of monads in functional programming are to express input/output operations and changes in state without using language features that introduce side effects. A monad has three components: a means of augmenting an existing type, a means of creating a default value of this new type from a value of the original type, and a replacement for the basic application operator for the old type that works with the new type.",
	"Monotone - Monotone is an open source software tool for revision control. Monotone tracks revisions to files, groups sets of revisions into changesets, and tracks history across renames. The design principle is distributed operation making heavy use of cryptographic primitives to track file revisions (via the SHA1 secure hash) and to authenticate user actions (via RSA cryptographic signatures). Each participant maintains their own revision history store in a local SQLite database. Monotone is especially strong in its support of a diverge/merge workflow, which it achieves in part by always allowing \"commit\" before merge.",
	"Moodle - Moodle is an open source e-learning platform with a course management system (CMS). Such e-learning systems are sometimes also called Learning Management Systems (LMS), Virtual Learning Environments (VLE), education via computer-mediated communication (CMC) or Online Education.",
	"MOS: Microsoft Office Specialist - Microsoft Office Specialist (MOS), previously named Microsoft Office User Specialist (MOUS) is a certification for using the Microsoft Office suite of business applications. While listed under the MCP Certification Programs, it is not officially an MCP Certification. The MOS exams are managed by a third party company, Certiport.",
	"Mosaic - Mosaic is a World Wide Web browser and Gopher client developed at the National Center for Supercomputing Applications (NCSA) beginning in 1992, and officially ending on January 7, 1997. NCSA Mosaic was originally designed and programmed for Unix's X Window System. Marc Andreessen, the leader of the team that developed Mosaic, left NCSA and, with four other former students and staff of the University of Illinois, started Mosaic Communications Corporation. Mosaic Communications eventually became Netscape Communications Corporation, producing Netscape Navigator. Spyglass licensed the technology and trademarks from NCSA for producing their own web browser but never used any of the NCSA Mosaic source code. Spyglass Mosaic was later licensed by Microsoft, and it was modified and renamed to Internet Explorer.",
	"Moto Programming Language - Moto Programming Language(Moto) is an Open Source server-side language much like PHP or JSP, developed by David Hakim. The primary difference between Moto and server-side scripting languages is that Moto pages can run interpreted (like PHP) or be natively compiled into dynamically loadable Apache modules. Moto has a type checking phase so programmers see more errors up front. Programmers can define classes and functions in Moto and make use of powerful exception handling. Moto comes with a full suite of objects and functions for state and session management, MySQL and PostgreSQL database connectivity, and a slew of utility classes. There is also an included interface definition language for exposing C functions to Moto. All object allocation occurs in a shared memory segment, so maintaining objects in memory between page views is a snap.",
	"MOV: Merchant of Venice - Merchant of Venice (MOV), in computer programming, is a stock market trading and technic analysis program to manage graphs and portfolios. It has an internal language which supports all the most important econometric functions (RSI, Bollinger Bands, Momentum, Moving Averages, ecc.). It supports artificial intelligence techniques (Genetic Programming, Genetic Algorithm, ...).",
	"Mozbot - Mozbot is an IRC bot written in the Perl programming language under the MPL license, originally authored by Ian Hickson. Mozbot has a modular design, allowing for extension modules to be incorporated at runtime.",
	"Mozilla - Historically, Mozilla had been used internally as a codename for the Netscape Navigator web browser from its beginning. It was a contraction of Mosaic killer. Mozilla is sometimes used to refer to the Mozilla Organization, a free software / open source software project that was founded in order to create the next-generation Internet suite for Netscape. On August 3, 2005, Mozilla Foundation announced the creation of Mozilla Corporation, a wholly-owned for-profit taxable subsidiary of Mozilla Foundation, that will focus on delivering Firefox and Thunderbird to end users.",
	"Mozilla Application Object Model (AOM) - The Mozilla Application Object Model (AOM) is an application programming interface for manipulating the application using JavaScript. It is similar to Document Object Model, but instead of being document-centric, it is application-centric. For example, opening web services, saving files, etc.",
	"Mozilla Firefox - Mozilla Firefox, or simply known as Firefox, is a free, open source, cross-platform, graphical web browser developed by the Mozilla Corporation and hundreds of volunteers. Firefox includes an integrated pop-up blocker, tabbed browsing, live bookmarks, support for open standards, and an extension mechanism for adding functionality. Although other browsers have some of these features, Firefox became the first such browser to include them all and achieve wide adoption.",
	"Mozilla Public License - The Mozilla Public License is an open source and free software license. Version 1.0 was developed by Mitchell Baker when she worked as a lawyer at Netscape Communications Corporation and version 1.1 at the Mozilla Foundation.",
	"Mp3splt - Mp3splt is a free(GNU GPL) digital audio splitter that runs on GNU/Linux, Mac OS X, and Microsoft Windows operating systems. The graphical user interface for the splitter is called mp3splt-gtk and is made with gtk2. The mp3splt project has also a library created from mp3splt, called libmp3splt and a graphical user interface called mp3splt-gtk that uses that library.",
	"Mp3splt-gtk - Mp3splt-gtk is the GUI of Mp3splt, a free(GNU GPL) digital audio splitter that runs on GNU/Linux, and Microsoft Windows operating systems. The graphical user interface uses libmp3splt (based on mp3splt) and is made with GTK+ 2.",
	"MPS: Memory Pool System - The Memory Pool System (MPS) is a flexible and modular memory management system that was developed by Harlequin Inc. and now an open source software to support both their ScriptWorks PostScript RIP, and their Harlequin Dylan compiler and IDE for the Dylan programming language. As such it was designed to support a wide range of requirements from high-speed manual memory management, to complex garbage collection with many different types of reference.",
	"MS-DOS: MicroSoft Disk Operating System - MicroSoft Disk Operating System (MS-DOS) is an operating system by Microsoft. It was the most widely used DOS for the PC compatible platform during the 1980s. It has gradually been replaced by the Windows operating system. MS-DOS is a single user operating system that runs one program at a time and is limited to working with one megabyte of memory, 640 kilobytes of which is usable for the application program. Special add-on EMS memory boards allow EMS-compliant software to exceed the 1Mbyte limit. Add-ons to DOS, such as Microsoft Windows and DESQview, take advantage of EMS and allow the user to have multiple applications loaded at once and switch between them.",
	"mSQL: Mini SQL - Mini SQL (mSQL) is a lightweight client/server database developed by Hughes Technologies in 1994. mSQL filled a gap that existed between the embedded desktop databases like Microsoft Access and the enterprise-level commercial databases such as Oracle and DB2. It was popular database of choice for open source developers in the middle of 90'. By 1996, development on mSQL began to stagnate and MySQL arose to fill that void. By 1999, MySQL had gone well beyond mSQL in popularity and today mSQL has less visibility.",
	"mSQL-JDBC - mSQL-JDBC is an Open Source Type IV Java Database Connectivity (JDBC) driver for the mSQL database engine created by George Reese. It is written in the Java programming language and uses the native mSQL network protocols to talk to mSQL. The driver supports as much of the JDBC specification as the mSQL database will support, but development on the driver basically ceased in 1997. The driver therefore does not support the most recent releases (3.0 and above) of mSQL.",
	"MSYS: Minimal SYStem - Minimal SYStem(MSYS), a part of MinGW, was created out of a long-lived desire to provide the MinGW community a Minimal SYStem, with which a configure script could be executed. MSYS provides POSIX/Bourne configure scripts the ability to execute and create a Makefile used by make. MSYS versions 1.0.8 and later include only the i386 binary distribution, which will run on any 32-bit Intel-compatible processor.",
	"MUI: Magic User Interface - The Magic User Interface(MUI) is an object oriented system by Stefan Stuntz to generate and maintain graphical user interfaces. The MUI was written for AmigaOS and gained popularity amongst both programmers and users. It has been ported to PowerPC processors and adopted as the default GUI toolkit of the MorphOS operating system. The MUI application programmer interface has been cloned by the Zune toolkit used in the Amiga Research Operating System.",
	"Multiple Perspective Software Development - Multiple perspective software development refers to an approach to software development which requires communication and collaboration between experts in a number of different fields.",
	"Multiprocessing - Multiprocessing typically refers to the use of more than one processor (CPU) in a single computer system. So-called multiprocessor systems usually have a common memory space through which all of the processors can communicate and share data. Multiprocessing sometimes refers to the execution of multiple concurrent software processes in a system as opposed to a single process at any one instant.",
	"Multitasking - In computing, multitasking is technique used in an operating system for sharing a single processor between several independent jobs. In the case of a computer with a single CPU, only one task is said to be running at any point in time, meaning that the CPU is actively executing instructions for that task. Multitasking solves the problem by scheduling which task may be the one running at any given time, and when another waiting task gets a turn. The act of reassigning a CPU from one task to another one is called a context switch. When context switches occur frequently enough the illusion of parallelism is achieved. Even on computers with more than one CPU, multitasking allows many more tasks to be run than there are CPUs.",
	"Multithreading - Multithreading typically refers to sharing a single CPU between multiple tasks (or \"threads\") in a way designed to minimise the time required to switch threads. This is accomplished by sharing as much as possible of the program execution environment between the different threads so that very little state needs to be saved and restored when changing thread. Multiple threads can be executed in parallel on many computer systems. This multithreading generally occurs by time slicing, wherein a single processor switches between different threads--in which case the processing is not literally \"simultaneous\", for the single processor is only really doing one thing at a time. On a multiprocessor system, threading can be achieved via multiprocessing, wherein different threads can run simultaneously on different processors.",
	"MusE - MusE is a MIDI/Audio sequencer program with recording and editing capabilities written by Werner Schweer. MusE aims to be a complete multitrack virtual studio for Linux (it currently has no support under other platforms, due to its reliance on JACK and ALSA). It is published under the GNU General Public License.",
	"MySQL - MySQL is a multithreaded, multi-user, SQL (Structured Query Language) Database Management System (DBMS). MySQL is open source software available either under the GNU General Public License (GPL) or under other licenses when the GPL is inapplicable to the intended use.",
	"Mystic BBS - Mystic BBS is a free (as in beer) bulletin board system software program written by the programmer James Coyle, better known by the pseudonym \"g00r00\". Started in 1994, Mystic is the first DOS-based BBS softare programs to support a native telnet server. It has since been ported to Microsoft Windows, OS/2 and Linux.",
	"Nagware - Nagware, also known as annoyware, is a type of shareware software. Other types of shareware include demoware, crippleware, freeware, adware, and even spyware. Nagware reminds or nags the user to register it by paying a fee. It usually does this by popping up a message when the user starts the program or, worse, intermittently while the user is using the application. These messages can appear as windows obscuring part of the screen or message boxes that can quickly be closed.",
	"Name Binding - In programming languages, name binding refers to the association of values with identifiers. An identifier bound to a value is said to reference that value. Since computers themselves have no notion of identifiers, there is no binding at the machine language level name binding is an abstraction provided by programming languages. Binding is intimately connected with scoping, as scope determines when binding occurs.",
	"Nanika - Nanika is a desktop accessory application developed by Sagawa Toyoaki. Nanika is composed of three parts: 'materia', which is the basic foundation of Nanika system; 'shell', which can be described as a skin; 'ghost', which is a pseudo-AI engine. Nanika is heavily influenced by Japanese anime, such as Kanon and Ghost in the Shell.",
	"NanoCAD - NanoCAD is a Java applet that was intended to eventually evolve into a useful computer-aided design system for nanotechnology. While that goal has yet to come to fruition, NanoCAD has at least influenced the direction of more advanced projects such as OpenChem and Fungimol.",
	"NASM: Netwide Assembler - Netwide Assembler(NASM) is a free software Intel x86 assembler. It can be used to write both 16-bit and 32-bit (IA-32) programs. 32-bit programs can be written for NASM in such a way that they are portable between any 32-bit x86 OSes, if the right libraries are used.",
	"Natural Docs - Natural Docs is a multi-language documentation generator written in Perl and licensed under the GPL. It attempts to keep the comments written in source code just as readable as the generated documentation. It is written and maintained by Greg Valure.",
	"Natural Language - Natural language refers to a language spoken or written by humans, as opposed to a language used to program or communicate with computers. Natural language understanding is one of the hardest problems of artificial intelligence due to the complexity, irregularity and diversity of human language and the philosophical problems of meaning.",
	"NetBSD - NetBSD is a freely redistributable, open source version of the Unix-like BSD computer operating system. It was the second open source BSD variant to be formally released, after 386BSD, and continues to be actively developed. Noted for its portability and quality of design and implementation, it is often used in embedded systems and as a starting point for the porting of other operating systems to new architectures.",
	"News Aggregator - A news aggregator refers to a system including software application, webpage or service that collects syndicated content using RSS and other XML feeds from weblogs and mainstream media sites. Aggregators improve upon the time and effort needed to regularly check websites of interest for updates, creating a unique information space or \"personal newspaper.\" An aggregator is able to subscribe to a feed, check for new content at user-determined intervals, and retrieve the content. The content is sometimes described as being \"pulled\" to the subscriber, as opposed to \"pushed\" with email or other channels. Unlike recipients of some \"pushed\" information, the aggregator user can easily unsubscribe from a feed.",
	"NF: Normal Form - Normal Forms (NFs) are the structures and algorithms to normalize a relational database. One can only describe a database as having a normal form if the relationships between quantities have been rigorously defined. It is possible to use set theory to express this knowledge once a problem domain has been fully understood, but most database designers model the relationships in terms of an \"idealized schema\".",
	"NLP: Natural Language Processing - Natural language processing(NLP) refers to the computer understanding, analysis, manipulation, and/or generation of natural language. NLP is a subfield of artificial intelligence and linguistics. It studies the problems of automated generation and understanding of natural human languages. Natural language generation systems convert information from computer databases into normal-sounding human language, and natural language understanding systems convert samples of human language into more formal representations that are easier for computer programs to manipulate.",
	"No-CD Crack - A No-CD crack is a special computer program used to play computer games without having to insert the CD-ROM.This act is a form of software cracking. No-CD cracks can be found on the Internet from many websites or other various filesharing networks.",
	"Nodezilla - Nodezilla is a peer-to-peer network software written in C++ and Java, released under the GNU General Public License. Technically, Nodezilla is a secured, distributed and fault-tolerant routing system (aka Grid network). Its main purpose is to serve as a link for distributed services built on top of it (like chat, efficient video multicasting streaming, File Sharing, secured file store.",
	"Non-code resource - Non-code resource is a resource containing the data structures on which the program operates, for example, 'WIND', 'DLOG', 'DITL', or 'SIZE' resources. The resource compiler Rez or a resource editor may be used to create non-code resources.",
	"Non-compressed sound data - Non-compressed sound data is the sampled-sound data that has not been subjected to audio compression or that has been decompressed.",
	"Nonlinear Programming - In mathematics, nonlinear programming (NLP) is the process of solving a system of equalities and inequalities over a set of unknown real variables, along with an objective function to be maximized or minimized.",
	"Non-Printable Character - Non-Printable Character is a character that doesn't have a corresponding character letter to its corresponding ASCII code. Examples would be the Linefeed, which is ASCII character code 10 decimal, the Carriage Return, which is 13 decimal, or the bell sound, which is decimal 7. On a PC, you can often add non-printable characters by holding down the Alt key, and typing in the decimal value. There are other character encoding schemes, but ASCII is the most prevalent.",
	"Non-Proprietary Software - Non-proprietary software, the opposite of proprietary software, refers to the software that has no proprietary restrictions attached to it, particularly the restriction about the access to the source code. Proprietary software is software where the source code has not been made available, or it is protected by restrictive licensing clauses. Non-proprietary software is not a widely used term and has no generally accepted definition. It is sometimes used as an umbrella term for the many alternative terms for free software. ",
	"Nonrelocatable Block - Nonrelocatable block is a block whose location in the heap is fixed. This block can't be moved during heap compaction or other memory operations.",
	"NonStop SQL - NonStop SQL is a relational database product originally produced at Tandem Computers using the pioneering Ingres source code from University of California, Berkeley. NonStop is the \"brand name\" for Tandem's suite of high-availabiliy products, a brand that survived Tandem's takeover by Compaq, and today after Compaq's takeover by HP.",
	"Nonvolatile Register - Nonvolatile register is a register whose contents must be preserved across subroutine calls. If a routine changes the value of a nonvolatile register, it must save the old value on the stack before changing the register and restore that value before returning.",
	"Normalization in Database - IIn relational databases, normalization is a process that eliminates redundancy, organizes data efficiently, reduces the potential for anomalies during data operations and improves data consistency. The formal classifications used for quantifying \"how normalized\" a relational database is are called normal forms.",
	"Novell ZENworks - Novell ZENworks, a suite of software products developed and maintained by Novell, Inc. for computer systems management, aims to manage the entire lifecycle of servers, of desktop PCs (both Windows-based and Linux-based), of laptops, and of handheld devices (such as PDAs).",
	"NPL: Netscape Public License - The Netscape Public License (NPL) is an open-source license, one of the licenses under which Mozilla is distributed. Its most notable feature is that it gives the original developer of Mozilla (Netscape, now a subsidiary of Time Warner), the right to distribute modifications made by other contributors under whatever terms it desires, including commercial terms, without granting similar rights to those other contributors in respect of the contribution of the original developer.",
	"NuCalc - NuCalc, also known as Graphing Calculator, is the name of a computer software tool, made by the company Pacific Tech, capable of performing many graphing calculator functions. It can graph inequalities and vector fields, as well as functions in two, three, or four dimensions. It supports several different coordinate systems, and can solve equations. It is available for Mac OS (under the name Graphing Calculator) and Microsoft Windows.",
	"Numerical Analysis - Numerical analysis is the study of algorithms for the problems of continuous mathematics (as distinguished from discrete mathematics). Some of the problems it deals with arise directly from the study of calculus; other areas of interest are real variable or complex variable questions, numerical linear algebra over the real or complex fields, the solution of differential equations, and other related problems arising in the physical sciences and engineering."
]
