[
	"VisualKore - VisualKore is a modified version of the Ragnarok Online bot program known as Kore, originally made by Kura. The program is a derivative of OpenKore and henceforth has the same benefits of different and numerous contributors from all parts of the globe. VisualKore has intuitive graphical user interface as the main differential from OpenKore and other bots. VisualKore isn't tolerated by official RO servers, but the software is fully legalized. Unlike most bots, VisualKore is a commercial program.",
	"VMS: Virtual Memory System - Virtual Memory System(VMS) is the proprietary operating system originally produced by Digital Equipment Corp (DEC, now part of HP) for its VAX minicomputer. VMS V1 was released in August 1978. VMS was renamed \"OpenVMS\" around version 5.5. OpenVMS is a multi-user, multiprocessing virtual memory-based operating system (OS) designed for use in time sharing, batch processing, real time (process priorities can be set higher than OS kernel jobs) and transaction processing. It offers high system availability through clustering, or the ability to distribute the system over multiple physical machines. This allows the system to be \"disaster-tolerant\" against natural disasters that may disable individual data-processing facilities.",
	"VRML: Virtual Reality Modeling Language - Virtual Reality Modeling Language (VRML) is a standard file format for representing 3-dimensional (3D) interactive vector graphics, designed particularly with the World Wide Web in mind. VRML, which functions as a counterpart to HTML, is a platform-independent language that creates a virtual reality scene which users can 'walk' through and follow links much like a conventional Web page. In some contexts, VRML can replace conventional computer interfaces with their icons, menus, files, and folders. It is possible to use VRML to create, for example, a virtual museum with all the elements of a real museum, including corridors, display cases and multimedia demonstrations.",
	"W2K: Windows 2000 - Windows 2000 (Win2K or W2K), part of the Microsoft Windows operating systems released in the year of 2000, is a preemptible and interruptible, graphical, business-oriented operating system that was designed to work with either uniprocessor or symmetric multi-processor (SMP) 32-bit Intel x86 computers. Windows 2000 comes in four versions: Professional, Server, Advanced Server, and Datacenter Server. Additionally, Microsoft offers Windows 2000 Advanced Server- Limited Edition, which runs on 64-bit Intel Itanium microprocessors. Windows 2000 is classified as a hybrid kernel operating system, and its architecture is divided into two modes: user mode and kernel mode. The kernel mode provides unrestricted access to system resources and facilitates the user mode, which is heavily restricted and designed for most applications.",
	"WAMP: Microsoft Windows, Apache, MySQL and Perl/PHP/Python - WAMP, an acronym for the combination Microsoft Windows, Apache, MySQL and one or more of Perl, PHP and Python, defines the Windows based Web platform. It is modelled after the more well-known LAMP, referring to the all-open source/free software approach which uses Linux instead of Windows.",
	"Warez - Warez refers primarily to copyrighted material traded in violation of its copyright license. The term generally refers to releases by organized groups, as opposed to peer-to-peer file sharing between friends or large groups of people with similar interest using a Darknet. It usually does not refer to commercial for-profit software counterfeiting. This term was initially coined by members of the various computer underground circles, but has since become commonplace among Internet users and the media.",
	"Watchdog Event Log - Watchdog Event Log is a file created by Windows operating systems using the .WDL extension.",
	"Waterfall Model - The waterfall model is a software development process in which development is seen as flowing like waterfall steadily downwards through the phases of requirements analysis, design, implementation, testing (validation), integration, and maintenance. The Waterfall Model is considered old-fashioned or simplistic by proponents of object-oriented design which often uses the spiral model instead.",
	"Web Authoring - Web authoring refers to the process of websites and web pages creation, or authroing. There is a lot of web authoring software available that enables the user to develop a Web site in a desktop publishing format. The software will generate the required HTML coding for the layout of the Web pages based on what the user designs. Typically, the user can toggle back and forth between the graphical design and the HTML code and make changes to the Web page in either the design of the accompanying code. Microsoft FrontPage is an example of the web authroing software.",
	"Web Content Management System - Web Content Management System is a type of Content management system software used for managing websites. Usually the software provides tools where users with little or no knowledge of programming languages and markup languages (such as HTML) can create and manage contents with relative ease of use. Most systems use a database to hold contents, and a presentation layer displays the content to regular website visitors based on a set of templates. Management of the software is typically done through a web browser, but some systems may be modified in other ways. The Wiki system is a web content management system.",
	"Web Page - A web page is an HTML/XHTML document that is included in a website. A web page is almost always accessible over the network or Internet via HTTP.",
	"Web Portal - Web portals are sites on the World Wide Web that typically provide personalized capabilities to their visitors. They are designed to use distributed applications, different numbers and types of middleware and hardware to provide services from a number of different sources. In addition, business portals are designed to share collaboration in workplaces. A further business-driven requirement of portals is that the content be able to work on multiple platforms such as personal computers, personal digital assistants (PDAs), and cell phones.",
	"Web3D Consortium - The Web3D Consortium, formally the VRML Consortium, is a member-funded industry consortium committed to the creation and deployment of open, royalty-free standards that enable the communication of real-time 3-dimensional (3D) graphics across applications, networks, and XML web services. The Consortium works closely with the ISO, MPEG and W3C standardization bodies to maximize market opportunities for its membership.",
	"Weblog Software - Weblog software, also called blog software or blogware, is a category of software which consists of a specialized form of Content Management Systems specifically designed for creating and maintaining weblogs. Most weblog applications have features such as facilitating authoring and editing of blog posts or articles, various linking and web syndication features, and the ability to easily publish the blog to the world wide web.",
	"Websphere - WebSphere is an IBM brand of products that implement and extend Sun's JavaTwoEnterpriseEdition (J2EE) platform. The Java-based application and transaction infrastructure delivers high-volume transaction processing for e-business and provides enhanced capabilities for transaction management, as well as security, performance, availability, connectivity, and scalability.",
	"Widget Toolkits - In computer programming, widget toolkits, also known as GUI toolkits, are sets of basic building elements for graphical user interfaces. They are often implemented as a library, or application framework.",
	"Wildcat! - Wildcat! was a bulletin board system (BBS) software package developed in 1986 by Mustang Software to create dial-up BBS operating under PC-DOS. It was later ported to Microsoft Windows. By the release of Version 4 it was the basis for over 50,000 bulletin boards worldwide.",
	"Windbg Debugger - Windbg is a multipurpose debugger for Microsoft Windows, created and distributed on the web by Microsoft. It can be used to debug both user mode applications and the operating system itself in kernel mode. It is a GUI application, but has little in common with the more well-known Visual Studio Debugger.",
	"Window Me - Windows Me, also known as Windows Millennium Edition, is a hybrid 16-bit/32-bit graphical operating system released on September 14, 2000 by Microsoft. A successor to Windows 95 and Windows 98, it was marketed as a \"Home Edition\" when compared to Windows 2000. It provided Internet Explorer 5.5, Windows Media Player 7, and the new Movie Maker software, whichprovided basic video editing and was designed to be easy for home users.",
	"Windowing Software - Windowing software, also known as windowing system, provides an operating system with the capability of displaying GUI windows. Windowing software allows a workstation's screen to be divided into rectangular areas which act like a separate input/output devices under the control of different application programs. This gives the user the ability to see the output of several processes at once and to choose which one will receive input by selecting its window, usually by pointing at it with a mouse. It is normally one part of a larger desktop environment. Some windowing systems, like the X Window System, have advanced capabilities such as network transparency, allowing the user to display graphical applications running on a remote machine.",
	"Windowing System - A windowing system, also known as windowing software, provides an operating system with the capability of displaying GUI windows. Windowing system allows a workstation's screen to be divided into rectangular areas which act like a separate input/output devices under the control of different application programs. This gives the user the ability to see the output of several processes at once and to choose which one will receive input by selecting its window, usually by pointing at it with a mouse. It is normally one part of a larger desktop environment. Some windowing systems, like the X Window System, have advanced capabilities such as network transparency, allowing the user to display graphical applications running on a remote machine.",
	"Windows 1.0 - Windows 1.0, released on November 20, 1985, was Microsoft's first attempt to implement a multi-tasking graphical user interface-based operating environment on the PC platform. Windows 1.0 offered limited multitasking of existing MS-DOS programs and concentrated on creating an interaction paradigm, an execution model and a stable API for native programs for the future.",
	"Windows 2.x - Windows 2.x is a family of Microsoft Windows graphical user interface-based operating environments that succeeded Windows 1.0. Windows 2.x was said to look similar to the original Mac OS and more closely matched Microsoft's pre-release publicity for Windows 1.0. Released on November 1, 1987, Windows 2.0 allowed for windows to overlap each other, in contrast to Windows 1.0, which could only display tiled windows.",
	"Windows 2003 - Windows Server 2003 is part of the Microsoft Windows operating systems released in the year of 2003 as the successor to Windows 2000 Server. Windows Server 2003 incorporated compatibility and other features from Windows 2000 and XP. Unlike Windows 2000 Server, Windows Server 2003's default installation has none of the server components enabled, to reduce the attack surface of new machines. Windows Server 2003 includes compatibility modes to allow older applications to run with greater stability. It was made more compatible with Windows NT 4.0 domain-based networking. Incorporating and upgrading a Windows NT 4.0 domain to Windows 2000 was considered difficult and time consuming, and generally was considered an all or nothing upgrade particularly when dealing with Active Directory. Windows Server 2003 brought in enhanced Active Directory compatibility, and better deployment support, to ease the transition from Windows NT 4.0 to Windows Server 2003 and Windows XP Professional.",
	"Windows 3.0 - Windows 3.0 was the third major release of Microsoft Windows, and came out on May 22, 1990. It became the first widely successful version of Windows and a powerful rival to Apple Macintosh and the Commodore Amiga on the GUI front. Windows 3.0 succeeded Windows 2.1x and included a significantly revamped user interface as well as technical improvements to make better use of the memory management capabilities of Intel's 80286 and 80386 processors.",
	"Windows 3.1x - The Windows 3.1x family of Microsoft Windows operating systems were released from 1992 to 1994, succeeding Windows 3.0. This family of Windows could run in either Standard or 386 Enhanced memory modes. The exception was Windows for Workgroups 3.11, which could only run in 386 Enhanced mode.",
	"Windows 95 - Windows 95 is a consumer-oriented GUI-based operating system released in 1995 by Microsoft, and was a significant progression from the company's previous versions of Windows. Windows 95 was intended to combine the functions of Microsoft's formerly separate MS-DOS and Windows products. It featured significant improvements over the popular Windows 3.1, most visibly the graphical user interface (GUI) whose basic format and structure is still used today in Windows XP. There were also large changes to the underlying workings, including support for 255-character mixed-case long filenames and preemptively multitasked protected-mode 32-bit applications.",
	"Windows 98 - Windows 98 is a graphical operating system released in 1998 by Microsoft. The new operating system was essentially an updated version of Windows 95, and like that earlier version, it was a hybrid 16-bit/32-bit monolithic product. Among its features were better AGP support, functional USB drivers, and support for multiple monitors and WebTV. Also added was support for the FAT32 file system which allowed Windows 98 support disk partitions larger than the two gigabyte maximum accepted by Windows 95. As in later releases of Windows 95, Internet Explorer continued to be integrated into the Windows Explorer interface. It was also the first version of Windows to support ACPI.",
	"Windows API - The Windows API refers to the core set of application programming interfaces available in the Microsoft Windows operating systems. It is designed for usage by C/C++ programs and is the most direct way to interact with a Windows system for software applications. Lower level access to a Windows system, mostly required for device drivers, is provided by the Native API in current versions of Windows.",
	"Windows Forms - Windows Forms refers to the GUI portion of the Microsoft .NET development framework, providing access to the native Windows widgets by wrapping the existing Win32 API in managed code.",
	"Windows NT - Windows NT, where NT means New Technology, is a family of Microsoft's 32-bit operating system first released in July 1993 and Windows NT 3.1. NT was designed for high end workstations and servers. It was originally designed to be a powerful high-level language-based processor-independent multiprocessing multiuser operating system with features comparable to Unix to complement workstation versions of Windows that were based on MS-DOS until 2001. It was the first 32-bit version of Windows. Windows XP and Windows Server 2003 are the latest versions of Windows NT.",
	"Windows Server System - Windows Server System is an integrated set of server software from Microsoft. It forms the infrastructure for operating the back end of an information technology system. Microsoft divides its server offerings into four major categories: \"Security\", \"IT Operations\", \"Applications\", and \"Collaboration\". Many of the products integrate deeply with Visual Studio to help software developers and designers build solutions using familiar tools.",
	"Windows XP - Windows XP is a line of operating systems developed by Microsoft for use on general-purpose computer systems, including home and business desktops, notebook computers, and media centers. Windows XP is the successor to both Windows 2000 and Windows Me, and is the first consumer-oriented operating system produced by Microsoft to be built on the Windows NT kernel and architecture. With the release of Windows XP, the Windows 95/98 architecture was finally discontinued. Windows XP was first released on October 25, 2001.",
	"Wine Software - WINE Software, a free software released under the GNU Lesser General Public License (LGPL), allows a PC running a Unix-like operating system and the X Window System to execute programs originally written for Microsoft Windows. Alternately, those wishing to port a Windows application to a Unix-like system can compile it against the Wine libraries. The name 'Wine'derives from the recursive acronym \"Wine Is Not an Emulator\", or \"WINdows Emulator\". While the name sometimes appears in the forms \"WINE\" and \"wine\", the project developers have agreed to standardize on the form \"Wine\".",
	"WinG - WinG is an API to provide fast graphics performance on Windows 3.1. It was later built-in to Windows 95. In Win32, the equivalent of WinG functionality is provided via API calls such as CreateDIBSection(), SetDIBColorTable(), BitBlt(), and StretchBlt().",
	"Wings 3D - Wings 3D is a free and open source polygon mesh modeler. Wings 3D is available for most platforms, including Windows, Linux and Mac OS X, using the Erlang environment.Wings 3D is best suited for modelling and texturing low-polygon meshes, towards which its interface is geared. When compared to other open-source modelling programs such as Blender, its GUI is minimalistic.",
	"Winny Program - Winny, also known as WinNY, is a Japanese peer-to-peer (P2P) file-sharing program similar to Freenet that claims to keep user identities untraceable. While Freenet was implemented in Java, Winny was implemented as a Windows C++ application. The software takes its name from WinMX, which is a peer-to-peer file sharing program authored by Frontcode Technologies and running on Windows operating systems.",
	"WinRAR - WinRAR is a shareware file archiver and data compression utility by Eugene Roshal. It is one of the few applications that are able to create RAR archives natively, as the encoding method is held to be proprietary.",
	"WinZip - WinZip is a program to uncompress files after downloading them on a PC running Microsoft Windows. Many files are stored on servers in a compressed format, making them take up less disk space, and reducing the time it takes for you to download them. WinZip decompresses these files, and makes them usable by the computer.",
	"Word Processing - Word processing refers to the process of using a computer to create, edit, format and print documents. To perform word processing, a special program called a word processor is required, which enables you to create a document, store it electronically on a disk, display it on a screen, modify it by entering commands and characters from the keyboard, and print it on a printer.",
	"Word Processor - Word processor is computer program that enables you to perform word processing functions such as creating, editing, formating and printing documents.",
	"Wrapper Software - Wrapper software refers to a type of software that accompanies resources or other software for the purposes of improving convenience, compatibility, or security. For example, a wrapper is used to compress and encrypt software that is being sold over the Internet.",
	"WWIV BBS - The WWIV Bulletin Board System (BBS) was one of the most popular dialup computer hosting systems in the online world during the late 1980s and early 1990s. One of its most unusual features was a proprietary networking system, allowing tens of thousands of systems running the software to link themselves together into various networks, much like FidoNet.This software started out as a single BBS in St. Louis, MO, run by Wayne Bell, who wrote it in BASIC.",
	"WxWidgets - wxWidgets, formerly known as wxWindows, is an open source, cross-platform widget toolkit; that is, a library of basic elements for building a graphical user interface (GUI).",
	"X Window System - X Window System is a distributed, network-transparent, device-independent, multitasking windowing and graphics system originally developed by MIT for communications between X terminals and UNIX workstations. It provides the standard toolkit and protocol to build graphical user interfaces (GUI) on Unix, Unix-like operating systems, and OpenVMS €“ almost all modern operating systems support it. X provides the basic framework for a GUI environment: drawing and moving windows on the screen and interacting with a mouse and/or keyboard.",
	"X.Org Fundation - The X.Org Foundation is an not-for-profit organization for the development of the X Window System. It was founded on 22 January 2004. The creation of the Foundation marked a radical change in the governance of X. Whereas the stewards of X since 1988 (including the previous X.Org) had been vendor organizations, X.Org is led by software developers and using community development on the bazaar model, which relies on outside involvement. Membership is also open to individuals, with corporate membership being in the form of sponsorship.",
	"X.Org Server - X.Org Server, the X.Org Foundation Open Source Public Implementation of X11, is the official reference implementation of the X Window System, commonly used on Linux and UNIX. It is both open source and free software. The project is run by the X.Org Foundation and is hosted by freedesktop.org. X11R6.7.0, the first version of the X.Org Server, was forked from XFree86 4.4 RC2.",
	"X/Open - X/Open Company, Ltd. was a consortium founded by several European UNIX systems manufacturers in 1984 to identify and promote open standards in the field of information technology. X/Open managed the UNIX® trademark from 1993 to 1996, when it merged with the Open Software Foundation to form The Open Group.",
	"XAD - The XAD system is a open source client based archiving and unarchiving system. There is a master library called xadmaster.library which provides an interface between the client and the user application and there are clients handling the special archive formats. Three different types to handle file and disk archives and also disk image files (filesystem) are possible. They can be made by everyone. The master library itself includes some of these clients internally to make the work somewhat easier for the package maintainer and the user installing it.",
	"XCMD: eXternal CoMmanD - eXternal CoMmanD(XCMD) is plugin protocol of HyperTalk which allows a user to develope HyperTalk command written in a language such as C or Pascal. XCMD is native code containers attached to stacks (as Macintosh-specific resources) with a single entry point and return value. XCMDs and XFCNs could be called just like regular message and function handlers from HyperTalk scripts, and were also able to send messages back to the HyperCard application. Some enterprising XCMD authors added advanced features like full color support (ColorizeHC, HyperTint, AddColor), multiple special-purpose windows (Prompt, Tabloid, Textoid, Listoid, ShowDialog, MegaWindows), drag and drop support and various hardware interfaces to the language.",
	"Xcode - Xcode is Apple Computer's integrated development environment (IDE) for developing applications and other software for Mac OS X. It is shipped free with Mac OS X. First introduced on October 24, 2003 along with the release of Mac OS X v10.3, it extended and replaced Apple's earlier IDE, Project Builder, which was inherited from NeXT.",
	"XDBX - xdbx is a graphical user interface to the dbx debugger under the X Window System. It provides visual feedback and mouse input for the user to control program execution through breakpoints, to examine and traverse the function call stack, to display values of variables and data structures, and to browse source files and functions. This program is old and is not being actively maintained.",
	"XDM: X Window Display Manager - X Window Display Manager(XDM) is the default display manager for the X Window System. It is a bare-bones X display manager. It was introduced with X11 Release 3 in October 1988, to support the standalone X terminals that were just coming onto the market. It was written by Keith Packard. Because of its lack of configurability, users of GNOME, KDE or Enlightenment tend to use other managers such as GDM, KDM or Entrance instead of XDM.",
	"Xerox Development Environment - The Xerox Development Environment was one of the first Integrated Development Environments (IDE). It was first implemented on the Xerox Alto in 1977.",
	"Xerox PARC: Xerox Palo Alto Research Center - Xerox Palo Alto Research Center (PARC) was a flagship research division of the Xerox Corporation, based in Palo Alto, California, USA. It was founded in 1970, and spun out as a separate company wholly owned by Xerox in 2002. It is best known for essentially creating the modern personal computer graphical user interface (GUI) paradigm. From the early 1970s into the mid-1980s, PARC yielded an astonishing volume of ground-breaking hardware and software innovations. The modern mice, windows, and icons (WIMP) style of software interface was invented there. So was the laser printer and the local-area network; Smalltalk; and PARC's series of D machines anticipated the powerful personal computers of the 1980s by a decade. Sadly, the prophets at PARC were without honour in their own company, so much so that it became a standard joke to describe PARC as a place that specialised in developing brilliant ideas for everyone else.",
	"XFCN: External Functions - External Functions (XFCN) is a plugin protocol of HyperTalk, which is native code containers attached to stacks (as Macintosh-specific resources) with a single entry point and return value. XFCNs could be called just like regular message and function handlers from HyperTalk scripts, and were also able to send messages back to the HyperCard application.",
	"XFree86 - XFree86 is an implementation of the X Window System. It was originally written for Unix-like operating systems on IBM PC compatibles and is now available for many other operating systems and platforms. It is free and open source software under the XFree86 License version 1.1. It is developed by the XFree86 Project, Inc. XFree86 consists of client libraries used to write X applications (\"clients\"), and an X server responsible for the display. Clients and servers communicate via the X protocol, which allows them to run on different computers.",
	"X-Men Cartoon Maker - The X-Men Cartoon Maker was a recreational software package that allows the user to create animations with a minimal level of sophistication by utilising a library of backdrops, animations and sound effects from the 1992 Marvel Comics television series, X-Men: The Animated Series.",
	"XML Schema - XML Schema, published as a W3C Recommendation in May 2001, is one of several XML schema languages. It was the first separate schema language for XML to achieve Recommendation status by the W3C. XML Schema can be used to express a schema: a set of rules to which an XML document must conform in order to be considered 'valid' according to that schema. However, unlike most other schema languages, XML Schema was also designed with the intent of validation resulting in a collection of information adhering to specific datatypes, which can be useful in the development of XML document processing software, but which has also provoked criticism.",
	"XMLBeans - XMLBeans is a Java-to-XML binding framework which is part of the Apache Software Foundation XML project. XMLBeans is a tool that allows you to access the full power of XML in a Java friendly way. Using XMLBeans, you can take advantage of the richness and features of XML and XML Schema and have these features mapped as naturally as possible to the equivalent Java language and typing constructs. XMLBeans uses XML Schema to compile Java interfaces and classes that you can then use to access and modify XML instance data.",
	"XMLTerm - XMLterm, stands for ``experimental Mozilla terminal\", is a terminal program. XMLterm adds hypertext and graphical capabilities to the Xterm interface through the use of the extensible markup language (XML). XMLterm is open source software and is implemented using the open source Mozilla component libraries. XMLTerm is both a command line \"terminal\", like an Xterm, and also a web page, like the one displayed by the browser.",
	"XMMS: X Multimedia System - The X Multimedia System (XMMS) is a free audio player very similar to Winamp, that runs on many Unix-like operating systems.",
	"XMMS2: Cross Platform Music Multiplexing System - Cross platform music multiplexing system(XMMS2) is a new generation of the XMMS audio player. It is a new design, written from scratch, separate from the XMMS codebase. While Peter Alm, one of the original authors of XMMS, was responsible for the initial design and coding of XMMS2 (late 2002 to early 2003), he has since passed on the responsibility of furthering the project to Tobias Rundstrm and Anders Gustafsson.",
	"XOTcl - XOTcl, similar to Common Lisp Object System (CLOS), is an object-oriented extension for the Tool Command Language created by G. Neumann and U. Zdun. It supports metaclasses. Class and method definitions are completely dynamic.",
	"XPCOM: Cross Platform Component Object Model - Cross Platform Component Object Model(XPCOM) is a simple, cross platform component model similar to CORBA or Microsoft COM. It has multiple language bindings and IDL descriptions so programmers can plug their custom functionality into the framework and connect it with other components.",
	"Xterm - In Unix computing, Xterm is the standard terminal emulator for the X Window System. Xterm was originally written as a stand-alone terminal emulator for the VAXStation 100 (VS100) by Mark Vandevoorde, prior to the X Window System. A user can have many different invocations of xterm running at once on the same display, each of which provides independent input/output for the process running in it (normally the process is a Unix shell).",
	"XView - XView is a widget toolkit from Sun Microsystems introduced in 1988, providing an OPEN LOOK user interface for X Window System applications. It has the same look and feel of the earlier SunView system, and provides a similar object-oriented application programming interface for the C programming language.",
	"Xxgdb - Xxgdb is an open-source X Window System front-end for GNU Debugger (GDB). It was adapted from xdbx, which uses the dbx debugger.",
	"Y Windows - The Y Windows, also known as Y Window System, is a windowing system, consisting of a window server and a client library for writing applications, written by Mark Thomas. It is intended to be a successor to the X Window System. It differs from the X Window System in having an integrated widget set and ground-up support for things like an alpha channel, which allows transparent or translucent windows.",
	"Yacc: Yet Another Compiler Compiler - Yacc, abbreviated from \"Yet Another Compiler Compiler\", is a Unix system tool program for generating C or C++ code for a parser. Yacc is a command-line tool that accepts a grammar description (in a text file) as input and generates the code for a parser for that grammar as output. Parsers are useful in many systems other than just compilers, such as for reading the contents of a configuration file stored in a system's flash memory. Yacc was developed by Stephen C. Johnson at AT&T for the Unix operating system. Later compatible programs were written, such as Berkeley Yacc, GNU bison, MKS yacc and Abraxas yacc. Each offers slight improvements and additional features over the original Yacc, but the concept has remained the same. Yacc has also been rewritten for other languages, including Ratfor, EFL, ML, Ada, Java, and Limbo.",
	"YafRay: Yet Another Free Raytracer - YafRay, abbreviated from \"Yet Another Free Raytracer\", is an open source ray tracing program that uses an XML scene description language. It has recently been integrated into, and is often used to render scenes made in, the 3D modelling software Blender.",
	"Z88DK - Z88DK is a Small-C-derived cross compiler for a long list of Z80 based computers. The name derives for that it was originally developed to target the Cambridge Z88. Z88DK is much developed from Small-C and accepts many features of ANSI C with the notable exception of multi-dimensional arrays and function pointers.",
	"ZIP File Format - The ZIP file format is a popular data compression and archival format. A ZIP file contains one or more files that have been compressed or stored. The ZIP format was originally designed by Phil Katz for PKZIP. However, many software utilities other than PKZIP itself are now available to create, modify or open ZIP files, notably WinZip, BOMArchiveHelper, PicoZip, Info-ZIP, WinRAR, IZArc and 7-Zip. ZIP files generally use the file extensions \".zip\" or \".ZIP\" and the MIME media type application/zip.",
	"ZipGenius - ZipGenius' is a freeware file archiver designed for Microsoft Windows users, developed by M.Dev Software. It uses eg. 7-Zip format, and can also handle a number of other archive formats. It is a freeware product and is presented in two editions: STANDARD and SUITE. While the suite edition includes optional modules of the ZipGenius project (oriented to experts and power-users), the standard setup package simply includes the main ZipGenius application.",
	"Zipping - Zipping refers to the process of compressing a file so it takes up less space. The compress files after zipping is called a zip file. There are two types of Zip files, normal (requiring a program to extract them) and self-executing that open up automatically. PKZip and WinZip are popular zipping and unzipping programs.",
	"Zlib - zlib is an open-source, cross-platform data compression library. It was created by Jean-loup Gailly and Mark Adler as a general-purpose abstraction of the DEFLATE compression algorithm used in their gzip file compression program.",
	"µTorrent - µTorrent is a Bittorrent client for Microsoft Windows sporting a very small footprint. It is designed to use as little cpu, memory and space as possible while offering all the functionality expected from advanced clients.",
	"1GL: First Generation Programming Language - First-generation programming language(1GL) is a machine-level programming language, which was written in 1s and 0s. There is no compiler or translator required and it can be understood and used by a CPU directly. The code using 1GL can run very fast and efficiently since it is directly executed by the CPU. However, machine language is somewhat more difficult to learn than higher generational programming languages, and it is far more difficult to edit if errors occur. Furthermore code portability is significantly reduced in the 1GL based code. First-generation programming language is mainly used now on very ancient computers. Machine level programming still finds a use in several areas of modern programming with the help of native-code compilers which creates machine language, usually from a higher-level language.",
	"2D Computer Graphics - 2D computer graphics is the computer-based generation of digital images based on two-dimensional models. The word may stand for the branch of computer science that comprises such techniques, or for the models themselves. 2D computer graphics are mainly used in applications that were originally developed upon traditional printing and drawing technologies, such as typography, cartography, technical drawing, advertising, etc.",
	"2GL: Second Generation Language - Second generation language (2GL), also known as second-generation programming language, usually refers to some form of assembly language. Unlike first-generation programming languages, the code can be read and written fairly easily by a human, but it must be converted into a machine readable form in order to run on a computer. The conversion process is simply a mapping of the assembly language code into binary machine code (the first-generation language). The language is specific to and dependent on a particular processor family and environment. Since it is the native language of a processor it has significant speed advantages, but it requires more programming efforts and is difficult to use effectively for large( or wide) applications.",
	"386BSD - 386BSD, also known as JOLIX, is a free operating system produced from the BSD derived UNIX operating systems for the Intel 80386. 386BSD was originally derived from the generally available parts of the \"Berkeley Net Release/2\". All rights with respect to 386BSD and JOLIX are now held exclusively by William Jolitz and Lynne Jolitz. 386BSD public releases ended in 1997 since code is now available from the many 386BSD-derived operating systems today such as such as Apple's Darwin, OpenBSD, OpenSolaris, etc. 386BSD innovations include role-based security, ring buffers, self-ordered configuration, intuitive setup and installation, peer-to-peer download, and modular kernel design. 386BSD is often confused with BSD/386 which was developed by BSDi, a Berkeley spinout, starting in 1991.",
	"3D Computer Graphics - 3D computer graphics are graphic arts that were created with the aid of digital computers and specialized 3D software. In general, the term may also refer to the process of creating such graphics, or the field of study of 3D computer graphic techniques and its related technology. 3D computer graphics are different from 2D computer graphics in which a three-dimensional representation of geometric data is stored in the computer for the purposes of performing calculations and rendering 2D images. Sometimes these images are later displayed in a pre-rendered form, and sometimes they are rendered in real-time.",
	"3D Flash - 3D Flash refers to three-dimensional (3D) animations using Macromedia/Adobe Flash, which is primarily a 2D flash creation tool. Additional tools are required to make 3D Flash products.",
	"3D Studio Max - 3D Studio Max, also known as 3ds Max, is a 3-dimensional vector graphics and animation program, developed by Autodesk Media & Entertainment (formerly known as Discreet and Kinetix). 3DS Max is one of the most widely-used 3D software packages today for several reasons, such as its long heritage on the Microsoft Windows platform, its powerful editing capabilities and its ubiquitous plugin architecture. While still supplying most of the needed tools out-of-the-box, there is a plethora of plugins available.",
	"3GL: Third Generation Language - Third generation language(3GL) is a high level language designed to be easier for a human to understand, including things like named variables. Fortran, ALGOL and COBOL are early examples of this sort of language. Most \"modern\" languages (BASIC, C, C++) are third generation. Most 3GLs support structured programming.",
	"4GL: Fourth-Generation Language - A fourth-generation programming language (4GL) is a programming language closer to human languages than typical high-level programming languages. Such languages arose after the introduction of modern, block-structured third-generation programming languages, which improved the process of software development. Most 4GLs are used to access databases. For example, a typical 4GL command is FIND ALL IS \"JAVVIN\".",
	"5GL: Fifth-Generation Programming Language - Fifth-generation programming language (5GL) is a programming language based around solving problems using constraints given to the program, rather than using an algorithm written by a programmer. Most constraint-based and logic programming languages and some declarative languages are fifth-generation languages. Fifth-generation languages are used mainly in artificial intelligence research. Prolog, OPS5, and Mercury are the best known fifth-generation languages.",
	"7-Zip - 7-Zip is a file archiver predominantly for the Microsoft Windows operating system. It operates either as a command line program or with a graphical user interface. It also features integration with the Windows shell environment. 7-Zip is free software, developed by Igor Pavlov and distributed under the GNU Lesser General Public License (LGPL). It is a competitor to the market-leading WinZip and WinRAR programs, both of which are closed source. It offers a special 64-bit version for Windows XP Professional x64 Edition. In the form of p7zip, 7-Zip has been ported for use on Unix-like systems such as Linux and FreeBSD."
]
