[
	"OATH: Object-Oriented Abstract Type Hierarchy - Object-oriented Abstract Type Hierarchy (OATH) is a class library for C++ from Texas Instruments.",
	"Object - Generally, Object refers to any item that can be individually selected and manipulated. In computer programming such as object-oriented programming, an object is an individual unit of run-time data storage that is used as the basic building block of programs. These objects act on each other, as opposed to a traditional view in which a program may be seen as a collection of functions, or simply as a list of instructions to the computer. Each object is capable of receiving messages, processing data, and sending messages to other objects. Each object can be viewed as an independent little machine or actor with a distinct role or responsibility.",
	"Object code - Object code, also known as object file, is an intermediate representation of code generated by a compiler after it processes a source code file. Object files contain compact, pre-parsed code, often called binaries, that can be linked with other object files to generate a final executable or code library. An object file is mostly machine code that can be directly executed by a computer's CPU. An object file contains not only the object code, but also relocation information that the linker uses to assemble multiple object files into an executable or library, program symbols (names of variables and functions), and debugging information.",
	"Object Model - An object model is a subkind of data model with primitive concepts identity, state, encapsulation, operations/methods, messages, inheritance, polymorphism/overloading. An object model deals to the properties of objects in general, in a specific computer programming language, technology, notation or methodology that uses them. For example, the Java object model, the COM object model, or the object model of OMT. Such object models are usually defined using concepts such as class, message, inheritance, polymorphism, and encapsulation. There is an extensive literature on formalized object models as a subset of the formal semantics of programming languages.",
	"Object Database - Object database refers to a type of database in which information is represented in the form of objects. The database management system for an object database is referred to variously as a ODBMS or OODBMS. Object database technologies becomes useful when: 1) a relational database becomes cumbersome to be used with complex data; 2) data is generally manipulated by application software written using object-oriented programming languages and tools such as C++, Java, Borland Delphi and C#, and the code needed to translate between this representation of the data, and the tuples of a relational database can be tedious to write and time-consuming to execute.",
	"Object Pool - An object pool is a set of initialised objects that are kept ready to use, rather than allocated and destroyed on demand. A client of the pool will request an object from the pool and perform operations on the returned object. When the client has finished with an object, it returns it to the pool, rather than destroying it. It is a specific type of factory object. Object pooling can offer a significant performance boost; it is most effective in situations where the cost of initializing a class instance is high, the rate of instantiation of a class is high, and the number of instantiations in use at any one time is low.",
	"Object-SQL Mapping - Object-SQL mapping, also known as object-relational mapping(O/RM), is a programming technique that links SQL databases to object-oriented language concepts, creating (in effect) a \"virtual object database.\" There are both free and commercial packages available that perform object-SQL mapping, although some programmers opt to code their own object-SQL mapping for their systems.",
	"Objectworks - Objectworks is an object-oriented development environment developed by ParcPlace, available under Smalltalk and C++.",
	"OD390 - OD390 is a Customer Information Control System (CICS) Web interperter from IBM used for application development involving web interfaces to DB2 tables.",
	"ODA: Open Document Architecture - Open Document Architecture (ODA), formerly called Office Document Architecture, is an ISO standard that specifies how documents are represented and transmitted electronically.",
	"ODBC: Open Database Connectivity - Open Database Connectivity (ODBC) is a common framework for accessing and altering the contents of databases. It allows developers to use the same coding conventions regardless of the actual database platform implemented on the backend. When a new database type is installed, administrators merely need to install an ODBC driver that supports that platform and existing ODBC software should function normally. ODBC provides a standard software API method for using database management systems (DBMS). The designer of ODBC aimed to make it independent of programming language, database system and operating system.",
	"ODBMS: Object Database Management System - Object Database Management System (ODBMS), also known as Object Oriented Database Management System (OODBMS), refers to the database management system for an object database. Benchmarks between ODBMSs and relational DBMSs have shown that ODBMS can be clearly superior for certain kinds of tasks. The main reason for this is that many operations are performed using navigational rather than declarative interfaces, and navigational access to data is usually implemented very efficiently by following pointers. Critics of ODBMS, suggest that pointer-based techniques are optimized for very specific \"search routes\" or viewpoints. However, for general-purpose queries on the same information, pointer-based techniques will tend to be slower and more difficult to formulate than relational.",
	"ODNT: Object Desktop Network - The Object Desktop Network (OD or ODNT) is a software subscription service created by Stardock. Launched in 1995 on OS/2, it transitioned in 1997/98 to the Windows platform. Subscribers typically download Object Desktop components across the Internet using Stardock Central, although CD snapshots are available on request. Once downloaded, users may use released versions of components forever.",
	"O.K.I.: Open Knowledge Initiative - The Open Knowledge Initiative (O.K.I.) is an organization responsible for the specification of software interfaces comprising a Service Oriented Architecture (SOA) based on high level service definitions. The Open Knowledge Initiate was initially sponsored by the Andrew W. Mellon Foundation, Massachusetts Institute of Technology and the IMS Global Learning Consortium. O.K.I. has designed and published a suite of software interfaces known as Open Service Interface Definitions (OSIDs), each of which describes a logical computing service.",
	"OLAP: Online Analytical Processing - Online Analytical Processing is a type of software that allows for the real-time analysis of data stored in a database. It is an approach to quickly provide the answer to analytical queries that are dimensional in nature. The OLAP server is normally a separate component that contains specialized algorithms and indexing tools to efficiently process data mining tasks with minimal impact on database performance. The typical applications of OLAP are in business reporting for sales, marketing, management reporting, business performance management (BPM), budgeting and forecasting, financial reporting and similar areas.",
	"OLE: Object Linking and Embedding - Object Linking and Embedding(OLE), a technology developed by Microsoft, enables the creation of documents by incorporating elements created using different kinds of software. Object Linking and Embedding system allow objects from one application to be embedded within another (eg, taking an Excel spreadsheet and putting it into a Word document).",
	"OLTP: Online Transaction Processing (OLTP) - Online Transaction Processing (or OLTP) is a class of program that facilitates and manages transaction-oriented applications, typically for data entry and retrieval transaction processing. OLTP also refers to computer processing in which the computer responds immediately to users' requests. An automatic teller machine for a bank is an example of transaction processing. Probably the most widely installed OLTP product is IBM's CICS (Customer Information Control System).",
	"OMG: Object Management Group - Object Management Group (OMG) is a consortium, originally aimed at setting standards for distributed object-oriented systems, and now focused on modeling (programs, systems and business processes) as well as model-based standards in some 20 vertical markets. Founded in 1989 by eleven companies (including Hewlett-Packard Company, Apple Computer, American Airlines and Data General), OMG mobilized to create a cross-compatible distributed object standard. The goal was a common portable and interoperable object model with methods and data that work using all types of development environments on all types of platforms. At its founding, OMG set out to create the initial Common Object Request Broker Architecture (CORBA) standard which appeared in 1991.",
	"OmniPage Professional - OmniPage Professional is a software used in conjunction with a scanner, to scan pictures or documents into the computer.",
	"OO Language: Object-Oriented Language - Object-oriented language (OO language) is a type of computer programming language that allows or encourages, to some degree, object-oriented programming methods. OO languages can be grouped into several broad classes, determined by the extent to which they support all features and functionality of object-orientation and objects: classes, methods, polymorphism, inheritance, and reusability.",
	"OODBMS: Object Oriented Database Management System - Object Oriented Database Management System (OODBMS), also known as Object Database Management System (ODBMS), refers to the database management system for an object database. Benchmarks between ODBMSs and relational DBMSs have shown that ODBMS can be clearly superior for certain kinds of tasks. The main reason for this is that many operations are performed using navigational rather than declarative interfaces, and navigational access to data is usually implemented very efficiently by following pointers. Critics of ODBMS, suggest that pointer-based techniques are optimized for very specific \"search routes\" or viewpoints. However, for general-purpose queries on the same information, pointer-based techniques will tend to be slower and more difficult to formulate than relational ones.",
	"OOP: Object-Oriented Programming - Object-oriented programming(OOP) is a computer programming paradigm, in which writing programs in one of a class of programming languages and techniques based on the concept of an \"object\" which is a data structure (abstract data type) encapsulated with a set of routines, called \"methods\" which operate on the data. Operations on the data can only be performed via these methods, which are common to all objects which are instances of a particular \"class\". Thus the interface to objects is well defined, and allows the code implementing the methods to be changed so long as the interface remains the same. The programming languages support object-oriented programming, including the Java platform and the .NET Framework.",
	"Open Group - The Open Group is an industry consortium that sets vendor- and technology-neutral open standards for computing infrastructure. It was formed when X/Open merged with the Open Software Foundation in 1996. The Open Group is known for its experience in facilitating consensus to develop and evolve standards and best practices. It operates a number of certification programs, including certification for Common Operating Environment (COE) Platform, CORBA, Directory, IT Architects, Linux Standard Base, POSIX, Schools Interoperability Framework (SIF), TOGAF, UNIX, and Wireless Application Protocol (WAP). The Open Group is also the owner of the UNIX trademark.",
	"OPEN LOOK - OPEN LOOK or OpenLook was an early graphical user interface (GUI) specification developed by Sun Microsystems and AT&T in the early 1990s for UNIX workstations. It had its origins in SunOS 2.1, SunView, and Sun's Motorola 68000–based UNIX workstations.",
	"Open Outsourcing - Open outsourcing, a socio-economic movement resulting from the open source movement and the international outsourcing of programming, refers to a practice of making open source technologies more accessible to businesses and individuals by employing an inexpensive international labor force of programmers, often on a contractual piecework basis. Small businesses may not be technical enough to efficiently utilize open source resources in-house or large enough to hire a full time technician. Larger businesses with IT staff may lack technicians with specific skills or knowledge.",
	"Open Source - Open source refers to practices in production and development of software by a public development community(typically volunteers from many organizations) rather than a single vendor. The source code of open source software is free and available to anyone who would like to use it or modify it for their own purposes. This allows an organization to add a feature itself rather than hope that the vendor of a proprietary product will implement its suggestion in a subsequent release. Some consider open source as a philosophy, and others consider it as a pragmatic methodology of software development.",
	"Open Source Movement - The open source movement is an offshoot of the free software movement that advocates open-source software as an alternative label for free software, primarily on pragmatic rather than philosophical grounds.",
	"Open64 - Open64 is an open source optimizing compiler for Intel Itanium platform. It was released by SGI company and now mostly serves as a research platform for compiler and computer architecture research groups.",
	"OpenBSD - OpenBSD is a secure, freely available, multi-platform BSD-based Unix-like operating system. OpenBSD specialises in security and correctness. Its developers carefully and proactively audit the system's code, which in turn contributes to the stability and security of OpenBSD. The project is led by Theo de Raadt from Calgary, Alberta, Canada.",
	"OpenBSM - OpenBSM is an open source implementation of Sun's Basic Security Module (BSM) Audit API and file format. BSM, which is a system used for auditing, describes a set of system call and library interfaces for managing audit records as well as a token stream file format that permits extensible and generalized audit trail processing.",
	"OpenC++ - OpenC++ is a software tool to parse and analyze C++ source code. It uses a metaobject protocol (MOP) to provide services for language extensions.",
	"OpenDoc - OpenDoc is a multi-platform software componentry framework standard for compound documents, inspired by the Xerox Star system and intended as an alternative to Microsoft's Object Linking and Embedding (OLE). OpenDoc makes it possible to design independent programs (components) that can work together on a single document. OpenDoc is being developed by a loose alliance of companies, including Apple Computer and IBM.",
	"OpenGL: Open Graphics Library - Open Graphics Library(OpenGL) is a standard specification defining a cross-language cross-platform API for writing applications that produce 3D computer graphics (and 2D computer graphics as well). The interface consists of over 250 different function calls which can be used to draw complex three-dimensional scenes from simple primitives. OpenGL was developed by Silicon Graphics and is popular in the video games industry where it competes with Direct3D on Microsoft Windows platforms. OpenGL is widely used in CAD, virtual reality, scientific visualization, information visualization, flight simulation and video game development.",
	"OpenKore - OpenKore is a roBOTic computer controlled entity (bot) designed for use with the Ragnarok MMORPG with the intention of automated playing and/or leveling. OpenKore is an advanced bot created by VCL as a variation of one of the most popular Ragnarok Online bots, Kore. Its code is written in Perl, and possesses a command line interface. OpenKore is a fully free and open-source project.",
	"OpenNTPD - OpenNTPD is a Unix system daemon that uses the Network Time Protocol to synchronise clocks of computer systems with a reliable and accurate time source. OpenNTPD was developed as part of the OpenBSD project. Its design goals include creating a daemon that is secure (non-exploitable), easy to configure and to have source code that can be distributed under a BSD license.",
	"OpenROAD: Open Rapid Object Application Development - Open Rapid Object Application Development(OpenROAD) is a 4GL development language which includes a suite of development tools, with built-in IDE, Code Repository, allowing applications to be developed and deployed on various platforms. The syntax of OpenROAD is very closely linked to that of the Ingres database, with direct support for embedded SQL. In a similar way to other event based programming languages, code can be placed in groups for related windows/system events. Ingres Corporation owns and provides support and services for Ingres, OpenROAD and the connectivity products.",
	"OpenSolaris - OpenSolaris is an open source project created by Sun Microsystems to build a developer community around the Solaris Operating System technology. The project is aimed at developers, system administrators, and users who want to develop and improve operating systems.",
	"Open-Source License - An open-source license is a copyright license for computer software that makes the source code available under terms that allow for modification and redistribution without having to pay the original author. Such licenses may have additional restrictions such as a requirement to preserve the name of the authors and the copyright statement within the code. One popular (and sometimes considered normative) set of open source licenses are those approved by the Open Source Initiative (OSI) based on their Open Source Definition (OSD).",
	"OpenTracker - OpenTracker refers to the open source versions of the Tracker and Deskbar desktop management tools for BeOS. The original Tracker and Deskbar were created by Be, Incorporated, as part of BeOS, but were opensourced in late 2000. It is under the OpenTracker Licence, which is a barely modified BSD licence that allows the use of the Be trademark Tracker to be used.",
	"Operating Environment - Operating environment is the environment in which users run programs, whether in a command line interface, such as in MS-DOS, or in a graphical user interface, such as in the Macintosh operating system or Windows. There is a thin line between operating environments and shells (such as Unix shell). Historically, shells are the interfaces to operating systems. They do not actually add any new capabilities; they simply provide a better user interface. So-called intelligent shells, however, actually extend an operating system's capabilities, so there is little difference between intelligent shells and operating environments.",
	"OPS5: Official Production System - Official Production System (OPS5) is a rule-based or production system computer language, notable as the first such language to be used in a successful expert system, the R1/XCON system used to configure VAX computers. The first implementation of OPS5 was written in Lisp, and later rewritten in BLISS for speed.",
	"Oracle Database - Oracle database is a relational database management system (DBMS) from Oracle, which runs on more than 80 platforms. The Oracle database, the current version of which is Oracle11i, is Oracle's flagship product. It was introduced in the late 1970s and was the first database product to run on a variety of platforms from micro to mainframe computers.",
	"ORB: Object Request Broker - An object request broker (ORB), a term in distributed computing, is a piece of middleware software that allows programmers to make program calls from one computer to another, via a network. ORBs handle the transformation of in-process data structures to the byte sequence which is transmitted over the network (of course, also the reverse transformation). This is called marshalling or serialization. ORBs often expose many more features, such as distributed transactions, directory services or real-time scheduling. In the object oriented languages, the ORB is an object, having methods to connect the objects being served. After such an object is connected to the ORB, the methods of that object become accessible for remote invocations. ORB must also have some means to obtain the network address of the object that has now become remote. The typical ORB also has many other methods.",
	"ORD: Object-Relational Database - An object-relational database (ORD) is a relational database that allows developers to integrate the database with their own custom data types and methods. The term object-relational database is sometimes used to describe external software products running over traditional DBMSs to provide similar features; these systems are more correctly referred to as object-relational mapping systems.",
	"ORDBMS: Object-Relational Database Management System - Object-relational database management system (ORDBMS) is a relational database management system that allows developers to integrate the database with their own custom data types and methods. Whereas RDBMS or SQL-DBMS products focused on the efficient management of data drawn from a limited set of data types (defined by the relevant language standards), an object-relational DBMS allows software developers to integrate their own types and the methods that apply to them into the DBMS. The goal of ORDBMS technology is to allow developers to raise the level of abstraction at which they view the problem domain.",
	"OS/2: Operating System/2 - Operating System/2 (OS/2) is an operating system created by Microsoft and IBM, later developed by IBM exclusively. OS/2 is no longer marketed by IBM, and support for OS/2 is to be discontinued on December 31, 2006.",
	"OS: Operating System - Operating system (OS) is a software program that manages the hardware and software resources of a computer. The OS performs basic tasks, such as controlling and allocating memory, prioritizing the processing of instructions, controlling input and output devices, facilitating networking, and managing files. The OS may be split into a kernel which is always present and various system programs which use facilities provided by the kernel to perform higher-level house-keeping tasks, often acting as servers in a client-server relationship.",
	"OSD: Open Source Definition - The Open Source Definition(OSD) is used by the Open Source Initiative(OSI) to determine whether or not a software license can be considered open source. The definition was based on the Debian Free Software Guidelines, written and adapted primarily by Bruce Perens. Under the Open Source Definition, licenses must meet ten conditions in order to be considered open source licenses.",
	"OSF: Open Software Foundation - Open Software Foundation (OSF) is an organization to create an open standard for an implementation of the Unix operating system. OSF's standard Unix implementation was known as OSF/1 and was first released in 1990, which is not widely deployed. Other well-known standards developed by OSF include Motif and the Common Desktop Environment, respectively a widget toolkit and desktop environment for the X Window System. In 1996, OSF merged with the X/Open Company to become The Open Group.",
	"OSI: Open Source Initiative - The Open Source Initiative (OSI) is an organization dedicated to promoting open-source software. Open Source Initiative was founded in February 1998 by Bruce Perens and Eric S. Raymond when Netscape Communications Corporation, published the source code for its flagship Netscape Communicator product as free software, due to lowering profit margins and competition with Microsoft's Internet Explorer software.",
	"OSID: Open Service Interface Definition - Open Service Interface Definitions (OSIDs) are programmatic interface specifications describing services. These interfaces are specified by the Open Knowledge Initiative (O.K.I.) to implement a Service-Oriented Architecture (SOA) to achieve interoperability among applications across a varied base of underlying and changing technologies.",
	"OSS/J: OSS Through Java - Operations Support System(OSS) through Java (OSS/J) is a kind of middleware to connect different OSS information systems by using Java technologies. The OSS/J initiative has been founded in 2000 by several members. Their primary goal is to develop an open standard for the integration of Operations Support Systems.",
	"OSS: Open Sound System - The Open Sound System (OSS) is a portable sound interface available in 11 different Unix systems. In the case of the Linux kernel, OSS was the only supported sound system used up to the 2.4.x series. Starting with version 2.5, the Advanced Linux Sound Architecture (ALSA) was introduced, and the OSS interface became deprecated by Linux' authors. ALSA contains an optional OSS emulation mode that transparently appears to programs as if it were OSS.",
	"OSS: Open-Source Software - Open-source software(OSS) is a type of computer software whose source code is available under a copyright license that permits users to study, change, and improve the software, and to redistribute it in modified or unmodified form. Benefits of OSS are that developers can customize programs, and these innovations, in turn, are shared within the programming community so that everyone learns from each other. Linux is one popular example of OSS.",
	"Outliner - An outliner is a special text editor that allows the grouping of text in sections that are organized in a tree (hierarchy) of concepts, an outline. Outline tools can be used for computer programming, collecting or organizing ideas, or project management.",
	"p7zip - p7zip is a port of the command line version of the 7-Zip file archiverfamous for its introduction of the high-compression 7z formatto POSIX-conforming operating systems, such as Unix, Linux, Windows NT (or greater version) and Mac OS X. It is free software, available under the LGPL free software license.",
	"Packaged Software - Packaged software refers to a commercial application program or collection of programs developed to meet the needs of a variety of users, rather than custom designed for a specific user or company. Packaged software is normally put on a CD (or disks), packaged in a box and sold to the general public.",
	"Page Recognition - Page recognition is a feature of software to recognize different kinds of items on a scanned page. Page recognition software can distinguish text from pictures, and converts text on the page into computer characters by means of optical character recognition (OCR).",
	"Paint Program - Paint program is a type of application that allows a user to \"paint\" on the computer screen. Using a mouse or other pointer, the user can select from various drawing and painting tools such as brushes, spray cans, etc. and a full palette of colors. The paint program allows the user to control the color of each pixel. Sophisticated graphics editing capabilities such as screens, filters, etc., can be used. Example ofpaint program include Adobe Illustrate and Coral Draw.",
	"Parallel Algorithm - In computer science, a parallel algorithm, as opposed to a traditional serial algorithm, is one which can be executed a piece at a time on many different processing devices, and then put back together again at the end to get the correct result.",
	"Parallel Compiler - Parallel compiler is a type of computer compiling technique that is used to speed up the process of compilation on multiprocessor machines. Parallel compilers are developed for supercomputers and other large scale multiprocessor machines.",
	"Parallel Computing - Parallel computing is the simultaneous execution of the same task (split up and specially adapted) on multiple processors or multiple computers in order to obtain results faster. The idea is based on the fact that the process of solving a problem usually can be divided into smaller tasks, which may be carried out simultaneously with some coordination. A subtype of parallel algorithms, distributed algorithms are algorithms designed to work in cluster computing and distributed computing environments, where additional concerns beyond the scope of \"classical\" parallel algorithms need to be addressed.",
	"Parallel Port - Parallel port, also called a female connector, is a socket on a computer for transmitting data in parallel, or more than one bit at a time. There may be eight, 16, or 36 channels; each channel carries one bit of information, so eight channels would be used to transmit one eight-bit byte at a time. Not all the channels are used for data; some maybe used for control signals. A parallel port has 25 holes, and the cable that plugs into it has 25 pins.",
	"Parallel Processing - Parallel processing is a computing architecture within a single computer that performs more than one operation at the same time. Parallel processing can also be achieved by using multiple computers clustered together to procss one part of a large function simultaneously to obtain results faster.",
	"Parallel Terraced Scan - The parallel terraced scan is a multi-agent based search technique that is basic to cognitive architectures, such as copycat, letter-string, the examiner, tabletop, and others. It was developed by John Rehling and Douglas Hofstadter at the Center for Research on Concepts and Cognition at the Indiana University, Bloomington.",
	"Parser Program - Parser is a computer program to conduct parsing process to determine the syntactic structure of a sentence or string of symbols in some languages. A parser normally takes as input a sequence of tokens output by a lexical analyser. It may produce some kind of abstract syntax tree as output. One of the best known parser generators is yacc.",
	"Parsing Process - Parsing process, also known as syntax analysis, refers to the analyzing an input sequence (read from a file or a keyboard, for example) in order to determine its grammatical structure with respect to a given formal grammar. Parsing process transforms input text into a data structure, usually a tree, which is suitable for later processing and which captures the implied hierarchy of the input. Generally, parsers operate in two stages, first identifying the meaningful tokens in the input, and then building a parse tree from those tokens.",
	"Partial Evaluation - Partial evaluation is a technique for program compiling optimization. During compiling, partial evaluation transforms and pre-computes the static data, part of the input data known at compile time, into dynamic data, which in general runs more efficiently.",
	"Pascal programming Language - Pascal pogramming language is a high-level programming language developed by Niklaus Wirth in the late 1960s based on ALGOL, and named after Blaise Pascal, a seventeenth-century French mathematician who constructed one of the first mechanical adding machines. Pascal is best known for its affinity to structured programming techniques. The nature of the language forces programmers to design programs methodically and carefully. For this reason, it is a popular teaching language.",
	"Patch - A patch, so called a service patch or software pacth, refers to a fix to a program bug. A patch is an actual piece of object code that is inserted into (patched into) an executable program. Patches typically are available as downloads over the Internet.",
	"Pattern Matching - Pattern matching is the act of checking for the presence of the constituents of a given pattern. In contrast to pattern recognition, the pattern is rigidly specified. Such a pattern concerns conventionally either sequences or tree structures. Pattern matching is used to check that things have the desired structure, to find relevant structure, to retrieve the aligning parts, and to substitute the matching part with something else.",
	"Payware - Payware is a type of Internet downloadable software that has a price and is on sale. It is a commercial software not freeware or shareware.",
	"PC Weenies - The PC Weenies is a popular webcomic with a special focus on technology humor and geek culture, as experienced through the lives of the fictitious Weiner family. The PC Weenies was created and launched on the web in October 1998 by Krishna M. Sadasivam, a former electrical engineer. The series has enjoyed success in web and print media. Most notably, The PC Weenies was the first webcomic to appear regularly on CNET. Currently, The PC Weenies appear in both Tau Beta Pi's The BENT publication, as well as EE Times.",
	"PCBoard - PCBoard was an MS-DOS / OS/2 bulletin board system (BBS) software package first created by the Clark Development Corporation, first introduced in 1983. Clark Development pioneered the FILE_ID.DIZ format as well as a powerful scripting language (PPL) which supported modifications called PPEs (PCBoard Programming Executable).",
	"PC-BSD - PC-BSD is a Unix-like, desktop-oriented operating system based on FreeBSD. It aims to be easy to install by using a graphical installation program, and easy- and ready-to-use immediately by providing KDE as the default, pre-installed graphical user interface. The PC-BSD project is currently developing a graphical software installation program which will install pre-built software packages",
	"PC-DOS: Personal Computer-Disk Operating System - Personal Computer-Disk Operating System(PC-DOS) is an operating system developed by Microsoft and supplied with IBM PCs. Microsoft also developed MS-DOS, a very similar operating system, to be used with non-IBM PCs. Starting with DOS 6, MS-DOS and PC-DOS have different sets of auxiliary utility programs. MS-DOS and PC-DOS are both called DOS for short.",
	"PCL: Printer Control Language - Printer Control Language (PCL) is the page description language (PDL) developed by HP that has become a de facto industry standard. Originally developed for early inkjet printers in 1984, PCL has been released in varying levels for thermal, dot matrix printer, and laser printers. PCL 5 and later versions support a scalable font technology called Intellifont.",
	"PCMS: Platform Content Management System - Platform Content Management System (PCMS), a type of content management system, provides the ability to manage all objects (files, folders, programs, etc) on a given set of systems.",
	"PDF: Portable Document Format - Portable Document Format(PDF) is the native file format for Adobe Systems' Acrobat. The PDF file format is independent of the original application software, hardware, and operating system used to create those documents. A PDF file can describe documents containing any combination of text, graphics, and images in a device-independent and resolution independent format.",
	"PDL: Page Description Language - Page Description Language(PDL) is a type of printer language that allows the appearance of a printed page to be described in a high-level, device-independent way. Using PDL, printing then becomes a two-stage process: an application program produces a description in the language, which is then interpreted by a specific output device. Page Description Language can therefore serve as an interchange standard for transmission and storage of printable documents. Examples of PDL are Adobe Systems, Inc.'s PostScript or Xerox's Interpress.",
	"PEEK and POKE - In computing, PEEK is a BASIC programming language function used for reading the contents of a memory cell at a specified address. The corresponding command to set the contents of a memory cell is POKE.",
	"Peephole Optimization - Peephole optimization is a kind of optimization performed over a very small set of instructions in a segment of generated code. The set is called a \"peephole\" or a \"window\". This kind of optimization makes certain assumptions about the efficiency of instructions. Modern computer architectures typically allow for many hundreds of different kinds of peephole optimizations, and it is therefore often appropriate for compiler programmers to implement them using a pattern matching algorithm.",
	"People Aggregator - A people aggregator is a social networking system derived from FOAF that uses open standards, network interconnectivity, and massive flexibility to decentralise social networking on the internet.",
	"Per Seat - Per seat is a way of licensing software based on the number of workstations on which it will be installed and used.",
	"Perl: Practical Extraction and Reporting Language - Perl (Practical Extraction and Reporting Language) is a script programming language that is similar in syntax to the C language and that includes a number of popular Unix facilities such as sed, awk, and tr.",
	"PHP Hypertext Preprocessor - PHP Hypertext Preprocessor(PHP) is an open-source, reflective programming language. Originally designed as a high level scripting language for producing dynamic Web pages, PHP is used mainly in server-side application software. PHP allows web developers to create dynamic content that interacts with databases. PHP applications are normally found on Linux servers and in conjunction with MySQL databases. It provides those servers with functionality similar to that provided to the Windows platform by Active Server Pages technology.",
	"PHPEdit - PHPEdit is a commercial Integrated Development Environment (IDE) developed by the PHPEdit Group. It runs on the Microsoft Windows operating system, and is designed mainly for the PHP language.",
	"Physalis - Physalis is a project to build software that allows users to run a service framework (OSGi-like) on top of Microsoft .NET capable devices and computers. It is also supposed to work with the .NET Compact Framework and thus support diverse embedded devices like Pocket PCs, Smart Phones and custom solutions based on the Windows CE embedded operating system.",
	"PID: Process Identifier - Process identifier(PID) is an integer used by the Unix kernel to uniquely identify a process. PIDs are returned by the fork system call and can be passed to wait() or kill() to perform actions on the given process.",
	"Piracy - Software piracy refers to the illegal copying, distribution, or use of software.",
	"PKZIP: Phil Katz's ZIP - Phil Katz's ZIP (PKZIP) program is an archiving tool originally written by the late Phil Katz, and marketed by his company PKWARE, Inc. The first version of PKZIP appeared in 1989. It was a DOS command-line tool and was distributed as shareware.",
	"Planner Programming Language - Planner programming language designed by Carl Hewitt at MIT in 1969. First subsets such as Micro-Planner and Pico-Planner were implemented and then essentially the whole language was implemented in Popler and derivations such as QA-4, Conniver, QLISP and Ether were important tools in Artificial Intelligence research in the 1970's, which influenced the commercial developments of KEE and ART.",
	"Plugin or Plug-In - A plugin (or plug-in) is a type of computer programs that interacts with a main application (a web browser or an email program, for example) to provide a certain, usually very specific, function. Typical examples are plugins that read or edit specific types of files (for instance, multimedia files); encrypt or decrypt email (for instance, PGP); filter images in graphic programs.",
	"Podcatcher - A podcatcher is a computer program used to automatically download podcasts. It is a form of aggregator, and can also transfer received audio files to a portable media player. For example, the iTunes by Apple Computers, is a Podcatcher.",
	"Polyfont Recognition - Polyfont recognition, a term often used with OCR software, refers to the capability of computer software to read (or recognize) more than one type of font on a document.",
	"Portable Software - Portable software refers to a type of software that can be used on more than one hardware platform, and easily switched from one to another.",
	"POSIX: Portable Operating System Interface - Portable Operating System Interface(POSIX) is a set of IEEE standards (1003) designed to provide application portability between Unix variants. IEEE 1003.1 defines a Unix-like operating system interface, IEEE 1003.2 defines the shell and utilities and IEEE 1003.4 defines real-time extensions.",
	"Postgres - Postgres is an object-oriented relational database management system (OORDBMS). It began as a research project at the University of California, Berkely and is available in several free and commercial versions today.",
	"PostScript - PostScript, a Page Description Language(PDL), is an interpreted, stack-based language (like FORTH). It was used as a page description language by the Apple LaserWriter, and now many laser printers and on-screen graphics systems. Its primary application is to describe the appearance of text, graphical shapes and sampled images on printed or displayed pages.",
	"POV-Ray: Persistence of Vision Raytracer - Persistence of Vision Raytracer (POV-Ray) is a free ray tracing program available for a variety of computer platforms. It was originally based on DKBTrace, written by David K. Buck and Aaron A. Collins."
]
