[
	"Cross Compiler - A cross compiler is a compiler capable of creating executable code for another platform than the one on which the cross compiler is run. Such a tool is handy when you want to compile code for a platform that you don't have access to, or because it is inconvenient or impossible to compile on that platform (as is the case with embedded systems.)",
	"Crowd Simulation - Crowd simulation is the process of simulating the movement of a large number of objects or characters, now often appearing in 3D computer graphics for film. The need for crowd simulation arises when a scene calls for more characters than can be practically animated using conventional systems, such as skeletons/bones.",
	"CSCI: Computer Software Configuration Item - Computer Software Configuration Item(CSCI) is a group of software treated as a single entity by a configuration management (CM) system. CSCI is for configuration control at the system architectural design, by contractual specification, or as development products. CSCI entities include software products to be developed or used under contract, and certain elements required from the software development environment.",
	"CSE: Common Subexpression Elimination - Common subexpression elimination (CSE), a term in compiler theory, is the practice of finding repeated redundant expression evaluations, and replacing them with a single computation assigned to a temporary variable. Although it can be done manually, the term usually refers to a compiler optimization.",
	"CSV: Comma Separated Values - Comma Separated Values (CSV) is a data type that is commonly used no-frills text file format for import from and export to spreadsheets and SQL databases.",
	"CUA: Common User Access - Common User Access (CUA) is a set of guidelines for the user interface to personal computer operating systems and computer programs, developed by IBM starting in 1987 as part of their Systems Application Architecture. Used originally in the OS/2 and Microsoft Windows operating systems, parts of the CUA standard are now implemented in programs for other operating systems, including variants of Unix. Java AWT and Swing use it as well. The CUA contains standards for the operation of dialog boxes, menus and keyboard shortcuts. For example, in programs written to the CUA standard, help is always summoned by pressing the F1 function key. New programs should be easier to use because users will not have to learn new commands to perform standard tasks.",
	"Cubase - Cubase is a MIDI, music sequencer and digital audio editing computer application (commonly known as a DAW - Digital Audio Workstation) created by the German firm Steinberg in 1989. Cubase started as a MIDI recording and editing tool. Later, features for recording raw audio were introduced. Cubase was originally written for the Atari ST, and has since been ported to Apple Macintosh and Microsoft Windows.",
	"Custom Software - Custom software, also called bespoke software, is software that was developed with a specific organization and its requirements in mind. Custom software is necessary when mass market software does not satisfy the functionalities required.",
	"Customized Toolbar - Customized toolbar is a toolbar that can be custom configured (modified) by the user. For example, buttons in the toolbar can be added and deleted as required.",
	"CVS: Concurrent Versions System - The Concurrent Versions System (CVS), also known as the Concurrent Versioning System, implements a version control system: it keeps track of all work and all changes in a set of files, typically the implementation of a software project, and allows several (potentially widely separated) developers to collaborate. CVS has become popular in the free software and open-source worlds. CVS is released under the GNU General Public License.",
	"Cwiab: Church Website in a Box - Church Website in a Box (CWIAB) is a free, open source content management system created from Postnuke, released under the GNU General Public License. The CWIAB project was started because Postnuke was very well suited for use by churches, but quite a bit of effort was still required collecting various PostNuke modules and installing them. Church Website in a Box can be installed in minutes and provides adequate functionality for most churches 'out of the box.' CWIAB is not a fork, but a collection of PostNuke and relevant modules.",
	"Cyclomatic Complexity - Cyclomatic complexity is a software metric (measurement) concept in computational complexity theory. It was developed by Thomas McCabe and is used to generally measure the complexity of a program. It directly measures the number of linearly independent paths through a program's source code.",
	"Cygwin - Cygwin is a collection of free software tools originally developed by Cygnus Solutions to allow various versions of Microsoft Windows to act somewhat like a UNIX system. It aims mainly at porting software that runs on POSIX systems (such as Linux systems, BSD systems, and UNIX systems) to run on Windows with little more than a recompilation. Cygwin is currently maintained by employees of Red Hat and others.",
	"Daemon - In Unix and other computer multitasking operating systems, a daemon is a computer program that runs in the background, rather than under the direct control of a user; they are usually instantiated as processes. The Daemon program, often started at the time the system boots and runs continuously without intervention from any of the users on the system, forwards the requests to other programs (or processes) as appropriate. Typically daemons have names that end with the letter \"d\"; for example, syslogd is the daemon which handles the system log. Windows OS refers to daemons as System Agents and services.",
	"DAM: Digital Asset Management - Digital asset management (DAM) refers to the practice and domain of organizing digital files, like images, documents, videos and presentations. The term asset is used to indicate that such files have some sort of intrinsic value that makes it worthwhile to manage them. DAM is related to and can be considered a superset of content management. For more information see also digital asset management systems and content management systems. To manage digital assets effectively, assets must be made available to the people who need them to efficiently contribute to the growth of the culture using them.",
	"DARCS: David's Advanced Revision Control System - David's Advanced Revision Control System (Darcs) is a distributed software revision control system designed by David Roundy to replace the centralized Concurrent Versions System (CVS). In the Darcs Each copy of the source tree acts as a full repository, allowing several different versions to be maintained in different locations. Patches are global to the repository and are subject under certain conditions to reordering, as governed by the project's theory of patches",
	"Data - Data, in information industry, refers to distinct pieces of information, usually formatted in a special way. All information system is divided into two general categories: data and programs. Data can exist in a variety of forms - as numbers or text on pieces of paper, as bits and bytes stored in electronic memory, or as facts stored in a person's mind. Programs refer to the collections of instructions for manipulating data, which may be software programs for compute processing, or a set of instructions for manual data operation.",
	"Data Architect - A data architect is a person responsible for making sure an organization's strategic goals are optimized through the use of enterprise data standards. Data architect's job frequently includes the set up and maintain a metadata registry and allows domain-specific stakeholders to maintain their own data elements.",
	"Data Architecture - Data architecture describes how data is processed, stored, and utilized in a given system. It provides criteria for data processing operations that make it possible to design data flows and also control the flow of data in the system. Data architecture also includes topics such as metadata management, business semantics, data modeling and metadata workflow management.",
	"Data Cleansing - Data cleansing, also called as data scrubbing, is the process of detecting and removing and/or correcting a database to increase data accuracy, reduce redundancy and enhance consistency of different sets of data that have been merged from separate databases. Sophisticated software applications are available to clean a database data using algorithms, rules and look-up tables, a task that was once done manually and therefore still subject to human error.",
	"Data Conversion - Data conversion is the conversion of one form of computer data to another--the changing of bits from being in one format to a different one, usually for the purpose of application interoperability or of capability of using new features. At the simplest level, data conversion can be exemplified by conversion of a text file from one character encoding to another. More complex conversions are those of office file formats, and conversions of image and audio file formats are an endeavor that is beyond the ken of ordinary computer users.",
	"Data Element - Data element, as a term used in metadata, is an atomic unit of data that has the following characters: 1) An identification such as a data element name; 2) A clear data element definition; 3) One or more representation terms; 4) Optional enumerated values Code (metadata); 5) A list of synonyms to data elements in other metadata registries Synonym ring. Data elements usage can be discovered by inspection of software applications or application data files through a process of manual or automated Application Discovery and Understanding. Once data elements are discovered, they can be registered in a metadata registry.",
	"Data element definition - In metadata, a data element definition is a human readable phrase or sentence associated with a data element within a data dictionary that describes the meaning or semantics of a data element. Data element definitions are critical for external users of any data system. Good definitions can dramatically ease the process of mapping one set of data into another data set of data. This is a core feature of distributed computing and intelligent agent development.",
	"Data Mapping - Data mapping is the process of creating data element mappings between two distinct data models. Data mapping is the first step in creating a data transformation between a data source and a destination. For example, a company that would like to transmit and receive purchases and invoices with other companies might use data mapping to create data maps from a company's data to standardized ANSI ASC X12 messages for items such as purchase orders and invoices.",
	"Data Migration - Data migration refers to the translation of data between storage types, formats, or computer systems. Data migration is necessary when an organization decides to use a new computing systems or database management system that is incompatible with the current system. Data migration is usually performed programatically to achieve an automated migration, freeing up human resources from tedious tasks. It is required when organizations or individuals change computer systems or upgrade to new systems.",
	"Data Modeling - Data modeling is the process of structuring and organizing data. It defines a structure for data that is typically implemented in a database management system and that enables (and limits) to enter data in that structure. Data modeling is often the first step in database design and object-oriented programming as the designers first create a conceptual model of how data items relate to each other. Data modeling involves a progression from conceptual model to logical model to physical schema.",
	"Data Processing - Data processing is a computer process that converts data into required information. The processing is usually assumed to be automated and running on a computer. There are many data processing applications, such as accounting programs that convert raw financial data into meaninful reports for various purpose. Another example is customer relationship management systems (CRM) and employee relationship data systems.",
	"Data Scrubbing - Data scubbing, also called as data cleaning, is the process of detecting and removing and/or correcting a database to increase data accuracy, reduce redundancy and enhance consistency of different sets of data that have been merged from separate databases. Sophisticated software applications are available to clean a database data using algorithms, rules and look-up tables, a task that was once done manually and therefore still subject to human error.",
	"Data Structure - Data structure is the pattern to store data in a computer so that it can be used efficiently. Often a carefully chosen data structure will allow a more efficient algorithm to be used. The choice of the data structure often begins from the choice of an abstract data structure. A well-designed data structure allows a variety of critical operations to be performed, using as few resources, both execution time and memory space, as possible. Data structures are implemented using the data types, references and operations on them provided by a programming language.",
	"Data Transformation - Data transformation converts data from a source data format into destination data. Data transformation can be divided into two steps: 1) data mapping maps data elements from the source to the destination and captures any transformation that must occur; 2) code generation that creates the actual transformation program.",
	"Database Administration - Database administration refers to duties, typically performed by a DBA in an organization, such as disaster recovery (backups and testing of backups), performance analysis and tuning, and some database design or assistance thereof.",
	"Database Model - A database model is a theory or algorithm describing how a database is structured and used. Several such models have been suggested, for example, Hierarchical model, Network model, Relational model, Object-Relational model, Object model, Associative, Concept-oriented, Entity-Attribute-Value, Multi-dimensional model, Semi-structured, and Star schema.",
	"Database Normalization - Databases normalization is a process that eliminates redundancy, organizes data efficiently, reduces the potential for anomalies during data operations and improves data consistency. The formal classifications used for quantifying \"how normalized\" a relational database is are called normal forms. A non-normalized database is vulnerable to data anomalies because it stores data redundantly. If data is stored in two locations, but later is updated in only one of the locations, then the data is inconsistent; this is referred to as an \"update anomaly\". A normalized database stores non-primary key data in only one location.",
	"Database Object - Database Object is a piece of information or record that is stored in a database.",
	"Database Query Language - Database query language is a kind of programming language to retrieve information from a database. The person formulating the query is expected to understand the relevant rules for formulating the query, and to program the query according to the requirements. Examples of the database query language are the CODASYL database language, \"network\" databases, relational algebra, relational calculus, Datalog, SQL3, QUEL, XPointer, XPath and OQL.",
	"Database Server - A database server is a computer program that provides database services to other computer programs or computers, as defined by the client-server model. The term may also refer to a computer dedicated to running such a program. Database management systems frequently provide database server functionality, and some DBMS's (e.g., MySQL) rely exclusively on the client-server model for database access.",
	"Datalog - Datalog is a query and rule language for deductive databases that syntactically is a subset of Prolog. Query evaluation with Datalog is sound and complete and can be done efficiently even for large databases. Query evaluation is usually done using bottom up strategies. For restricted forms of datalog that don't allow any function symbols, safety of query evaluation is guaranteed.",
	"Dating Software - Dating software refers to software that powers a dating website. This software runs on the server (computer) that hosts the dating website.",
	"DB/DC: Database/Data Communications - Database/Data Communications (DB/DC) refers to the software system that has both database and communications capabilities.",
	"DB: Database - Database(DB) is a collection of organized information and data. In computer industry, database is an electronic filing system. Various techniques are used to model data structure. Most database systems are built around one particular data model, although it is increasingly common for products to offer support for more than one model. Traditional databases are organized by fields, records, and files. A field is a single piece of information; a record is one complete set of fields; and a file is a collection of records.",
	"DB2: DataBase 2 - DB2, abbreviated from DataBase 2, is a relational database system developed by IBM Corporation, originally for use on large mainframe computer systems. It has since been ported to a variety of platforms including SunOS, Solaris, Linux, Windows 95/98/NT/2000 and HP-UX. DB2 can be administered from either the command-line or a GUI. DB2 has APIs for .NET CLI, Java, Python, Perl, PHP, Ruby on Rails, C++, C, REXX, PL/I, COBOL, RPG, FORTRAN, and many other programming languages. DB2 also supports integration into the Eclipse and Visual Studio .NET integrated development environments.",
	"DBA: Database Administrator - A database administrator (DBA) is a person who is responsible for the environmental aspects of a database. The duties of a database administrator varies depending on job description, corporate and Information Technology (IT) policies and the technical features and capabilities of the database management systems (DBMSs) being administered. They nearly always include disaster recovery (backups and testing of backups), performance analysis and tuning, and some database design or assistance thereof.",
	"DBase - DBase is a commercial relational database management system intruduced first by Ashton-Tate corporation in the early 1980s and now belongs to the dBase Corporation. DBASE was never able to make transition successfully to Microsoft Windows and was eventually displaced by newer products like Paradox, Clipper, FoxPro, and Microsoft Access.",
	"DBCS: Double-Byte Character Set - Double-Byte Character Set (DBCS) is a type of character encoding scheme which uses 16-bits (two-bytes) rather than 8-bits (one-bytes) characters. Using double-byte characters expands the possible number of combinations of 1s and 0s from 256 (as in ASCII) to 65,536 (or 256 x 256). Double-byte character sets are needed for such languages as Japanese, Chinese, and Korean. DBCS has different flavors, for example, double byte for ALL characters (including control character), or double byte only for image characters.",
	"DBI: DataBase Interface for Perl - The DBI (DataBase Interface) is the standard database interface module for Perl programming language. It defines a set of methods, variables and conventions that provide a consistent database interface independent of the actual database being used. The DBI and DBD Perl packages allow Perl programmers to view the many database environments that are on the market in a uniform way.",
	"DBMS: Database Management Ssystem - Database management system (DBMS) is a system or software designed to manage a database, and run operations on the data requested by numerous clients. Typical examples of DBMS use include accounting, human resources and customer support systems. DBMS enables user to store, modify, and extract information from a database. There are many different types of DBMSs, ranging from small systems that run on personal computers to huge systems that run on mainframes.",
	"Dbx Debugger - Dbx is a popular, UNIX-based source-level debugger found primarily on Solaris, AIX, IRIX, and BSD UNIX systems. It provides symbolic debugging for programs written in C, C++, Pascal, and Fortran.dbx is also available on IBM z/OS systems, in the UNIX System Services component. dbx for z/OS can debug programs written in C and C++. It can also perform machine level debugging. As of z/OS V1R5, dbx is able to debug programs using the DWARF debug format. z/OS V1R6 added support for debugging 64-bit programs.",
	"DCL: Data Control Language - Data Control Language (DCL) is a computer language for controlling access to data in a database. Examples of DCL commands are GRANT and REVOKE.",
	"DCOM: Distributed Component Object Model - Distributed Component Object Model (DCOM), developed by Microsoft and previously called Network OLE, enables software components to communicate directly over a network. DCOM is designed for use across multiple network transports, including such Internet protocols as HTTP.",
	"DDD: Data Display Debugger - Data Display Debugger (DDD) is a popular graphical user interface for command-line debuggers such as GDB, DBX, JDB, WDB, XDB, the Perl debugger, and the Python debugger.DDD is licensed under the GNU GPL and is open source.",
	"DDL: Data Definition Language - Data Definition Language(DDL) is a computer language for defining data. XML Schema is an example of a pure DDL (although only relevant in the context of XML). A subset of SQL's instructions forms another DDL.",
	"DDMS: Distributed Database Management System - Distributed database management system (DDMS) is a software system that permits the management of the distributed database and makes the distribution transparent to the users. Distributed database is a collection of multiple, logically interrelated databases distributed over a computer network. Sometimes distributed database system is used to refer jointly to the distributed database and the distributed Database Management System(DBMS). Distributed database management systems can be architected as client-server systems or peer-to-peer ones. In the former, one or more servers manage the database and handle user queries that are passed on by the clients. The clients usually have limited database functionality and normally pass the SQL queries over to the servers for processing. In peer-to-peer systems, each site has equal functionality for processing.",
	"DDT: Dynamic Debugging Technique - Dynamic Debugging Technique (DDT) was the name of several debugger programs originally developed for DEC hardware, originally known as DEC Debugging Tape because it was distributed on paper tape. The first version of DDT was developed at MIT for the PDP-1 computer in 1961, but newer versions on newer platforms continued to use the same name.",
	"Dead Code - In computer programming, dead code, also known as unreachable code, typically consists of blocks of programming instructions or entire routines that will never be accessed because all calls to them have been removed, or code that cannot be reached for some reason. Dead code is undesirable for a number of reasons, but primarily because it suggests that there is a fault in the software. Detecting dead code is a form of static analysis and involves performing control flow analysis to find any code that will never be executed regardless of the values of variables and other conditions at runtime.",
	"Dead code Elimination - Dead code elimination is a compiler optimization technique used to reduce program size by removing code which can never be executed (known as dead or unreachable code).",
	"Debug Monitor - Debug monitor is a piece of software that has been designed specifically for use as a debugging tool for processors and chips. The debug monitor provides a set of primitive commands to view and modify memory locations and registers, create and remove breakpoints, and execute your program. A remote debugger with knowledge of the command format communicates with the debug monitor and combines these primitives to fulfill higher-level requests like program download and single-step.",
	"Debugger - Debugger is a computer program that is used to debug other programs. Sometimes, a debugger may also include testing and optimizing functions. For example, when the program crashes, the debugger shows the position in the original code if it is a source-level debugger or symbolic debugger, commonly seen in integrated development environments. If it is a low-level debugger or a machine-language debugger, it shows the line in the disassembly.",
	"Decompiler - A decompiler is a computer program that translates executable programs (the output from a compiler) into an equivalent (relatively) high level language (source code). By comparison, a disassembler translates an executable program into assembly language.",
	"Deflate Algorithm - Deflate Algorithm is a lossless data compression algorithm that uses a combination of the LZ77 algorithm and Huffman coding. It was originally defined by Phil Katz for version 2 of his PKZIP archiving tool, and was later specified in RFC 1951. Deflate is used in gzip compressed files and PNG image files, in addition to the ZIP file format for which Katz originally designed it. Source code for Deflate compression and decompression can be found in zlib, the freely available, general-purpose compression library.",
	"Defragment - Defragment is a process often required in a computer system to reorganize the disk by putting files into contiguous order. Because the operating system stores new data in whatever free space is available, data files become spread out across the disk as they are updated. Large files may be broken into many fragments, which will slow down the read/write of hard disks. A deframentation software rewrites all the files and stores them in adjacent sectors.",
	"Dehardwarization - Dehardwarization refers to the trend in design of new computer hardware which tends to eliminate as many hardware components as possible and supplanting their functionality with software. An example of dehardwarized devices include softmodems and many AC'97 based audio cards.",
	"Delphi - Delphi is a programming language and Integrated Development Environment (IDE). It is produced by Borland (known for a time as Inprise). The Delphi language, formerly known as Object Pascal (Pascal with object-oriented extensions) originally targeted only Microsoft Windows, but now builds native applications for Linux and the Microsoft .NET framework as well.",
	"Demo: Demostration Version - Demo version, or demostration version, of software is a free or low-priced sample of a program. Demo programs are often with some features disabled or time limitations. It is intended to give the user enough of a taste to want to buy the full version program.",
	"Demoware - Demoware is commercial software released by way of a free download with limitations, that is intended to give the user enough of a taste to want to buy the full version program. Demoware usually is limited in one (or more) of the following ways:\nRemains functional for a set number of days from installation.\nMay only be launched for a set number of times.\nAdds identifying marks to the output. Common with image and video editing demoware.\nIs limited to a set number of \"days of use\" (i.e. only days you actually use the program count toward its trial limit)\nProgram execution terminates after a set time period (typically between 5 and 60 minutes).\nLimited number of times that an important function may be used\n",
	"Remains functional for a set number of days from installation.",
	"May only be launched for a set number of times.",
	"Adds identifying marks to the output. Common with image and video editing demoware.",
	"Is limited to a set number of \"days of use\" (i.e. only days you actually use the program count toward its trial limit)",
	"Program execution terminates after a set time period (typically between 5 and 60 minutes).",
	"Limited number of times that an important function may be used",
	"Deprecated Software - Deprecated software, also called deprecation, refers to a software or a function inside a software package that is considered obsolete and on its way out, usually in favor of something better. The software or feature still works in the current version, although it may raise alert messages as warnings. These serve to alert the user to the fact that the feature may be removed in future releases, and slowly support for the program is phased out.",
	"Der Dirigent - Der Dirigent is a free (licensed under the GNU General Public License), open source content management system written with PHP and MySQL. It offers full flexibility and extendability while featuring an accomplished set of ready-made interfaces, functions and modules. \"Der Dirigent\" has two operating modes: a so-called \"Frontend\" which presents \"Der Dirigent\" based website to its users and a \"Backend\" used by authors and site admins to manage content for the website. After the simple Installation, you need no ftp program. You can do everything in the browser, even the online editing of Cascading Style Sheet or JavaScript.",
	"Design Compiler - Design Compiler is a product of Synopsys that compiles and optimises (in terms of silicon area and maximum clock frequency) high-level electronic circuit descriptions specified by restricted sub-languages of either Verilog or VHDL, into a gate-level netlist representation of a circuit. This procedure is an example of logic synthesis.",
	"DeskScan - DeskScan is Hewlett-Packard software used in conjunction with a scanner. Using DeskScan, pictures or documents can be scanned into the computer (turned into digital files), edited, and placed in one of the right formats to be posted on a Web page or inserted into PowerPoint presentations.",
	"DesktopBSD - DesktopBSD is a UNIX-like, desktop-oriented operating system based on FreeBSD. Its goal is to combine the stability of FreeBSD with the ease-of-use of K Desktop Environment (KDE), which is the default graphical user interface.",
	"Dev-C++ - Dev-C++ is a free Integrated Development Environment(IDE) for programming use in C and its derivative, C++. Dev-C++ is bundled with the open source MinGW compiler utilizing gcc and its C++ counterpart, g++. Dev-C++ is distributed under the GNU General Public License. The Dev-C++ IDE is written in Delphi and/or its Linux port of Kylix.",
	"Device Driver - Device driver, or a software driver, is a specific type of computer software, developed to allow interaction between the computer and hardware devices. Each device driver is typically a piece of operating system-specific as well as hardware-dependent software that makes it possible for application software to attach to, read and write data from, and change the behavior of the peripheral device.  Typically this constitutes an interface for communicating with the device, through the specific computer bus or communications subsystem that the hardware is connected to, providing commands to and/or receiving data from the device, and on the other end, the requisite interfaces to the operating system and software applications. Device driver enables another program, typically an operating system or applications software package or computer program running under the operating system kernel, to interact transparently with a hardware device, and usually provides the requisite interrupt handling necessary for any necessary asynchronous time-dependent hardware interfacing needs.",
	"DGCA - In computing, DGCA is a freeware compression utility created in 2001 by Shin-ichi Tsuruta. DGCA is also a compressed archive format, the next generation of 'GCA'. DGCA has higher compression than ZIP, Strong Password, Unicode Filename. However, DGCA is not a major compression format.",
	"DIB: Device-Independent Bitmap - Device-Independent Bitmap (DIB), also kown as Bitmap (BMP), is the graphics format supported by Windows and some other OS. The graphic files in DIB format are generally end with a .bmp extension. DIB images can also be transferred in metafiles and the clipboard. It's called device-independent because colors are represented in a format independent of the final output device. When a DIB image is output to a specific device, the device driver translates the DIB colors into actual colors that the output device can display. For example, to display bitmap graphs on screen, Device Dependent Bitmap (DDB) must be used.",
	"Digial pen - Digital pen is an electronic writing instrument that allows the user to digitally capture a handwritten note or drawing. Typically, digital pen is connected with a computer using a Universal Serial Bus (USB) cradle to let the user upload the handwritten notes for processing and storage. The pen looks like a regular ball-point pen and can be used as such, but requires special digital paper if the user wishes to digitally capture what he has written.",
	"Digital Paper - Digital paper is patterned paper used in conjunction with a digital pen to create handwritten digital documents. The proprietary printed dot pattern uniquely identifies the position coordinates on the paper. The digital pen uses this pattern to store the handwriting and upload it to a computer.",
	"Digital Wallet - Digital wallet, also known as e-wallet, is a system designed for electronic commerce transactions over the Internet quickly and securely. A digital wallet can hold a user's payment information encrypted, a digital certificate to identify the user, and shipping information to speed transactions. The consumer benefits because their information is encrypted and safe, no retyping required when conduct e-commerce online from different vendors, and payment in digital cash or check. Merchants benefit by receiving protection against fraud. Paypal is an example of such digital wallet system.",
	"DirectX - DirectX, provided by Microsoft, is a suite of multimedia application programming interfaces (APIs) built into Microsoft Windows OS. DirectX provides a standard development platform for Windows-based PCs by enabling software developers to access specialized hardware features without having to write hardware-specific code. The DirectX APIs give multimedia applications access to the advanced features of high-performance hardware such as three-dimensional (3-D) graphics acceleration chips and sound cards. They control low-level functions, including two-dimensional (2-D) graphics acceleration; support for input devices such as joysticks, keyboards, and mice; and control of sound mixing and sound output. Because of DirectX, what you experience with your computer is better 3-D graphics and immersive music and audio effects.",
	"Disassembly - Disassembly is the process of taking a binary program and deriving the source code from it.",
	"Disassembler - A disassembler is a computer program which translates machine language to assembly language. It therefore performs the inverse operation to an assembler. However, the output of a disassembler is often designed for human-readability rather than suitability for input to an assembler (called disassembly). By comparison, a decompiler translates machine language into a high level language.",
	"Distcc - Distcc is a computer program that distributes processes of compiling C and its derivatives like C++ and Objective C source code over a computer network. With the right configuration, the program can dramatically reduce compilation time.",
	"Distiller - Distiller is a software program from Adobe which converts postscript files to portable document format (.pdf) files. Postscript files have special coding which instruct the printer how to print the document.",
	"Distributed Computing - Distributed computing may mean different things in different situation. It may refer to the use of multiple computers in an organization rather than one centralized system. This use of the term was popular in the 1970s. It may also mean the use of multiple computers networked throughout a wide geographical area to solve a single problem.",
	"Distributed Database - A distributed database is a database that is under the control of a central database management system (DBMS) in which storage devices are not all attached to a common CPU. It may be stored in multiple computers located in the same physical location, or may be dispersed over a network of interconnected computers. Because the database is distributed, different users can access it without interfering with one another. However, the DBMS must periodically synchronize the scattered databases to make sure that they all have consistent data.",
	"Distribution Software - Distribution software is a software system that helps companies to manage internal and external resources. Distribution software manages everything from order processing and inventory control to accounting, purchasing and customer service, supply chain management, sales, CRM, inventory, warehouse and finance management.",
	"DJGPP - DJGPP is a 32-bit C/C++ development system for 386 PCs and PC compatibles running MS-DOS, developed by DJ Delorie in 1989. It is a software port of the popular gcc compiler, as well as many other GNU development utilities, to DOS Protected Mode Interface(DPMI).",
	"DKBTrace - DKBTrace was a graphical ray tracing program which was the forerunner of POV-Ray. It had no GUI and ran via the command line. It featured quadric shapes (spheres, ellipsoids, planes, etc), constructive solid geometry (intersection, difference, union), and procedural textures like wood and marble. It was written for UNIX by David K. Buck (1986) and Aaron Collins. The last version (DKBTrace 2.12) was built in 1989.",
	"DLL Hell - DLL hell is a phrase used to describe the complications which arise when working with dynamic link libraries (DLLs). DLL Hell encompasses the difficulties of managing dynamic-link libraries (DLLs) in Microsoft Windows operating systems, such as conflicts between DLL versions, difficulty in obtaining required DLLs, and having many unnecessary DLL copies. DLL Hell is an example of a latent operating system design flaw — that is, problems occur in well-written programs because of bad programming practice or a bug in poorly-written software that is tolerated by the operating system. The paradigm of a latent operating system flaw is time slice multiplexing in Microsoft operating systems pre-dating OS2 and Windows NT. With time slicing, a rogue or buggy program can effectively disable the entire computer, forcing the user to hard boot the machine.",
	"DLL: Dynamic-Link Library - Dynamic-link library (DLL) is Microsoft's implementation of the shared library concept in the Microsoft Windows operating systems. These libraries usually have the file extension DLL, OCX (for libraries containing ActiveX controls), or DRV (for legacy system drivers). The file formats for DLLs are the same as for Windows EXE files that is, Portable Executable (PE) for 32-bit Windows, and New Executable (NE) for 16-bit Windows. DLLs can contain code, data, and resources, in any combination. DLL is files containing groups of often-used computer code which can be shared amongst many programs. This has several advantages: programmers who use library code do not need to keep reinventing the wheel; programs which invoke library code do not each need to include a copy of that code, making their files smaller; updates to library code can be applied in one place, rather than in many programs.",
	"DM: Data Mart - Data mart (DM) is a specialized version of a data warehouse (DW). Whereas a data warehouse combines databases across an entire enterprise, data marts are usually smaller and focus on a particular subject or department. Data marts contain a snapshot of operational data that helps business people to strategize, based on analyses of past trends and experiences. Since a data mart configuration emphasizes easy access to relevant information, the star schema or dimensional model is a fairly popular design choice, as it enables a relational database to emulate the analytical functionality of a multi-dimensional database.",
	"DM: Data Mining - Data mining (DM), also known as Knowledge-Discovery in Databases (KDD) or Knowledge-Discovery and Data Mining (KDD), is the process of automatically searching large volumes of data for patterns. Data mining uses automated data analysis techniques to uncover previously undetected relationships among data items. Data mining often involves the analysis of data stored in a data warehouse. Three of the major data mining techniques are regression, classification and clustering.",
	"DML: Data Manipulation Language - Data Manipulation Language (DML) is a family of computer languages used by computer programs or database users to retrieve, insert, delete and update data in a database. The currently most popular Data manipulation language is that of SQL, which is used to retrieve and manipulate data in a Relational database. Other forms of DML are those used by IMS/DL1, CODASYL databases (such as IDMS), and others.",
	"DMX: Data Mining Extensions - Data Mining Extensions (DMX) is a query language for Data Mining Models, much like that SQL is a query language for relational databases and MDX is a query language for OLAP databases. DMX syntax is more similar to SQL than MDX.",
	"Doc-O-Matic - Doc-O-Matic is a commercial automatic documentation generator that creates fully cross linked documentation systems, including both Source Code Documentation, Online Help and User Manuals in PDF, browser-based Help, HTML Help, MS Help 2, Windows Help, RTF and XML. Doc-O-Matic supports all major project file formats as well as the following programming languages: C/C++, C++/CLI, C#, Delphi, Java, IDL, VB.NET, JavaScript, MATLAB, ASP.NET, JSP.",
	"Document! X - Document! X is a documentation generator which automates technical documentation production for VB6/VBA source code, C#/VB.NET/C++ or other .NET language assemblies, databases, COM components, type libraries and XSD schemas. Document! X consists of an authoring and documentation built environment (including HTML based Visual Authoring tools) as well as Visual Comment Editor Add-Ins for Visual Basic, VBA and Visual Studio .NET."
]
