[
	"Spiral Model - The spiral model is a software development process combining elements of both design and prototyping-in-stages, in an effort to combine advantages of top-down and bottom-up concepts. Spiral model uses the waterfall model for each step, with the aim of managing risk. In the spiral model, developers define and implement features in order of decreasing priority.",
	"SPOF: Single Point of Failure - Single point of failure(SPOF) is a generic phrase for any component of a system that upon failure will cause a malfunction in the entire system. A SPOF can be a hardware or electrical component or a software component. This can be as simple as a process failure or as catastrophic as a computer system crash.",
	"Spreadsheet - Spreadsheet typically refers to a table of values arranged in rows and columns. Each value can have a predefined relationship to the other values. If you change one value, therefore, you may need to change other values as well. There are many spreadsheet applications available that enable users to create and operate the data in the table efficiently.",
	"Spreadsheet Applications - Spreadsheet applications, sometimes simply referred to as spreadsheets, are computer programs that enable user to create and manipulate spreadsheets electronically. In a spreadsheet application, each value sits in a cell. Different data types can be assigned to each cell and how different cells depend on one another. The relationships between cells are called formulas, and the names of the cells are called labels.",
	"Sproc: Stored Procedure - Stored procedure, also known as sproc, is a SQL program which is physically stored within a database and executed by calling it directly from the client or from a database trigger. The exact implementation of a stored procedure varies from one database to another. In most cases however, stored procedures allow for an API to be defined for a database, rather than having a client application interact with the tables and other database objects directly. When the SQL procedure is stored in the database, it does not have to be replicated in each client. This saves programming effort especially when different client user interfaces and development systems are used. Triggers and stored procedures are built into DBMSs used in client/server environments.",
	"SQL: Structured Query Language - Structured query language(SQL) is an ANSI/ISO standardized query language used to create, modify, retrieve and manipulate data from relational database management systems. The original version called SEQUEL (structured English query language) was designed by an IBM research center in 1974 and 1975. SQL was first introduced as a commercial database system in 1979 by Oracle Corporation.",
	"SQLite - SQLite, a public domain project, is an ACID-compliant relational database management system contained in a relatively small C library. Unlike the usual client-server paradigm, the SQLite engine is not a standalone process with which the program communicates, but is linked in and thus becomes an integral part of the program. Therefore, the primary communication protocol is direct API calls within the programming language. This can have a positive impact on the amount of overhead, latency time and overall simplicity.",
	"Squeez Utility - Squeez is a shareware file archiver and data compression utility by Speedproject. It supports 13 different compression algorithms. The software reads and writes files in the formats ZIP, RAR, SQX, ACE, ARJ, BZIP, GZIP, LZH, TAR, UUE, JAR, CAB and 7z.",
	"Squish of FidoNet - Squish is both the name of a FidoNet mail tossing application originally designed for DOS and OS/2, and the name of the primary mail storage format in which this application stores FidoNet and other local BBS messages. Before Squish, open storage formats for FidoNet and Bulletin Board messages were relatively slow and inefficient.",
	"SR: Service Release - Service Release (SR) refers to a special software release including service packs (SP) and the original product.",
	"Srvany - Srvany is a Microsoft Windows 2000/2003/XP Server Resource Kit utility that can be used to enable applications to run as services.",
	"SSA: Static Single Assignment Form - Static single assignment form (SSA form or SSA) is an intermediate representation (IR) in which every variable is assigned exactly once. Existing variables in the original IR are split into versions, new variables typically indicated by the original name with a subscript, so that every definition gets its own version. In SSA form, use-def chains are explicit and each contains a single element.",
	"SSADM: Structured Systems Analysis and Design Method - Structured Systems Analysis and Design Method (SSADM) is a system approach to the analysis and design of information systems. SSADM was produced for the CCTA, a UK government office concerned with the use of technology in government, from 1980 onwards. The names of \"Structured Systems Analysis and Design Method\" and \"SSADM\" are now Registered Trade Marks of the Office of Government Commerce (OGC), which is an Office of the United Kingdom's Treasury. SSADM is a waterfall method by which an IS design can be arrived at; SSADM can be thought to represent a pinnacle of the rigorous document-led approach to system design, and contrastswith more contemporary Rapid Application Development methods such as DSDM.",
	"Stack of Data Structure - In computer science, a stack is a temporary abstract data type and data structure based on the principle of Last In First Out (LIFO). Stacks are used extensively at every level of a modern computer system. For example, a modern PC uses stacks at the architecture level, which are used to run an operating system. The operating system also uses stacks, which are used to run a Java Virtual Machine, which is stack oriented, and the Java language itself has a class called \"Stack\", which can be used by the programmer. The stack is ubiquitous.",
	"Startup Code - Startup code refers to a piece of assembly language code that prepares the way for software written in a high-level language. Startup code usually initializes code and data segments, safes I/O, and sets up chip selects and wait states. Most cross-compilers come with startup code that a user can modify, compile, and link with embedded programs.",
	"Static Class - Static class is a concept in C# programming. Static classes and class members are used to create data and functions that can be accessed without creating an instance of the class. Static class members can be used to separate data and behavior that is independent of any object identity: the data and functions do not change regardless of what happens to the object. Static classes can be used when there is no data or behavior in the class that depends on object identity.",
	"Static Code Analysis - Static code analysis is a set of methods for analysing software source code or object code in an effort to gain understanding of what the software does and establish certain correctness criteria. The term is usually applied to the analysis performed by an automated tool, with human analysis being called program understanding or program comprehension.",
	"Static Library - In computer science, a static library, also referred to as a statically linked library, is a computer library in which links are resolved at compile-time by a linker. Static libraries may be merged with other libraries and executables to form a single object file, or they may be loaded at runtime into the address space of the linking executable or library, at a static memory offset determined at link-time.",
	"STL: Standard Template Library - The Standard Template Library (STL) is a C++ library of container classes, algorithms, and iterators; it provides many of the basic algorithms and data structures of computer science. The STL is a generic library, meaning that its components are heavily parameterized: almost every component in the STL is a template. STL was developed by Alexander Stepanov and Meng Lee at Hewlett-Packard. It is based on their research in the field of generic programming.",
	"Strength Reduction - Strength reduction is a compiler optimization where a function of some systematically changing variable is calculated more efficiently by using previous values of the function. In a procedural programming language this would apply to an expression involving a loop variable and in a declarative language it would apply to the argument of a recursive function.",
	"String Intern Pool - In some modern programming languages, including Java and C#, the string intern pool is a data structure managed internally by the platform or virtual machine to facilitate efficient implementation of certain string processing tasks. The pool contains a single copy (called the intern) of each distinct string that is currently represented by a string object in the system. By invoking a method of the string class (for example String.intern() in Java), the programmer has access to this unique string object.",
	"Structured Analysis - Structured analysis is one of requirements analysis methods used in software engineering. Structure analysis includes a few approaches: 1) Data Flow Diagrams to show information flow and processing in a system. 2) Structure Charts show module structure and calling relationships. 3) State models include diagrams and tables that show the significant states in a system, events that cause transitions between states and the actions that result. 4) Task diagrams show threads of execution and the real-time operating system services like queues, event flags and semaphores that connect them in a multi-tasking environment.",
	"Structured Design - Structured design is one of systematic top-down design techniques used in software engineering, usually after structured analysis. The goal of structured design is to produce design specifcations of a system, based on the system requirements generated from the structured analysis.",
	"Structured Programming - Structured programming refers to a software development technique that includes structured analysis and design and results in the development of a structured program. Structured programming can be seen as a subset or subdiscipline of procedural programming, one of the major programming paradigms.",
	"StuffIt Expander - StuffIt Expander, published by Aladdin Systems, is program for the Macintosh used to decompress files after downloading and makes them usable by your computer. StuffIt Expander is similar to an unzipping program in a PC.",
	"Subversion - Subversion is an open source application used for revision control. It is sometimes abbreviated to svn in reference to the name of its command line interface. Subversion is designed specifically to be a modern replacement for Concurrent Versions System (CVS) and shares a number of the same key developers.",
	"Subweb - Subweb, a term introduced by Microsoft, refers to certain portion of a website that has special style and restrictions when access. There is a feature within FrontPage that allows a section (contained within a folder, or directory) to be converted into a website in its own right. It is not seen as another site by the server, however, and so is known as a \"subweb\" of the current website. If you have the parent web open in FrontPage and click to go into the subweb, FrontPage opens it in a new window, strengthening the impression that you are dealing with a separate entity. In the new window, you can treat the subweb as though it was a separate website with its own theme, etc..",
	"SuperCollider Programming Language - SuperCollider, released in 2002 by its author, James McCartney, under the free software GPL license, is a real time audio synthesis programming language. Since then it has been evolving into a system used and further developed by both scientists and artists working with sound. It is an efficient and expressive dynamic programming language which makes it an interesting framework for acoustic research, algorithmic music and interactive programming.",
	"SVK - SVK is a decentralized version control system written in Perl, with a design comparable to BitKeeper and GNU arch. The primary author of svk is Chia-liang Kao, and it is distributed under Perl's Artistic License as well as GPL.",
	"Sweep Software - Sweep is an open source, multiplatform digital audio editor and live playback tool for GNU/Linux, BSD and compatible systems. It is able to handle many sound formats, including MP3, WAV and Vorbis. The most notable feature of Sweep is its stylus-like cursor tool called Scrubby.The program is licensed under the GPL and it is included in most modern Linux distributions.",
	"Sybase SQL Server - Sybase SQL Server, a relational database management system of Sybase Corporation, was originally created for UNIX platforms in 1987. In 1988, SQL Server for OS/2 was co-developed for the PC by Sybase, Microsoft, and Ashton-Tate. In 1995, Sybase released SQL Server 11.",
	"Symbolic Inference - Symbolic inference refers to the derivation of new facts from known facts and inference rules. This is one of the fundamental operations of artificial intelligence and logic programming languages like Prolog.",
	"Syntax - Syntax, in computer science, refers to the spelling and grammar of a programming language. Computers are inflexible machines that understand what you type only if you type it in the exact form or sytax that the computer expects. Each program defines its own syntactical rules that control which words the computer understands, which combinations of words are meaningful, and what punctuation is necessary. The analysis of a program's syntax is usually performed using an automatically generated program known as a parser which often builds an abstract syntax tree.",
	"Sysadmin: System Administrator - A system administrator, or sysadmin, is a person employed to maintain and operate a computer system or network for a company or other organization. System administrators are often members of an information technology department.",
	"System Call - System call is the mechanism used by an application program to request service from the operating system or more specifically, the operating system kernel. System calls often use a special CPU instruction which causes the processor to transfer control to more privileged code, as previously specified by the more privileged code. This allows the more privileged code to specify where it will be entered as well as important processor state at the time of entry. When the system call is invoked, the program which invoked it is interrupted, and information needed to continue its execution later is saved. The processor then begins executing the higher privileged code, which, by examining processor state set by the less privileged code and/or its stack, determines what is being requested. When it is finished, it returns to the program, restoring the saved state, and the program continues executing.",
	"System Integrator - System integrator is a person or company that specializes in integrating systems. System integrators may work in many fields. In Information Technology (IT), system integrators integrate multiple systems for inputting, processing, interpreting, storing, and categorizing data. For example, a system integrator may build an IT solution integrating an Oracle based inventory tracking system, an OnBase document management system, a Microsoft CRM system, a group of Panasonic scanners, and a Rimage storage system to produce an overall solution for the customer.",
	"System Resource - System Resource refers to the tools, typically part of an OS, used by either hardware or software to communicate with each other, for example, to alert software of a need or by software to control a function of hardware. In the Windows operating system, there are two kinds system resources: User Resources, and GDI (Graphic Device Interface) Resources. The User component manages input from the keyboard, mouse, and other input devices and output to the user interface (windows, icons, menus, and so on). It also manages interaction with the sound driver, timer, and communications ports. The Graphics Device Interface (GDI) is the graphical system that manages what appears on the screen. It also provides graphics support for printers and other output devices. It draws graphic primitives, manipulates bitmaps, and interacts with device-independent graphics drivers, including those for display and printer output device drivers.",
	"System Software - System software, also known as system program, is a type of software which includes the operating system and all utility programs that manage computer resources at a low level. System programs include operating systems, database managers, drivers, communications and messaging protocols, basic input/output system, compilers, loaders, linkers, and debuggers, etc.",
	"Systems Administration - Systems administration refers to the duties of installing, supporting, and maintaining servers or other computer systems, and planning for and responding to service outages and other problems. Other duties may include scripting or light programming, project management for systems-related projects, supervising or training computer operators, and being the equivalent of a handyman for computer problems beyond the knowledge of technical support staff.",
	"Systems Analysis - Systems analysis is the process of analysis of complex, large scale systems and the interactions within those systems. It involves the investigation of a business activity or clerical procedure, with a view to deciding if and how it can be computerized. The analyst discusses the existing procedures with the people involved, observes the flow of data through the business, and draws up an outline specification of the required computer system. The next step is systems design. Typically, an automated tool is used to facilitate the systems analysis. Tools in use for this purpose include Yourdon, SSADM (Structured Systems Analysis and Design Methodology), and Soft Systems Methodology.",
	"Systems Management - Systems management refers to enterprise-wide administration of distributed computer systems. System management software that manages computer systems in an enterprise may include any and all of the following functions: software distribution and upgrading, user profile management, version control, backup & recovery, printer spooling, job scheduling, virus protection and performance and capacity planning. Microsoft's Systems Management Server and Novell's ZENworks are examples of systems management applications. Depending on organizational philosophy, systems management may include network management or come under it. The most known systems management systems are IBM Tivoli Framework, Microsoft Systems Management Server, HP OpenView, LANDesk, Novell ZENworks and CA Unicenter.",
	"Systems Program - System program, also known as system software, is a type of software which includes the operating system and all utility programs that manage computer resources at a low level. System programs include operating systems, database managers, drivers, communications and messaging protocols, basic input/output system, compilers, loaders, linkers, and debuggers, etc.",
	"Systems Programmer - Systems programmer may refer to two types of jobs in an oganization: 1) a person who writes system programs, or 2) a person who oversees the computer systems and is responsible for the installation and integration of new hardware and software.",
	"Tag - A tag, in computer programming, refers to a command inserted in a document that specifies how the document, or a portion of the document, should be formatted. Tags are used by all format specifications that store documents as text files. This includes SGML and HTML. It may also refers to mark a section of a document with a formatting command.",
	"Tape Library - Tape library, also known as tape automation system, is a data storage system for storing, retrieving, reading and writing multiple magnetic tape cartridges. It contains storage racks for holding the cartridges and a robotic mechanism for moving the cartridge to the drive. Smaller units can have several drives for simultaneous reading and writing and may hold from a handful to several hundred cartridges. Large units support dozens of drives and hold several thousand cartridges.",
	"Task Scheduling - Task scheduling refers to the assignment of start and end times to a set of tasks. Task scheduling may subject to certain constraints, such as time constraints or resource constraints.",
	"TASM: Turbo Assembler - The Turbo Assembler (TASM), mainly PC-targeted assembler package, was Borland's offering in the x86 assembler programming tool market. The Turbo Assembler package came bundled with the linker Turbo Linker, and was interoperable with the Turbo Debugger debugger. For compatibility with the common Microsoft Macro Assembler (MASM), TASM was able to assemble such source code files via its MASM mode. Turbo Assember is no longer maintained.",
	"Telegard - Telegard is an early bulletin board system (BBS) software program written for IBM PC-compatible computers running MS-DOS. Telegard was written in Pascal, based on an unauthorized copy of the WWIV source code, and released in 1986, making it one of the earlier BBS packages for that platform.Presently Telegard is best known as the predecessor of Renegade, one of the most popular BBS software packages written.",
	"Telelogic SYNERGY - Telelogic SYNERGY, formerly known as Continuus/CM, is a software tool for revision control (configuration management, SCM etc) of source code and other software development assets.",
	"TenDRA Compiler - The TenDRA Compiler is a C/C++ compiler for POSIX compatible operating systems available under the terms of the BSD license. TenDRA uses the Architecture Neutral Distribution Format (ANDF), a specification created by the Open Group, as its intermediate language. It was originally developed by the Defense Evaluation and Research Agency (DERA) in the United Kingdom.",
	"Terragen - Terragen is a freeware scenery generator program for Microsoft Windows and Apple Macintosh developed and published by Planetside Software. It can be used to create renderings and animations of landscapes.It is popular among amateur artists, which can be attributed to it being freeware, its intuitive interface, and its capability to create photorealistic landscapes when used skillfully.",
	"Third Generation Language - Third generation language(3GL) is a high level language designed to be easier for a human to understand, including things like named variables. Fortran, ALGOL and COBOL are early examples of this sort of language. Most \"modern\" languages (BASIC, C, C++) arethird generation. Most 3GLs support structured programming.",
	"Three Tier Architecture - Three tier architecture, in Web system and service, indicates the three layers of web architecture characterized by web client - web server - CGI-gatewayed-backend server. The backend server (for instance, a DBMS) takes parameters typically embedded in URLs and returns html pages that it constructs on the fly. Plug-Ins and Java provide other interesting Web extensional architectures.",
	"Three Tier Model - Three tier model, in client server architecture computing, refers to the framework in which the user interface, functional process logic (\"business rules\"), data storage and data access are developed and maintained as independent modules, most often on separate platforms. The term \"three-tier\" or \"three-layer\", as well as the concept of multitier architectures, seems to have originated within Rational Software.",
	"Time-Sharing - Time-sharing, in computer systems, is an operating system featured with allowing several users to run several tasks(multitasking) concurrently on one processor, or in parallel on many processors. In a system with time-sharing, multiple users could share a machine by using one user's idle time to service other users. Similarly, small slices of time spent waiting for disk, tape, or network input could be granted to other users.",
	"TinyOS - TinyOS is an open source component-based operating system and platform targeting wireless sensor networks. TinyOS is an embedded operating system, written in NesC programming language, as a set of cooperating tasks and processes. It is designed to be able to incorporate rapid innovation as well as to operate within the severe memory constraints inherent in sensor networks. It is intended to be incorporated into smartdust.",
	"Top-Down Design - Top-down design, in contrast to the bottom-up design, is one of the software design strategies. In the top-down design approach, an overview of the system is formulated, without going into detail for any part of it. Each part of the system is then refined by designing it in more details. Each new part may then be refined again, defining it in yet more details until the entire specification is detailed enough to validate the model. The top-down model is often designed with the assistance of \"dark boxes\" that make it easier to bring to fulfillment but insufficient and irrelevant in understanding the elementary mechanisms. This approach to software design probably originated at IBM, and grew out of structured programming practices.",
	"TOS: Tape Operating System - Tape Operating System (TOS) is was an IBM operating system for the System 360, used in the early days around 1965 to support the IBM 360 model 30 and similar platforms. TOS was a predecessor to IBM's Disk Operating System.",
	"TOS: The Operating System - The Operating System (TOS) was the operating system of the Atari ST range of computers. This range included the 520ST, 1040ST and the F, FM and E variations (e.g.1040STE). Later, 32-bit machines (TT, Falcon030) were developed using a new version of TOS, called MultiTOS, which was based on MiNT.",
	"Trace Scheduling - Trace scheduling is an optimization technique used in compilers for computer programs. Trace scheduling was originally developed for Very Long Instruction Word, or VLIW machines, and is a form of global code motion. It works by converting a loop to long straight-line code sequence using loop unrolling and static branch prediction. This process separates out \"unlikely\" code and add handlers for exits from trace. The goal is to have the most common case executed as a sequential set of instructions without branches.",
	"Trial Software - Trial software refers to software which consumers can try before they buy. Trial versions of software usually contain all the functionality of the regular version, but can only be used for a limited time.",
	"Trigger - Trigger, generally speaking, is the cause of an event. In a database management system (DBMS), a trigger is an SQL procedure that is executed when a record is added or deleted. It is used to maintain referential integrity in the database. A trigger may also execute a stored procedure. Triggers and stored procedures are built into DBMSs used in client/server environments.",
	"TrueSpace - trueSpace is a 3D computer graphics and animation software developed by Caligari Corporation, originally created for the Amiga Computer, and later for the Windows platform.One of the most distinctive features of TrueSpace is its interface, using mainly 3D widgets for most common editing operations.",
	"TrueType - TrueType is an outline font standard originally developed by Apple Computer in the late 1980s as a competitor to Adobe's Type 1 fonts used in PostScript. The primary strength of TrueType was originally that it offered font developers a high degree of control over precisely how their fonts are displayed, right down to particular pixels, at various font heights.",
	"TrustedBSD - The TrustedBSD project provides a set of trusted operating system extensions to the FreeBSD operating system, targeting the Common Criteria for Information Technology Security Evaluation. The main focuses of the TrustedBSD project are working on access control lists, event auditing, extended attributes, fine-grained capabilities, and mandatory access controls.",
	"TTA: True Audio - True Audio (TTA) is a free, simple real-time lossless audio codec, based on adaptive prognostic filters which have shown satisfactory results comparing to the majority of modern analogs.",
	"TUGZip - TUGZip is a freeware file archiver for Microsoft Windows. It handles a variety of archive formats, including some of the commonly used ones like zip, rar, gzip, bzip2, and 7z. It can even view disk image files like BIN, C2D, IMG, ISO and NRG.",
	"Turbo BASIC - Turbo BASIC is a BASIC compiler and dialect originally created by Robert 'Bob' Zale and bought from him by Borland. When Borland decided to stop publishing it, Zale bought it back from them, renamed it to PowerBASIC and set up PowerBASIC Inc. to continue support and development of it.",
	"Turbo C - Turbo C is a Borland Integrated Development Environment and compiler for the C programming language. Turbo C has been largely supplanted by Turbo C++, introduced May 1990, for both DOS and Windows and later by Borland C++.",
	"Turbo C++ - Turbo C++ is a Borland C++ compiler and Integrated Development Environment (IDE), famous for its ultra-high compilation & linkage speed - hence the term \"Turbo\". It was a part of Borland's highly popular family of compilers including Turbo Pascal, Turbo Basic, Turbo Prolog and Turbo C. Turbo C++ was a successor of Turbo C, expanding the compiler similarly to how Turbo Pascal 5.5 added object functionality to the earlier Turbo Pascal versions. Unlike Turbo Pascal, however, Turbo C++ always adhered to C++ language standards of its time. It has never been capable of compiling ISO-standard C++, however.",
	"Turbo Pascal - Turbo Pascal is a compiler and a Integrated Development Environment (IDE) for the Pascal programming language running mainly on MS-DOS, developed by Borland. The name Borland Pascal was generally reserved for the high end packages (with more libraries and standard library source code) whilst the original cheap and widely known version was sold as Turbo Pascal. The name Borland Pascal is also used more generically for Borland's dialect of Pascal. Borland has released three versions of Turbo Pascal for free: versions 1.0, 3.02 and 5.5.",
	"Turbo Software - Turbo software refers to the series of compilers created by Borland International, Inc., including Turbo Pascal, Turbo C, Turbo C++, Turbo Basic, Turbo Prolog etc.",
	"Tutorial - Tutorial, a term often used in the computer related training, refers to an instructional lesson that leads the user through key features and functions of things such as software applications, hardware devices, processes, system designs, and programming languages. The tutorial typically is set up as a series of steps that progress through levels of difficulty and understanding. For this reason, the tutorial is best followed in its logical sequence in order to understand all of the elements of what the user is trying to learn.",
	"TwinText - TwinText is a HTML based Source Code Documentation Tool. It can generate HTML documents from a variety of programming languages, including C++, C, Java, IDL, PHP, C#, and Visual Basic. It runs on Windows.",
	"UAT: User Acceptance Testing -User acceptance testing(UAT), typically the final phase in a software development process, refers to providing developed software to the targeted users to be tested for functionality. Software developers can do UAT by making the software available for a free trial to the public or by using an selected user group as a testing panel. UAT is done in order to get feedback from users to make any final adjustments to the programming before releasing the product to the general public.",
	"UIT: User Interface Toolkit - User Interface Toolkit (UIT) was a C++-language, object-oriented layer on top of the XView graphical toolkit. It was developed by Sun Microsystems employees, but not officially supported by the company. The source code is freely available.",
	"Ultrix - Ultrix is a version of Unix based on the Berkeley version, designed and implemented by Digital Equipment Corp (DEC, now part of HP) to run on their VAX and DECstation processors.",
	"UML tool: Unified Modeling Language tool - Unified Modeling Language (UML) tool is an application software that supports some or all parts of the processes or the creation of the artifacts described in the software industry standard UML, which is used in the field of software engineering.",
	"UML: Unified Modeling Language - Unified Modeling Language (UML) is a non-proprietary, object modeling and specification language used in software engineering. UML is a general-purpose modeling language that includes a standardized graphical notation that may be used to create an abstract model of a system, sometimes referred to as the UML model. UML may be considered as an extensible modeling language since it offers a profile mechanism to customize the language. If a concept you need is not present in the base language, you may introduce it by defining a stereotype.",
	"Unix - Unix (or UNIX) is a computer operating system originally developed in the 1960s and 1970s by AT&T Bell Labs. Today Unix is split into various branches, developed over time by many companies and non-profit organizations, such as contributors to the GNU project. The present owner of the UNIX trademark is The Open Group, while the present claimants on the rights to the UNIX source code are SCO Group and Novell. The UNIX operating system was designed to let multiple users access the computer at the same time and share its resources. While initially designed for medium-sized minicomputers, the operating system was soon moved to larger, more powerful mainframe computers. As personal computers grew in popularity, versions of UNIX found their way into these boxes, and a number of companies produce UNIX-based machines forthe scientific and programming communities.",
	"Unreachable Code - In computer programming, unreachable code, also known as dead code, typically consists of blocks of programming instructions or entire routines that will never be accessed because all calls to them have been removed, or code that cannot be reached for some reason. Dead code is undesirable for a number of reasons, but primarily because it suggests there is a fault in the software. Detecting dead code is a form of static analysis and involves performing control flow analysis to find any code that will never be executed regardless of the values of variables and other conditions at run time.",
	"Upgrade - An upgrade, in computer industry, refers to a new version of a software or hardware product designed to replace an older version of the same product. Sometimes, upgrade means a better version such as a professional version with more functionalities and better performance to replace a lighter version of the same product.",
	"Ups Debugger - Ups debugger is an open-source debugger developed in the late 1980s for Unix and Unix-like systems. It supports C and C++, and Fortran on some platforms. Unlike more popular debugger stacks for these platforms, ups is completely self-contained not merely a graphical front-end to lower-level debuggers like gdb (although some work has been done to make ups usable in that way). The ups user interface is built directly upon the X Window System and SunView, i.e. it does not use an intermediate toolkit such as Motif or GTK+.",
	"Upward Compatible - Upward compatible, also known as forward compatible, refers to software that runs not only on the computer for which it was designed, but also on newer and more powerful models. Upward compatibility is important because it means you can move to a newer, larger, and more sophisticated computer without converting your data. An example of upward/forward compatibility is the specification that a web browser ignore HTML tags not recognised. Ignoring data or application instructions not recognized is the typical behavior of forward compatible systems.",
	"USG Unix: Unix Support Group - Unix Support Group(USG) Unix refers to AT&T Unix commercial versions after Version 7, especially System III and System V releases 1, 2, and 3. So called because during most of the lifespan of those versions AT&T's support crew was called the \"Unix Support Group\".",
	"User Interface - The user interface is the aggregate of means by which people (the users) interact with a particular machine, device, computer program or other complex tool (the system). The user interface provides two critical functions: Input, allowing the users to manipulate the system, and Output, allowing the system to produce the effects of the users' manipulation. There are many types of user interfaces, such as GUI, Command Line, Web-based user interfaces, and touch interface, etc.",
	"Utility Computing - Utility computing, also called On Demand Computing, is a business model where computer resources are provided on an on-demand and pay-per-use basis, while in the conventional model, the user need to invest to own the system. As the utility computing provider can spread the customers' variance in resource needs, the utilization of the resources can be optimized.",
	"Utility Program - Utility program, or utility, is a type of computer programs that support using the computer, an application or a development environment. Utility programs include file management, searching for files, comparing file contents as well as performing diagnostic routines to check performance and current health of the hardware. Utilities that support a development environment can perform a myriad of tasks.",
	"Valgrind - Valgrind is a free programming tool for memory debugging, memory leak detection, and profiling. Valgrind was originally designed to be a free version of Purify for Linux on x86, but has since evolved to become a generic framework for creating dynamic analysis tools such as checkers and profilers. It is widely used by Linux programmers.",
	"Vaporware - Vaporware (also spelt as vapourware) is software or hardware which is announced by a developer well in advance of its release, but which then fails to emerge, either with or without a protracted development cycle. The term implies deception, or at least a negligent degree of optimism; that is, it implies that the announcer knows that product development is in too early a stage to support responsible statements about its completion date, feature set, or even feasibility.",
	"VB: Virtual Basic - Visual Basic (VB) is an event driven programming language and associated development environment prototyped by Alan Cooper as Project Ruby, then bought and vastly expanded by Microsoft. VB has been replaced by Visual Basic .NET. The older version of VB was derived heavily from BASIC and enables rapid application development (RAD) of graphical user interface (GUI) applications, access to databases using DAO, RDO, or ADO, and creation of ActiveX controls and objects.",
	"Vbcc - Vbcc is a highly optimizing portable and retargetable ISO C compiler. It supports ISO C according to ISO/IEC 9899:1989 and a subset of the new standard ISO/IEC 9899:1999 (C99).",
	"VBScript: Virtual Basic Script - The Visual Basic Script Edition (VBScript) is an Active Scripting language interpreted via Microsoft's Windows Script Host. The language's syntax reflects its pedigree as a variation of Microsoft's Visual Basic programming language. It has gained significant support from Windows administrators seeking an automation tool more powerful than the batch language first developed in the late 1970s.",
	"VBScript: Visual Basic Script Edition - Visual Basic Script Edition (VBScript) is an Active Scripting language interpreted via Microsoft's Windows Script Host. The language's syntax reflects its pedigree as a variation of Microsoft's Visual Basic programming language. It has gained significant support from Windows administrators seeking an automation tool more powerful than the batch language first developed in the late 1970s.",
	"Veronica: Very Easy Rodent-Oriented Net-Wide Index to Computer Archives - Very Easy Rodent-Oriented Net-wide Index to Computer Archives (Veronica) is a search engine system for the Gopher protocol. Veronica is a constantly updated database of the names of almost every menu item on thousands of Gopher servers. The Veronica database can be searched from most major Gopher menus.",
	"Vertical Software - Vertical software, also known as vertical application, is a king of software created for a specific kind of business or organization, such as hospitals or retail stores.",
	"Video Game - A video game is a computer game where a video display such as a monitor or television is the primary feedback device.",
	"Viewer Program - Viewer program is a utility software that enables you to read a file in its native format. Many shell utilities and file managers include viewers so that you can display different types of files.",
	"VirtualGL: Virtual Graphics Library - VirtualGL, abbreviated from Virtual Graphics Library, is a program to remotely display a 3D application with hardware-accelerated rendering. VirtualGL non-intrusively converts any Unix/Linux OpenGL application into a thin client application, allowing for real-time interaction on a modest LAN regardless of data or geometry size.",
	"Visual C++ - Visual C++, also known as MSVC, is an Integrated Development Environment (IDE) product for the C and C++ programming languages engineered by Microsoft. It has tools for developing and debugging C++ code, especially that written for the Microsoft Windows API, the DirectX API, and the Microsoft .NET Framework."
]
