[
	"CD Ripper - A CD ripper, also known as CD grabber or CD extractor, is a piece of software designed to extract raw digital audio (in format commonly called CDDA) from a compact disc to a file or other output.",
	"CD/DVD Authoring - In computing, CD authoring or DVD authoring is the process of recording source material€”video, audio or other data€”onto a compact disc or DVD in a particular format.Authoring is commonly done in software on personal computers and workstations equipped with CD or DVD recorders. There are, however, stand-alone devices like personal video recorders which can also author and record discs.",
	"CDDL: Common Development and Distribution License - Common Development and Distribution License (CDDL) is an open source and Free software license, produced by Sun Microsystems, based on the Mozilla Public License (MPL), version 1.1. The CDDL was submitted for approval to the Open Source Initiative on December 1, 2004 and approved as an open source license in mid-January 2005. The CDDL is one of the 9 preferred licenses listed by the Open Source Initiative (OSI).",
	"CeCILL: CEA CNRS INRIA Logiciel Libre - CEA CNRS INRIA Logiciel Libre (CeCILL) is a Free Software license adapted to both International and French legal matters, in the spirit of and retaining compatibility with the GNU General Public License.",
	"Cedega - Cedega, formerly known as WineX, is TransGaming Technologies' proprietary fork of Wine, which is designed specifically for running games written for Microsoft Windows under Linux. As such, its primary focus is implementing the DirectX API.",
	"Celestia - Celestia is an open source, 3D astronomy program for Windows, Mac OS X, and Linux created by Chris Laurel. The program, based on the Hipparcos Catalogue, allows user to display objects ranging in scale from artificial satellites to entire galaxies in three dimensions using OpenGL. Unlike most planetarium software, the user is free to travel about the Universe.",
	"Censorware - Censorware is a category of software that is used to do Internet content blocking or Internet filtering. In other words, Censorware limits the user's access to content on the Internet. Libraries and schools commonly use this type of filtering software to restrict its users from accessing pornography. Parents may also use censorware to restrict their children's access to the Internet.",
	"CFG: Control Flow Graph - A control flow graph (CFG) is an abstract data structure used in compilers. It is an abstract representation of a procedure or program, maintained internally by a compiler. Each node in the graph represents a basic block, i.e. a straight-line piece of code without any jumps or jump targets; jump targets start a block, and jumps end a block. Directed edges are used to represent jumps in the control flow. There are, in most presentations, two specially designated blocks: the entry block, through which control enters into the flow graph, and the exit block, through which all control flow leaves.",
	"CFML: ColdFusion Markup Language - ColdFusion Markup Language(CFML) is a proprietary markup language developed by Allaire for use with ColdFusion. CFML is a tag-based Web scripting language supporting dynamic Web page creation and database access in a Web server environment. In the language, ColdFusion tags are embedded in HTML files.",
	"CGI: Common Gateway Interface - The Common Gateway Interface (CGI) is a standard for external gateway programs to interface with information servers such as HTTP servers. CGI scripts are commonly used on Web sites to achieve customised results. Generally, when the visitor performs some action, such as filling in a form or clicking on a link, the server executes a script using information input by the visitor. This allows the appearance or behaviour of the Web site to be customised for that visitor.",
	"cgi-bin - cgi-bin is the usual name of the server directory in which Common Gateway Interface (CGI) programs are held.",
	"CGI: Computer Generated Imagery - Computer generated imagery (CGI), also known as Computer animation, is the application of the field of computer graphics (or more specifically, 3D computer graphics) to special effects. CGI is used in movies, television programs and commercials, and in printed media. Video games most often use real-time computer graphics (rarely referred to as CGI), but may also include pre-rendered \"cut scenes\" and intro movies that would be typical CGI applications.",
	"Character - In computer and machine-based telecommunications terminology, a character is a unit of information that roughly corresponds to a grapheme or a grapheme-like unit or symbol, such as in an alphabet or syllabary in the written form of a natural language. An example of a character is a letter, numeral, or punctuation mark. This includes all the ASCII and extended ASCII characters, including the space and control characters. In character-based software, everything that appears on the screen, including graphics symbols, is considered to be a character. In graphics-based applications, the term character is generally reserved for letters, numbers, and punctuation.",
	"Character Code - Character code is a computer code which represents a particular character or symbol with specific meaning. Most current operating systems use 8-bit character codes: some of which represent commands to the computer, while most of which represent the AlphaNumeric symbols of the main Western Languages. Other languages that use extended or alternate writing systems, such as Asian languages, use 16 bits and are so called Double Byte charater sets.",
	"Character Encoding - A character encoding or character set (sometimes referred to as code page) consists of a code that pairs a sequence of characters from a given set with something else, such as a sequence of natural numbers, octets or electrical pulses, in order to facilitate the storage of text in computers and the transmission of text through telecommunication networks. Common examples include Morse code, which encodes letters of the Latin alphabet as series of long and short depressions of a telegraph key; and ASCII, which encodes letters, numerals, and other symbols, both as integers and as 7-bit binary versions of those integers, generally extended with an extra zero-bit to facilitate storage in 8-bit bytes (octets).",
	"Character Mapping - Character mapping refers to the process of using a table used in an operating system or font to map the character codes to the glyphs used in a font. Most character encoding uses an 8-bit system allowing a maximum of 256 character codes. Extended or non-AlphaNumeric languages often use 16-bit or Double Byte encoding. Also, Character Maps or not necessarily cross platform compatible. For example, the Macintosh and Windows operating systems use differing character maps. However, Type 1 fonts do contain the glyphs necessary for both these mappings and so work in both Macintosh and Windows systems and others.",
	"Character Repertoire - Character repertoire is the set of all characters onto which a coded character set maps integers (code positions).",
	"Character Set - Character set is a defined list of characters recognized by the computer hardware and software. Each character is represented by a number. The ASCII character set, for example, uses the numbers 0 through 127 to represent all English characters as well as special control characters. European ISO character sets are similar to ASCII, but they contain additional characters for European languages.",
	"Charmap: Character Map - Character Map (charmap.exe) is an applet included with Microsoft Windows operating systems which can be used to inspect the characters in any installed font, to check what keyboard input is used to select those characters, and to copy characters to the clipboard in lieu of typing them in.",
	"Checkpoint - Checkpoint, in computer programming, is the point in the program source code where progress can be halted, while running, until conditions are suitable for progression to the next stage.",
	"Chinook Checkers Program - Chinook is the first computer program that won the world checker champion title in the competition against humans. Chinook program's algorithm includes an opening book, a library of opening moves, from games played by grandmasters, deep search algorithm, good move evaluation function and the end-game database having all positions with eight or fewer pieces. The linear handcrafted evaluation function considered several features of the game board including piece count, kings count, trapped kings, turn, runaway checkers (unimpeded path to be kinged) and other minor factors. All of Chinook's 'knowledge' was programmed in by its creators vs the program learning strategies.",
	"CIF: Common Intermediate Format - Common Intermediate Format (CIF) is a video format used in videoconferencing systems that supports both NTSC and PAL signals. CIF is part of the ITU H.261 videoconferencing standard. It specifies a data rate of 30 frames per second (fps), with each frame containing 288 lines and 352 pixels per line. CIF is used to standardize the horizontal and vertical resolutions in pixels of YUV sequences in video signals. CIF has many variations for different resolutions and technologies.",
	"CIM: Common Information Model - Common Information Model (CIM), a standard defined by organizations such as the Distributed Management Task Force (DMTF) and the IEC, provides a schema that defines how the managed elements in an IT environment are represented as a common set of objects and relationships between them. CIM allows multiple parties to exchange management information about these managed elements. CIM not only represents these managed elements and the management information, but also provides means to actively control and manage these elements. By using a common model of information, management software can be written once and work with many implementations of the common model without complex and costly conversion operations or loss of information. The managed elements represented in the CIM Schema include most of today's elements in an IT environment, for example Computer systems, Operating systems, Networks, Middleware, Services and Storage.",
	"Citadel Software - Citadel is software for running a Bulletin Board System. The first Citadel came online in 1980 with a single 300 baud modem, and some versions of the software, supporting thousands of simultaneous users, are still in use today. Citadel development has always been collaborative with a strong push to keep the source code in the public domain. This makes Citadel one of the oldest surviving FOSS projects.",
	"CL: Common LISP - Common Lisp (CL) is a dialect of the Lisp programming language, standardised by ANSI X3.226-1994. Developed to standardize the divergent variants of Lisp which predated it, it is not an implementation but rather a language specification. Several implementations of the Common Lisp standard are available, including commercial products and open source software. Common Lisp is a general-purpose programming language, in contrast to Lisp variants such as Emacs Lisp and AutoLISP which are embedded extension languages in particular products. Unlike many earlier Lisps, Common Lisp (like Scheme) uses lexical variable scope.",
	"Class - Class, in the context of object oriented computer language, is the prototype for an object in an object-oriented language; analogous to a derived type in a procedural language. A class may also be considered to be a set of objects which share a common structure and behaviour. The structure of a class is determined by the class variables which represent the state of an object of that class and the behaviour is given by a set of methods associated with the class.",
	"Class Library - Class library is a term used in the object oriented language, whcih refers to collections of class definitions and implementations. Software companies like Microsoft created class libraries for reuses in programming. Class libraries and toolkits have the reputation of being open but too-much-assembly-required. A best of both worlds is to deliver a useful application composed from a toolkit where disassembly and reassembly for evolution is supported.",
	"Clean Install - Clean install refers to a way to install or upgrade an OS to a computer system. There are two ways to conduct a clean install. (1) upgrade of an operating system (OS) on a hard drive that already has an OS running off of it without carrying over any settings of the older OS, such as user preferences or information about the hardware and/or the software. (2) To install an OS on a hard drive that does not already have an OS installed on it or a newly formatted hard drive.",
	"ClearCase - ClearCase, developed by Rational software and now owned by IBM, provides lifecycle management and control of software development assets. With integrated version control, automated workspace management, parallel development support, baseline management, and build-and-release management, ClearCase provides the capabilities needed to create, update, build, deliver, reuse and maintain business-critical assets.",
	"ClearDDTS - ClearDDTS is a Distributed Defect Tracking System developed by Rational software and now owned by IBM. ClearDDTS provides change request management for UNIX development, specifically designed to track and manage defects and enhancement requests found during development and quality assurance testing. ClearDDTS can be tightly integrated with software configuration management products, such as Rational ClearCase, to effectively manage change throughout the software development lifecycle.",
	"ClearQuest - ClearQuest, developed by Rational software and now owned by IBM, enables better insight, predictability and control of the software development process. Through flexible workflow management and defect and change-tracking across the application lifecycle, Rational ClearQuest helps to automate and enforce development processes, manage issues throughout the project lifecycle, and facilitate communication between all stakeholders across the enterprise.",
	"Client - In client/server computing, a client is a system that accesses a (remote) service on another computer by some kind of network. The term was first applied to devices that were not capable of running their own stand-alone programs, but could interact with remote computers via a network. These dumb terminals were clients of the time-sharing mainframe computer.",
	"Client-Side - In computer networking, the term client-side refers to operations that are performed by the client in a client-server relationship. Typically, a client is a software program, such as a web browser, that runs on a user's local computer or workstation and connects to a server as necessary. Operations may be performed on the client-side because they require access to information or functionality that is available on the client, but not on the server because the user needs to observe them or provide input, or because the server lacks the processing power to perform the operations in a timely manner for all of the clients it serves.",
	"CLISP - CLISP, a Common Lisp implementation, is part of the GNU project, originally developed by Bruno Haible and Michael Stoll. CLISP includes both an interpreter and a compiler (that compiles to bytecode), as well as a debugger, a socket interface, a high-level foreign language interface, strong internationalization support, and an object system (CLOS, MOP). It is written in C and Common Lisp.",
	"Closed Source - Closed source is a term invented as an antonym for open source and used to refer to any program whose licensing terms do not qualify as open source. Generally, it means that the customer will only get a binary version of the computer program they licensed and no copy of the program's source code, rendering modifications to the software practically impossible from the technical side. The source code in this development model is regarded as a trade secret of the company, so parties that may get source code access, such as colleges, have to sign non-disclosure agreements in advance.",
	"ClosedBSD - ClosedBSD is a derivative of FreeBSD aimed at providing firewall and Network Address Translation services. One of the advantages of ClosedBSD is that it can be run directly off a floppy disk or a CD-ROM, with no hard drive required. In spite of its small size, the software includes a fully-functional ncurses-based interface.",
	"Cloud computing - Shared computing services provided on demand by computers accessed over the Internet.\n",
	"cmd.exe - Cmd.exe is the command line interpreter on OS/2 and on Windows NT-based systems (including Windows 2000, XP, and Server 2003). It is the analog of command.com in MS-DOS and Windows 9x systems, or of the shells used on Unix systems. cmd.exe improves on command.com in several areas. It has a greater number of built-in commands, and the error reporting is better. In the OS/2 version of cmd.exe, errors are reported in whatever the current language of system is, their text being taken from the system message files. The help command can then be issued with the error message number to obtain further information. Both the OS/2 and the Windows NT versions of cmd.exe have more detailed error messages than that of command.com.",
	"CML: Chemical Markup Language - Chemical Markup Language(CML) is an approach to managing molecular information using tools such as XML and Java. Chemical information is traditionally stored in many different files types which inhibit reuse of the documents. CML uses XML's portability to help CML developers and chemists design interoperable documents. There are a number of tools that can generate, process and view CML documents. Publishers can distribute chemistry within XML documents by using CML.",
	"CMM: Capabilities Maturity Model - Capability Maturity Model (CMM), developed by the Software Engineering Institute (SEI) at Carnegie Mellon University, is a collection of instructions an organization can follow with the purpose to gain better control over its software development process. The CMM ranks software development organizations according to a hierarchy of five process maturity levels. Each level ranks the development environment according to its capability of producing quality software. A set of standards is associated with each of the five levels. The standards for level one describe the most immature, or chaotic, process, and the standards for level five describe the most mature, or quality, process.",
	"Coco/R - Coco/R is a compiler generator (Compiler-compiler), which takes an attributed grammar of a source language and generates a scanner and a parser for this language. The scanner works as a deterministic finite automaton. The parser uses recursive descent. LL(1) conflicts can be resolved by a multi-symbol lookahead or by semantic checks. Thus the class of accepted grammars is LL(k) for an arbitrary k.",
	"COCOMO: Constructive Cost Model - Constructive Cost Model(COCOMO) is a method of estimating the number of man-months it will take to develop a software product. There are three levels in the COCOMO: - 1) Basic COCOMO - is a static, single-valued model that computes software development effort (and cost) as a function of program size expressed in estimated lines of code. - 2) \"cost drivers\" that include subjective assessment of product, hardware, personnel and project attributes. - 3) Detailed COCOMO - incorporates all characteristics of the intermediate version with an assessment of the cost driver's impact on each step (analysis, design, etc.) of the software engineering process.",
	"Code - Code, in Computer Programming refers to source code or machine code. Source code is any series of statements written in some human-readable computer programming language, while machine code refers to instructions for a computer processor in some machine language. The word \"code\" is often used to distinguish instructions from data.",
	"Code Co-op - Code Co-op is the peer-to-peer version control system made by Reliable Software. Code Co-op uses peer-to-peer architecture to share projects among developers and to control changes to files. Instead of using a centralized database (the repository), it replicates its own database on each computer involved in the project.",
	"Code Generation - Code generation is the process by which a compiler converts a syntactically-correct program (source code) into a series of instructions that could be executed by a machine (Machine code). The input to the code generation stage typically consists of a parse tree, abstract syntax tree, or intermediate language code; the target machine may be a physical machine such as a microprocessor, or an abstract machine such as a virtual machine or an intermediate language, (human-readable code).",
	"Codec: Compression/Decompression - In computing world, Codec refers to compression/decompression, which typically is an algorithm or specialized computer program that encodes or reduces the number of bytes consumed by large files and programs. Files encoded with a specific codec require the same codec for decoding. MPEG is a type of codec algorithms.",
	"Coded Character Set - Coded character set, also known as character encoding or character set, refers to the mapping from a set of integers to a set of characters. This mapping is generally 1:1. In ASCII code set, for example, the code position 65 in ASCII maps only to \"A\", and it's the only position that maps to \"A\".",
	"CodeView - CodeView was a standalone debugger that originally shipped with Microsoft C/C++ 7.0 and earlier. It also shipped with Visual Basic for DOS. Upon the release of Microsoft Visual C++ 1.0, the functionality of CodeView was integrated into a single programming environment, known as the Integrated Development Environment (IDE). This integration is seen by many developers to be a more natural way of developing software since coding and debugging can be done without switching programs or context.",
	"CodeWarrior - CodeWarrior is an integrated development environment from Metrowerks for the Macintosh, Microsoft Windows, Linux and other systems such as embedded systems from Freescale Semiconductor. (Metrowerks is a wholly-owned subsidiary of Freescale.) Specialized versions for the Sony PlayStation 2, Nintendo GameCube, Palm OS, and Symbian OS also exist, and there was even a version for BeOS.",
	"Coding - In computer hardware, coding is the process of converting information obtained on a subject or unit into coded values (typically numeric) for the purpose of data storage, management, and analysis. While in software, coding means implement a programing logic using a specific language such as C or C++. In cryptography, coding refers to the act of writing in code or cipher.",
	"COE: Common Operating Environment - Common operating environment (COE) specifies a common IT architecture within an organization and promotes interoperability and cross-platform capabilities among an organization's devices. In a COE, all workstations within an organization run the same software and use the same interfaces so that its devices are standardized and information presentation and platform interfaces are consistent throughout the organization.",
	"Cognitive Architecture - A cognitive architecture is a computational process that acts like a certain cognitive system, most often, like a person, or acts intelligent under some definition. The term architecture implies an approach that attempts to model not only behavior, but also structural properties of the modelled system.",
	"ColdFusion - ColdFusion is a product that includes a server and a development toolset designed to integrate databases and Web pages. ColdFusion was created by Allaire Corporation of Cambridge, Mass. which merged with Macromedia and now part of Adobe Systems. With ColdFusion, a user could enter a zip code on a Web page, and the server would query a database for information on the nearest movie theaters and present the results in HTML form. Cold Fusion Web pages include tags written in Cold Fusion Markup Language (CFML) that simplify integration with databases and avoid the use of more complex languages like C++ to create translating programs.",
	"Collaborative Software - Collaborative software, also called social software, is a type of software that allows people to work together on the same documents and projects over local and remote networks. Collaborative software embraces the communications systems as well, including e-mail, videoconferencing, instant messaging and chat. Lotus Notes is an example of collaborative software.",
	"COM: Component Object Model - Component Object Model (COM) is a Microsoft platform for software componentry introduced in 1993, largely to replace the interprocess communication mechanism DDE used by the initial release of OLE. It is used to enable interprocess communication and dynamic object creation in any programming language that supports the technology. The term COM is often used in the software development world as an umbrella term that encompasses the OLE, OLE Automation, ActiveX, COM+ and DCOM technologies. COM provides a language-neutral way of implementing objects such that they can be used in environments different from the one they were created in, even across machine boundaries. For well-authored components, COM allows reuse of objects with no knowledge of their internal implementation because it forces component implementers to provide well-defined interfaces that are separate from the implementation.",
	"Command - Command, in computing, refers to an instruction to a computer or device to perform a specific task. Every program that interacts with people responds to a specific set of commands. The set of commands and the syntax for entering them is called the user interface. Commonly a command is a directive to some kind of command line interface, such as a command interpreter. Commands come in different forms such as: 1) special words (keywords) that a program understands 2) function keys 3) choices in a menu 4) buttons or other graphical objects on your screen.",
	"Command Interpreter - Command interpreter is a program which reads textual commands from the user or from a file and executes them. Some commands may be executed directly within the interpreter itself (e.g. setting variables or control constructs), others may cause it to load and execute other files. Unix's command interpreters are known as shells.",
	"Command.com - COMMAND.COM is the name for the default operating system shell (or command line interpreter) for DOS and 16/32bits versions of Windows (95/98/98 SE/Me). It also has an additional role, as the first program run after boot, hence being responsible for setting up the system by running the AUTOEXEC.BAT configuration file, and being the ancestor of all processes. COMMAND.COM has two distinct modes of work. First is the interactive mode, in which the user types commands which are then executed immediately. The second is the batch mode, which executes a predefined sequence of commands stored as a text file with the extension .BAT. Its function as the default command interpreter is analogous to that of the Unix shells, although COMMAND.COM's functionality is considerably more limited than that of its Unix counterparts. cmd.exe is COMMAND.COM's successor on Windows NT/2000/XP/2003 and OS/2. COMMAND.COM is also available on those systems to provide compatibility when running DOS applications.",
	"Commercial Software - Commercial software is a computer software sold for commercial purposes or that serves commercial purposes. The most famous examples of commercial software are the products offered on the IBM PC and clones in the 1980s and 90s, including famous programs like Lotus 123, Word Perfect and the various parts that make up Microsoft Office. Commercial software may be re-packaged in boxes and sold in retail stores or directly from vendors. Downloadable software over the Internet for commercial purpose is becoming popular.",
	"Common Core Services - Common core services are services that the operating system has to take care of, these are usually administrated by the Kernel of an operating system. These may include: - Memory management - Internet functionality - Network Security features - Library manager - loader - Execute applications - Disk access - User interface - Application programming interface",
	"Communications Software - Communications software refers to the type of software that is used for network communication purpose. For example, the software used to send and receive data over telephone lines through modems.",
	"Compatible - Compatible, in computer industry, refers to the ability of one device or program to work with another device or program. For example, a printer and a computer are said to be compatible if they can be connected to each other. An IBM compatible PC, on the other hand, is a computer that can run the same software as an IBM PC.",
	"Compiler - Compiler is a type of computer program that translates source code into object code. A compiler is likely to perform many or all of the following operations: lexing, preprocessing, parsing, semantic analysis, code optimizations, and code generation.",
	"Compiler Bug - A compiler bug is a type of computer bug. Compiler bug may cause translating the source program incorrectly, so that when the program runs it produces the wrong answer or some error message that does not really relate to the original program. Some compilers also attempt to optimize the source code during translation, so that it will run faster, or use less memory, or both. This optimization is often the most complicated part of a compiler, and hence is likely to have the most bugs.",
	"Compiler Directive - Compiler directive is data embedded in source code by programmers to tell compilers some intention about compilation. A compiler directive often tells the compiler how to compile; other source code tells the compiler what to be compiled.",
	"Compiler Optimization - Compiler optimization is the process of using some optimization techniques that have been programmed into a compiler, to improve the performance or reach other objectives of the source code. These techniques are automatically applied by the compiler whenever they are appropriate. Because programmers no longer need to manually apply these techniques, programmers are free to write source code in a straightforward manner, expressing their intentions clearly. Then the compiler can choose the most efficient way to handle the implementation details.",
	"Compiler-Compiler - A compiler-compiler, also known as a parser generator, is a utility for generating the source code of a parser, interpreter or compiler from an annotated language description in the form of a grammar (usually in BNF) plus code that is associated with each of the rules of the grammar that should be executed when these rules are applied by the parser. These pieces of code are sometimes referred to as semantic action routines since they define the semantics of the syntactic structure that is analysed by the parser.",
	"Componetware: Component Software - Component software (componentware) is a type of software designed to work as a component of a larger application. The goal of component software is to standardize the interfaces between software components so that all components can work together seamlessly. Therefore, ideally, it is possible to mix software components from different manufacturers in a single system. Two standards -- OLE and OpenDoc -- are designed to help programmers develop components that can work together.",
	"Computational Linguistics - Computational linguistics is an interdisciplinary field dealing with the statistical and logical modeling of natural language from a computational perspective. This modeling is not limited to any particular field of linguistics. Computational linguistics was formerly usually done by computer scientists who had specialized in the application of computers to the processing of a natural language. Recent research has shown that language is much more complex than previously thought, so computational linguistics work teams are now sometimes interdisciplinary. Computational linguistics draws upon the involvement of linguists, computer scientists, experts in artificial intelligence, cognitive psychologists and logicians, amongst others.",
	"Computational Science - Computational science, also known as scientific computing, is the field of study concerned with constructing mathematical models and numerical solution techniques and using computers to analyze and solve scientific and engineering problems. In practical use, it is typically the application of computer simulation and other forms of computation to problems in various scientific disciplines such as Physics. Computational science and computer science are very different fields.",
	"Computer Animation - Computer animation, also known as Computer generated imagery (CGI) is the art of creating moving images via the use of computers. It is a subfield of computer graphics and animation. Increasingly it is created by means of 3D computer graphics, though 2D computer graphics are still widely used. Sometimes the target of the animation is the computer itself, sometimes the target is another medium, such as film.",
	"Computer Game - A computer game is a computer-controlled game with or without video technologies involved. In common usage, a \"computer game\" or a \"PC game\" refers to a game that is played on a personal computer. There always must also be some sort of input device, usually in the form of button/joystick combinations (on arcade games), a keyboard & mouse/trackball combination (computer games), or a controller (console games), or a combination of any of the above. Also, more esoteric devices have been used for input (see also Game controller). Usually there are rules and goals, but in more open-ended games the player may be free to do whatever they like within the confines of the virtual universe.",
	"Computer Graphics - Computer graphics (CG) is the field of visual computing, where one utilizes computers both to generate visual images synthetically and to integrate or alter visual and spatial information sampled from the real world. Computer graphics field can be divided into several areas: real-time 3D rendering (often used in video games), computer animation, video capture and video creation rendering, special effects editing (often used for movies and television), image editing, and modeling (often used for engineering and medical purposes). Development in computer graphics was first fueled by academic interests and government sponsorship. However, as real-world applications of computer graphics in broadcast television and movies proved a viable alternative to more traditional special effects and animation techniques, commercial parties have increasingly funded advances in the field.",
	"Computer Science - Computer science, or computing science, is an academic field that studys the theoretical foundations of information and computation and their implementation and application in computer systems. Computer science has many sub-fields; some emphasize the computation of specific results (such as computer graphics), while others (such as computational complexity theory) relate to properties of computational problems. Still others focus on the challenges in implementing computations. For example, programming language theory studies approache to describing computations, while computer programming applies specific programming languages to solve specific computational problems.",
	"ConceptBase - ConceptBase is a deductive and object-oriented database management system based on Datalog rather than SQL. It stores all factual information in a single flat data structure called P-facts. On top of that deductive rules, integrity constraints, and queries are defined to capture the semantics of the application domain. The main application domain of ConceptBase is conceptual modeling, model management, and meta modeling.",
	"Config Files: Configuration Files - In computing, configuration files (config files) are used to configure the initial settings for some computer programs. They are used for user applications, server processes and operating system settings. The files are often written in ASCII (rarely UTF-8) and line-oriented, with lines terminated by a newline or carriage return/line feed pair, depending on the operating system. They may be considered a simple database.",
	"CONFIG.SYS - CONFIG.SYS is the primary configuration file for the MS-DOS and OS/2 operating systems. It is a special file that contains setup or configuration instructions for the computer system. The commands in this file configure DOS for use with devices and applications in the system. The commands also set up the memory managers in the system. After processing the CONFIG.SYS file, DOS proceeds to load and execute the command shell specified in the shell= line of CONFIG.SYS, or COMMAND.COM if there is no such line. The command shell in turn is responsible for processing the AUTOEXEC.BAT file.",
	"Configuration - In communications or computer systems, configuration is the way a system is set up, or the assortment of components that make up the system. Configuration can refer to either hardware or software, or the combination of both. Often, configuration pertains to the choice of hardware, software, firmware, and documentation. The configuration affects system function and performance.",
	"Configuration Management - In software development, configuration management is a system for keeping track of large software projects. Configuration management system include functions such as version control and automatically documents all components used to build executable programs. It is able to recreate each build as well as to recreate earlier environments in order to maintain previous versions of a product. It may also be used to prevent unauthorized access to files or to alert the appropriate users when a file has been altered.",
	"Constant Folding - Constant folding is one of the compiler optimization techniques used by many modern compilers. Constant folding is the process of simplifying constant expressions at compile time. Terms in constant expressions are typically simple literals, such as the integer 2, but can also be variables whose values are never modified, or variables explicitly marked as constant.",
	"Constant Propagation - Constant propagation is one of the compiler optimization techniques used by many modern compilers. Constant propagation is the process of substituting the values of known constants in expressions at compile time. Such constants include those defined above, as well as intrinsic functions applied to constant values.",
	"Constraint Logic Programming - Constraint logic programming is a form of constraint programming, in which logic programming is extended to include concepts from constraint satisfaction. A constraint logic program is a logic program that contains constraints in the body of clauses. An example of a clause including a constraint is A(X,Y) :- X+Y>0, B(X), C(Y). In this clause, X+Y>0 is a constraint; A(X,Y), B(X), and C(Y) are literals like in regular logic programming. Intuitively, this clause tells one condition under which the statement A(X,Y) holds: this is the case if X+Y is greater than zero and both B(X) and C(Y) are true.",
	"Constraint Programming - Constraint programming is a programming paradigm where relations between variables can be stated in the form of constraints. Constraints differ from the common primitives of other programming languages in that they do not specify a step or sequence of steps to execute but rather the properties of a solution to be found. The constraints used in constraint programming are of various kinds: those used in constraint satisfaction problems, those solved by the simplex algorithm, and others. Constraints are usually embedded within a programming language or provided via separate software libraries.",
	"Constraint Satisfaction - In artificial intelligence and operations research, constraint satisfaction is the process finding a solution to a set of constraints. Such constraints express allowed values for variables, and a solution is therefore an evaluation of these variable that satisfies all constraints.",
	"Content Management System - A content management system is a computer software system for organizing and facilitating collaborative creation of documents and other content. For example, a content management system may be a web application used for managing websites and web content. They can also be used for storage and single sourcing of documentation for a firm including but not limited to operators' manuals, technical manuals, sales guides, etc.",
	"Control Panel - Control panel refers to the front end of a system which can set the configuration of the system. For example, in a PC or a Macintosh, control panel is part of the operating system that has the ability to control an aspect of system configuration, such as the display, software add/remove, language and network properties.",
	"Cooperative Multitasking - Cooperative multitasking, also known as non-preemptive multitasking, is a form of multitasking where it is the responsibility of the currently running task to give up the processor to allow other tasks to run. This contrasts with pre-emptive multitasking where the task scheduler periodically suspends the running task and restarts another. Cooperative multitasking has the advantage of making the operating system design much simpler, but it also makes it less stable because a poorly designed application may not cooperate well, and this often causes system freezes.",
	"Copy Propagation - Copy propagation, a optimization technique in the program compiler, is the process of replacing the occurrences of targets of direct assignments with their values. A direct assignment is an instruction of the form x = y, which simply assigns the value of y to x. Copy propagation is a useful \"clean up\" optimization frequently used after other optimizations have already been run.",
	"Copycat - Copycat refers to the tendency of humans to duplicate the behavior of others. Copycat is also the name of a model of analogy making and human cognition based on the concept of the parallel terraced scan, developed by Douglas Hofstadter, Melanie Mitchell, and others.",
	"Copyleft - In a non-legal sense, copyleft, a play on the word copyright, is the opposite of copyright. Copyleft refers to the practice of using copyright law to remove restrictions on the distribution of copies and modified versions of a work for others and require the same freedoms be preserved in modified versions. A widely used copyleft license is the GNU General Public License (GPL). Many fans of copyleft media believe that copyleft is a cross between copyright and public domain.",
	"Copyright - Copyright is a set of exclusive rights regulating the use of a particular expression of an idea or information, including but not limited to art designs, computer software, books, documents etc. At its most general, it is literally \"the right to copy\" an original creation. In most cases, these rights are of limited duration. The symbol for copyright is ©, and in some jurisdictions may alternately be written (c).",
	"Copyright Infringement - The copyright infringement of software refers to several practices when done without the permission of the copyright holder: - 1. Creating a copy and selling it. This is the act most people refer to as software piracy. It is illigel in most countries. - 2. Creating a copy and giving it to someone else. This constitutes copyright infringement in most jurisdictions. It is not infringing under specific circumstances such as fair use and fair dealing. - 3. Creating a copy to serve as a backup. This is seen as a fundamental right of the software-buyer in some countries. It can be infringement, depending on the laws and the case law interpretations of those laws. - 4. Renting the original software. Software licenses often try to restrict the usual right of a purchaser of a copyrighted work to let others borrow the work. In some jurisdictions the validity of such restrictions are disputed. - 5. Reselling the original software. Licenses often say that the buyer does not buy the software but instead pays for the right to use the software. Therefore, the buyer can not resell the software without specific permission of the software vendor.",
	"CORC: CORnell Compiler - CORnell Compiler(CORC) was a simple computer language developed at Cornell University in 1962 to serve students for math problems. Its developers, industrial engineering professors Richard Conway and William Maxwell and mathematics professor Robert J. Walker, sought to create a diagnostic compiler in PL/I which could both expose math and engineering students to computing and remove the burden of mechanical problem-solving from their professors.",
	"CORE: Challenge of Reverse Engineering - Challenge of Reverse Engineering (CORE) is a software cracking group for the IBM PC which was founded in June of 1997 by a team of members from Ontario, Canada. Within four years the group made more than 10,000 releases (cracks, key generators and the like). These days the group is growing larger and there are already subgroups -- COREPDA (which is \"working\" with software for PocketPC, PDA etc.) and COREUtile. The Group CORE is today active and still \"working\".",
	"CosmicOS - CosmicOS is a self-contained message designed to be understood primarily by treating it as a computer program and executing it. Self-contained messages are of interest for CETI research, but there is much difference of opinion over the most appropriate encoding and broadcast medium to use. CosmicOS is released in modular form, so that the basic message can be adapted to a particular concrete instantiation.",
	"Course Management System - A course management system is a computer program that facilitates computerised learning or e-learning, especially by helping teachers and learners with course administration. Such e-learning system is also called Learning Management Systems (LMS), Virtual Learning Environments (VLE), education via computer-mediated communication (CMC) or Online Education.",
	"Crack Intro - A crack intro, also known as a cracktro, loader, or just intro, is a small introduction sequence added to cracked software, designed to inform the user which \"cracking crew\" or individual cracker was responsible for removing the software's copy prevention and distributing the crack.",
	"Critical Section - In computer programming a critical section is a piece of code or a set of instructions that can only be executed by one process or thread at a time. If the instructions are interrupted, a race condition might occur. It will usually terminate in fixed time, and a process will only have to wait a fixed time to enter it. Some synchronisation mechanism is required at the entry and exit of the critical section to ensure exclusive use.",
	"CRM: Customer Relationship Management - Customer Relationship Management(CRM) is an information system that is used to plan, schedule and control the presales and postsales activities in an organization to manage customer relationships. CRM embraces all aspects of dealing with prospects and customers, including the call center, sales force, marketing, technical support and field service. There are three parts of application architecture of CRM: - Operational - automation to the basic business processes (marketing, sales, service) - Collaborative - ensures the contact with customers (phone, email, fax, web, sms, post, in person)",
	"Cron - Cron is a Unix application that runs jobs for users and administrators at scheduled times of the day."
]
